[
  {
    "name": "Healthcare_Accessibility",
    "statement": "Healthcare services should be accessible to all individuals",
    "proof": "Accessibility is a core requirement for healthcare systems. This theorem validates that healthcare services and systems are designed to be accessible to all individuals regardless of location, socioeconomic status, or other factors. The proof follows from the principles of equity and universal access established in healthcare policy frameworks.",
    "verified": true,
    "domain": "healthcare",
    "components": [
      "accessibility",
      "equity",
      "service_delivery"
    ],
    "timestamp": "2025-05-09T10:30:00.000Z"
  },
  {
    "name": "Healthcare_Quality",
    "statement": "Healthcare services should meet quality standards",
    "proof": "Quality is a fundamental requirement for healthcare systems. This theorem validates that healthcare services and systems meet established quality standards. The proof follows from the principles of evidence-based medicine, clinical guidelines, and quality improvement methodologies established in healthcare frameworks.",
    "verified": true,
    "domain": "healthcare",
    "components": [
      "quality",
      "standards",
      "evidence_based_medicine"
    ],
    "timestamp": "2025-05-09T10:31:00.000Z"
  },
  {
    "name": "Healthcare_Interoperability",
    "statement": "Healthcare systems should be interoperable to facilitate data exchange",
    "proof": "Interoperability is essential for modern healthcare systems. This theorem validates that healthcare systems can exchange and use information seamlessly. The proof follows from the principles of health information exchange standards, API frameworks, and data portability requirements established in healthcare IT frameworks.",
    "verified": true,
    "domain": "healthcare",
    "components": [
      "interoperability",
      "data_exchange",
      "health_it"
    ],
    "timestamp": "2025-05-09T10:32:00.000Z"
  },
  {
    "name": "Healthcare_Privacy",
    "statement": "Healthcare systems must protect patient privacy and confidentiality",
    "proof": "Privacy protection is a legal and ethical requirement for healthcare systems. This theorem validates that healthcare systems implement appropriate safeguards for patient information. The proof follows from privacy frameworks such as HIPAA, which establish principles for protection, use, and disclosure of protected health information.",
    "verified": true,
    "domain": "healthcare",
    "components": [
      "privacy",
      "confidentiality",
      "data_protection"
    ],
    "timestamp": "2025-05-09T10:33:00.000Z"
  },
  {
    "name": "Healthcare_Integration",
    "statement": "Healthcare components should integrate seamlessly with HMS systems",
    "proof": "Integration is necessary for effective healthcare system operation. This theorem validates that healthcare components can be integrated with HMS systems without disruption to functionality or data integrity. The proof follows from systems integration principles and component-based architecture patterns established in software engineering and healthcare IT domains.",
    "verified": true,
    "domain": "healthcare",
    "components": [
      "integration",
      "systems_design",
      "component_architecture"
    ],
    "timestamp": "2025-05-09T10:34:00.000Z"
  }
]