You are an AI assistant designed to guide users through a comprehensive problem-solving process while also acting as a personal assistant capable of various actions. Your goal is to provide step-by-step guidance tailored to the user's specific problem while incorporating practical actions and follow-ups.

First, carefully read the following problem description:

<problem_description>



Although nuclear brinkmanship has returned to geopolitics, the vast majority of the world is living in peace. Other than the invasion of Ukraine, no major power transborder wars have occurred for nearly 80 years. However, the nature of warfare has morphed today into: 1) transnational and local terrorism (deaths from terrorism increased 22% during 2023 the highest since 2017, but 23% lower then the peak in 2015; but caution, definitions and data collection vary widely in terrorism reporting); 2) international intervention, including private armies into internal wars (e.g., Ethiopia, Mali, Syria, and Yemen); and 3) publicly denied cyber and information warfare.

Conditions that can lead to instability exist in half the world. Nearly 110 million people were forcibly displaced by 2023 as a result of persecution, conflict, violence, human rights violations or events seriously disturbing public order. About 52% of all refugees and other people in need of international protection came from just three countries: Syria, Ukraine and Afghanistan. Human migration in one form or another is expected to continue increasing mostly due to the effects of ecological degradation, global warming (World Bank estimates 266 million climate refugees by 2050) and political malpractice leading to violence as refugees move into populated areas.

The world’s nuclear arsenals have fallen from about 70,000 warheads in the mid-1980s to 12,500 among nine countries by early 2023. The majority of these warheads (9,600) are scheduled for disarming. The recent concern is North Korea’s ICBM and nuclear bomb tests which are condemned by the UN Security Council.

World military spending was relatively flat from 1998 to 2011, with minor decreases from 2011 to 2014, but since then, it has increased each year, reaching $2,440 billion in 2023. According to the 2023 Global Peace Index, the average level of country peacefulness deteriorated by 0.42 percent. This is the ninth consecutive year that global peacefulness has deteriorated. However, 84 countries improved in 2023 down from 90 previous year, and 79 deteriorated compared to 71 in 2022. Over the last 14 years, peacefulness fell on average by 3.2% among 163 countries, with 84 deteriorations and 77 improvements (2 countries exhibit no changes in GPI score), highlighting that improvements in peace are gradual. In 2022, terrorist attacks fell to 3,955 compared to 5,463 the previous year, and deaths declined by 9%. The Islamist State (also known as ISIS, ISIL, and Daesh) remains the deadliest terrorist group in terms of the number of attacks and deaths over the last nine years.

Since the Fragile States Index was established in 2007, 99 countries improved while 75 became more fragile. Between 2017 and 2022, 70 countries worsened, while the 2023 index shows that only 54 countries became more fragile in the last year. The same report rates 30 countries between “alert” to “very high alert” for fragility. According to the OECD, 23% of the world’s population lives in fragile contexts, the same percentage reported before the COVID-19 pandemic. However, the pandemic led to an increase in the number of people facing food insecurity, with the FOA reporting that undernourishment stood between 8.9% and 10.5% in 2021, an increase of 150 million people from 2019. This issue is greatest in Africa, where 20.2% of the population faced hunger in 2021 compared to 9.1% in Asia, and 8.6% in Latin America and the Caribbean. Currently, 10 of the 12 countries with the worst ecological threats are in conflict.

Meanwhile, information warfare (as different from cyber warfare that attacks computers, software, and command control systems) manipulates information trusted by targets without their awareness, so that the targets will make decisions against their interest but in the interest of the one conducting information warfare. Fake news via millions of bots, AI deepfake videos, and other forms of information warfare are increasingly manipulating perceptions of truth, intensifying social polarization, defaming institutions, refuting trust in news, while the public does not know how to defend itself.

Cyberattacks from governments and organized crime on other governments, corporations, and individuals are expected to increase. Asymmetrical cyber warfare changes the conventional balance of power analysis. Is there a reasonable way to hold software companies accountable for hacking of their products as other businesses are responsible for failures in their products? And what scale and impact of a cyber-attack or information warfare would trigger Article 5 of NATO, and what would be a proportional response? This subject was discussed in the Brussels Summit Communiqué of 2021, which could potentially invoke Article 5. Lawfare is an evolving concept of weaponizing legal systems. Since the targets of cyber attacks and information warfare are also individuals and corporations as well as governments, the success of national strategies to counter this new theater of conflict depends also on the behavior of civilians; hence, more comprehensive strategies are needed to include civilians.

If the world continues to play zero-sum power geopolitics, it seems inevitable that wars in one form or another will continue for our future. Alternatively, synergetic relations among nations could be explored. Other conflict prevention strategies include ensuring equitable access to government services, establishing transparent and accountable governance structures, conducting inclusive meetings to address grievances, setting joint goals, reducing corruption, improving the free flow of information, using trade embargoes and other economic sanctions, initiating low-profile mediation, improving minority rights, controlling hate speech, providing economic aid, conducting inter-religious dialogues, and using the International Criminal Court and the World Court. Some conflict resolution strategies include national dialogues, international negotiations, integrating civil society actors and more women into negotiations, military intervention, demilitarized zones, UN Peacekeeping, economic incentives, and religious leaders’ initiatives. Re-war prevention strategies include reintegration of ex-combatants and displaced populations; UN Peacekeeping (especially including women in the team); truth and reconciliation commissions; rebuilding of institutions; promotion of the safe return of refugees, internally displaced persons, and migrants; and economic development with all parties, including access to finance.

actions

Identify and implement synergic relations among nations and teach synergetic intelligence, synergetic advantage, and synergetic strategy in schools of international relations and business schools.
Utilize the Water, Peace, and Security Partnership’s water early warning system to predict and prevent water-related conflicts.
Create a UN Convention on Artificial Intelligence and UN AGI Agency to manage the AI arms race for the development of artificial general intelligence.
Mandate equal access of all groups to government services.
Create and use online interactive simulation models for creating a peaceful future.
Review conflict resolution and prevention strategies, as to when and why they work or fail, and teach these conclusions and integrate them into various forms of media, entertainment, and education curricula.
Add cyberwarfare as a fifth treaty to the Geneva Conventions (four treaties, and three additional protocols, that establish international legal standards for humanitarian treatment in war).
Create a UN Convention on Information Warfare.
Use predictive analytics on disinformation databases to continually forecast potential info-warfare acts and preempt the actions to get ahead of information warfare.
Require social media users to imbed their national identification number.
Fine social media that do not close fake accounts being used to spread disinformation and/or seed unrest.
Readjust school curricula to emphasize compassionate behavior, tolerance for diversity, methods for conflict prevention and resolution, non-violent communication, and methods for of compromise and consensus building.
Expand national and international security to include transnational threats such as climate change, future forms of advanced AI, and pandemics.
Use participatory processes to produce back-casted peace scenarios to show plausible alternatives to conflict stories (e.g., Middle East Peace Scenarios).
Increase attention to ways to stop patronage and corruption.
Integrate women into conflict reduction activities and peacekeeping forces.
Implement educational initiatives targeting families and communities to identify potential terrorists and deter them from engaging in future acts of terror.
Establish a public online collective intelligence platform to develop diplomatic, foreign policy, military, and legal frameworks in order to address emerging asymmetrical threats.
Establish NGO networks to monitor indicators of conflict that are able to initiate strategies for rapid deployment of non-military resources.
Increase use of non-lethal weapons.
Educate people about their roles in cyber security, via school curricula, software company pubic campaigns, and government information programs.
Encourage the use of online tools, such as the Global Disinformation Index, that notify users of disinformation and/or make them aware of misleading sites.
Create cyber traps and counter-jamming systems to catch and deter attackers.
Connect government and UN agencies with NGOs and the media to help generate the political will to prevent or reduce conflicts.
Establish tracking systems to identify the sources and destinations of weapons.
Internet platforms should create automatic prompts when a user is about to forward information that is known disinformation.
Negotiate a UN treaty on autonomous AI weapons.
Control the equipment needed to manufacture bioweapons.
Use AI systems to augment human judgment in reducing tensions in conflict situations. Incorporate local, bottom-up narratives of peace and conflict into conflict analysis and response to develop more inclusive and effective peacebuilding strategies.
Keep world attention on Sustainable Development Goal 16: peace, justice, and inclusiveness.

regional

Sub-Saharan Africa: Sub-Saharan African military expenditures increased by 8.9% in 2023, sharply contrasting with the 7.3% drop in 2022, the 4.1% increase in 2021, and the 3.4% increase in 2020. The bulk of this increase was driven by Nigeria, which raised its spending by 20%, along with notable increases in the Democratic Republic of the Congo and South Sudan. Additionally, the Central Sahel region of sub-Saharan Africa accounts for almost half of all deaths from terrorism worldwide, and Burkina Faso tops the Global Terrorism Index. Since its establishment by the African Union in 2003, the African Standby Force has been deployed a number of times to deal with outbreaks of violence on the continent and generally maintain peace within Member States. In 2019, the economic impact of violence in sub-Saharan Africa totaled $453.1 billion. South Sudan has achieved independence, but disputes with the North and internal conflicts are continuing. It is estimated that there were 31.4 million IDPs in sub-Saharan Africa as of 2022, of which some 27.9 million were displaced by conflict and violence. The Democratic Republic of the Congo has the highest number of IDPs at nearly 6 million, an increase of 500,000 from 2021. The countries with the largest number of IDPs – South Sudan, Ethiopia, Somalia, Congo Democratic Republic, and Sudan – are also rated among the world’s “high” and “very high” alert countries. In 2021, Boko Haram joined the Islamic State and rebranded itself as the Islamic State in the West African Province, controlling parts of Nigeria and Niger. French forces withdrew from the Sahel region as Operation Barkhane came to an end, and Somalia remains a failing patchwork of regions run locally or from Kenya or Ethiopia. The unrest between Christians and Muslims in Nigeria has intensified and threatens to ignite wider sectarian conflict in the region. General unrest is endemic in much of West Africa and is compounded by poor and corrupt governance. Youth unemployment, a literacy rate of 77% among 15-24 year-olds, and about 14.9 million AIDS orphans may fuel a new generation of violence and crime.

North Africa and the Middle East: The October 2023 Hamas terrorist attack on Israel killed 1,139 people (764 civilians and 373 Israeli security personnel), and 252 persons were taken hostage. In response, over 40,000 Palestinians have been killed in Gaza. Internal conflicts characterize much of the region (Ethiopia, Iraq, Lebanon, Libya, Palestine (and occupied lands), Somalia, Sudan (N&S), Syria, and Yemen). Although the Treaty on the Prohibition of nuclear weapons entered into force on 22 January 2021, Egypt and Saudi Arabia are not Parties to it, and Algeria and Libya have yet to ratify their signatures. President Trump’s unilateral withdrawal from the Iranian nuclear agreement has hastened the day for nuclear confrontation in some form. Shifting political alignments of Saudi Arabia and Turkey have also increased political uncertainties in the region, along with new initiatives from China including an agreement between Iran and Saudi Arabia.

About 52,000 Palestinian homes were demolished in the Naqba and another 56,500 in the Occupied Territory since 1967, and another 449 houses or other structures were destroyed in the Occupied Territories between January and May of 2023, while the Israeli government approved a record number (12,855) of new housing units during the same time in the occupied West Bank. The Arab Spring/Awakening, overturning a number of long-lived authoritarian regimes, is yet to implement long-lasting democratic governance.

The Middle East accounted for 31% of global arms imports between 2018-2022, second only to the Asia and Oceania region. Saudi Arabia was the world’s second largest arms importer after India. Some Middle Eastern countries, including Egypt, Saudi Arabia, and the UAE, are buying their weapons from different suppliers diversifying their sources to include other countries and lessen dependency on U.S. weapons. North African military spending increased by 38% in 2023, with the bulk of that coming from Algeria’s 76% increase, enabled by rapid increase is gas sales to Europe moving away from Russia suppliers.
Post-Bin Laden Al-Qaeda has changed from a centralized organization to a franchise operation. Lone wolf extremists supplement such Al-Qaeda activity throughout the world.

The region’s refugee situation continues to be the worst in the word with Lebanon having the most refugees per capita in the world and Syria with the most refugee outflows and internally displaced people in the world. The industrialization of countries bordering the Nile will require water sharing agreements with Egypt to prevent future conflicts.

Asia and Oceania: Total military spending was $595 billion in 2023, up 4.4% from 2022. East Asian military expenditure rose by 6.2% to $411 billion in 2023, of which China was 74%, South Korea and Japan were each about 12%. Japan projects to increase its average annual spending to $62 billion from 2024-2027, which will be a 23.5% increase over 2023 in response to Chinese military buildup. China’s Belt and Road Initiative (BRI) extended China’s international relations via loans to countries for infrastructure projects. Sri Lanka was unable to service the load to build the Hambantota Port, giving China control of the new port via a 99-year lease. Between 2008 and 2021, it cost China $240 billion to bail out 22 developing countries unable to pay back loans. Long-term global perspectives and international intervention may be necessary to solve energy resource conflicts in the South China Sea, where China, Vietnam, Indonesia, Malaysia, Brunei, and the Philippines are contending over islets and economic zones.

China’s internal problems over water, energy, food, demographics, urbanization, income gaps, and development projects displacing villagers will have to be well-managed to prevent future conflicts. China is moving into Central Asia, becoming the major economic partner in four of the five republics. China has the largest navy and military budget in Asia, and is increasing sales of military systems to Africa and Latin America. North Korea may have as many as 60 nuclear warheads. An internationally acceptable solution to North Korea’s nuclear program is still lacking. Pakistan’s internal instability, and the complex strategic relationships among Pakistan, China, India, and Afghanistan, hinder the peacemaking and counter-extremist efforts. The U.S. withdrew from Afghanistan returning the Taliban to national control. Contention for control of the country’s rich minerals and agricultural resources can be expected. China has already begun exploring lithium agreements. The South Asia Foresight Network is identifying potential synergetic relations among eight countries.

Europe: Russia’s invasion of the Ukraine has returned nuclear brinkmanship after thirty years. Refugees have fled both the Ukraine and Russia to NATO countries adding to the already large numbers of migrant laborers, refugees, and asylum seekers entering the EU from North Africa and Syria. This will require new approaches to better integrate them into society to prevent increased social unrest. Germany opened its boarders back in 2015 and now has 2 million migrants, half of whom are employed and paying taxes. The New Pact on Migration and Asylum, an EU anti-smuggling action plan, aims to mitigate illegal migration by sea, although it has drawn critiques from international human rights groups. Meanwhile, the Basque ETA rebels have forsworn violence since 2018. There were 16 terrorist attacks in the EU during 2022 and 12 attacks were countered. The situation of the Roma population (an estimated 12 million throughout Europe) continues to be a challenge across the continent. Continued youth unemployment and fiscal austerity in parts of the Eurozone have resulted in violent social protests. Stronger and more stable institutions and further political integration are needed to keep the EU together. Meanwhile Russia denies using information warfare to increase ethnic tensions, and mistrust of institutions, elections, and social norms.

Latin America: Costa Rica is a beacon of peace in the region, ranking far higher than its neighbors in the 2023 Global Peace Index. This index shows a deterioration in peace in Central America and the Caribbean, although the average level of peace in South America rose by 0.2%. High rates of homicide continued in Latin America in 2022, with Venezuela topping the list at 40.4 deaths per 100,000. An estimated 120,000 have been killed up to 2023 in the drug wars in Mexico.

Although national wars are rare in the region, internal violence from organized crime, paramilitaries, and amalgams of the two continues to be fueled in some areas by corrupt government officials, military, police, and national and international corporations. Conflict and violence displaced 5.9 million people in the region in 2022, a decrease of 300,000 compared to the year prior. In 2022, Columbia had the highest number of IDPs in the region (approximately 4.8 million) followed by Mexico, Honduras, and Guatemala, the latter three accounting for some 875,000 people.

To eliminate criminal gangs, Latin America should address inequality and develop educational systems that meet the requirements of the knowledge economy. Recent political changes have begun to improve opportunities for indigenous peoples in some parts of the region, while political polarization over policies to address poverty and development persist. Since its first dataset in 2005, the Fragile States Index has consistently ranked Haiti as the most fragile country in the region.

The Declaration of Buenos Aires in 2023 is intended to help tackle a number of regional issues including global warming, democratization, and multilateralism. The International Court in the Hague has become the most widely used mechanism by Latin American countries to peacefully resolve conflicts; e.g., Nicaragua and Colombia; Peru and Chile; Bolivia and Chile. Brazil recently joined the Hague System as well, with the act entering into force on August 1st, 2023. Violence is impeding development in Central America, a region with one of the highest crime and homicide rates in the world.

North America: Although the U.S. has withdrawn from Afghanistan, it has 750 military bases in 80 foreign countries and regions. Home-grown terrorism and political violence add a new dimension to U.S. security challenges, highlighted by the January 6th attempt to stop the peaceful transfer of power by right-wing extremists in 2021. The Department of Homeland Security launched the Prevention Resource Finder website in March 2023 to help communities understand, mitigate, and protect themselves from targeted violence and terrorism. Physical attacks on the U.S. power grid are increasingly conducted by right-wing extremists and cyber-attaches by foreign governments. There were 1,665 security incidents involving the U.S. and Canadian power grids occurred in 2023. Heath care, transportation, water systems, gas pipelines, power grids, and government offices are under increasing cyber-attacks by foreign governments and criminals. The evolving Internet of Things vastly increases the number of valuable points for cyber-attacks. Russian information warfare continues to tear the cultural fabric of the U.S. With far more advanced AI, deep fakes, and personal information data banks, information warfare is expected to be far more effective than in the 2016 election.

U.S. spending on national defense has reduced from 4.7% of GDP in 2010 to 2.8% in 2023, but remains the world’s highest defense budget, surpassing the next ten countries combined. From 2018 to 2021, Canada’s military expenditure increased from $22.7 billion to $26.5 billion and is projected to expand as the country’s role in the international arena grows. The U.S. signed the Arms Trade Treaty in 2013 but does not intend to ratify its signature, while Canada did not sign but became a party to the treaty in 2019.

As Arctic ice continues to melt, vast quantities of natural gas and oil will be accessible where national boundaries are disputed. This could be a future source of U.S.-Canada tension, potentially including Russia, Norway, and Denmark as well. U.S.-China relations remain tense but cooperation on countering climate change, improving environmental security, establishing AI governance could become a focus to build strategic trust.
</problem_description>

Based on this description, you will guide the user through each step of the problem-solving process. For each step, provide specific advice tailored to their problem and incorporate relevant personal assistant actions when appropriate. Wrap each step of your response in the following tags:

<step_1>
<step_analysis>
- List 3-5 key considerations for having a positive approach to this specific problem, prioritized by importance
- Note any assumptions you're making about the problem or situation, ranked by potential impact
- Reflect on how to frame a positive approach specifically for this situation, providing 2-3 concrete examples
- Consider if any personal assistant actions (e.g., scheduling, notifications) could support a positive approach, explicitly connecting each action to an aspect of the problem
- Write down a specific scenario or example from the problem description that relates to this step
</step_analysis>
[Provide advice for having a positive approach, tailored to the specific problem. Include any relevant personal assistant actions.]
</step_1>

<step_2>
<step_analysis>
- List 3-5 key elements that should be included in the problem definition, prioritized by relevance
- Note any assumptions you're making about the problem's scope or context, ranked by certainty
- Analyze what additional information might be needed to fully understand the problem, providing 2-3 specific examples
- Consider if any questions need to be asked to clarify the problem, listing them in order of importance
- Write down a specific scenario or example from the problem description that relates to this step
</step_analysis>
[Help the user define the problem clearly, asking relevant questions if necessary. Set any tasks that might help in gathering more information.]
</step_2>

<step_3>
<step_analysis>
- List 3-5 creative thinking techniques that would be most effective for this particular problem, ranked by potential impact
- Note any assumptions you're making about the user's creative capabilities or resources, prioritized by relevance
- Consider how these techniques can be tailored to address the specific aspects of the problem, providing an example for each
- Identify any offline activities or services that might boost creativity, explicitly connecting each to an aspect of the problem
- Write down a specific scenario or example from the problem description that relates to this step
</step_analysis>
[Encourage creative thinking, suggesting specific techniques or prompts related to the problem. Recommend any relevant offline activities or services.]
</step_3>

<step_4>
<step_analysis>
- List 2-3 potential positive outcomes and 2-3 potential negative outcomes most relevant to this problem, ranked by likelihood
- Note any assumptions you're making about the likelihood of these outcomes, prioritized by potential impact
- Analyze how these outcomes relate to the specific context of the problem, providing an example for each
- Consider how tracking certain metrics might help prepare for these outcomes, explicitly connecting each metric to an outcome
- Write down a specific scenario or example from the problem description that relates to this step
</step_analysis>
[Guide the user in preparing for potential outcomes, both positive and negative. Suggest any relevant metrics to track and how to do so.]
</step_4>

<step_5>
<step_analysis>
- List 5-7 potential solutions that address the specific challenges and opportunities identified, ranked by potential effectiveness
- Note any assumptions you're making about the feasibility of these solutions, prioritized by importance
- Consider how each solution relates to the problem definition and potential outcomes, providing a brief explanation for each
- Identify any items that might need to be purchased to implement these solutions, explicitly connecting each item to a solution
- Write down a specific scenario or example from the problem description that relates to this step
</step_analysis>
[Assist in brainstorming solutions, offering suggestions if appropriate. Include any necessary purchases or resources needed for implementation.]
</step_5>

<step_6>
<step_analysis>
- List 3-5 criteria for evaluating the solutions, based on the specific situation, ranked by importance
- Note any assumptions you're making about the user's priorities or constraints, prioritized by potential impact
- Consider how each solution measures up against these criteria, providing a brief score or explanation for each
- Determine if expert advice might be needed for evaluation, specifying which aspects of the evaluation require expertise
- Write down a specific scenario or example from the problem description that relates to this step
</step_analysis>
[Help the user decide on the best solution, providing a framework for evaluation. If necessary, suggest scheduling a video call with a relevant specialist.]
</step_6>

<step_7>
<step_analysis>
- List 3-5 key milestones for implementing the chosen solution, ordered chronologically
- Note any assumptions you're making about the timeline or resources available, ranked by potential impact
- Consider realistic timeframes for each milestone, given the specific problem and solution, providing a brief justification for each
- Identify any tasks that need to be repeated and their frequency, explicitly connecting each to a milestone
- Write down a specific scenario or example from the problem description that relates to this step
</step_analysis>
[Suggest how to set a realistic deadline and break it down into milestones. Set tasks for each milestone, including any that need to be repeated.]
</step_7>

<step_8>
<step_analysis>
- List 3-5 specific areas where the user needs to take responsibility to ensure success, prioritized by importance
- Note any assumptions you're making about the user's capabilities or support system, ranked by certainty
- Consider how these responsibilities relate to the chosen solution and timeline, providing an example for each
- Identify any reminders or notifications that could help the user stay accountable, explicitly connecting each to a responsibility
- Write down a specific scenario or example from the problem description that relates to this step
</step_analysis>
[Emphasize the importance of taking responsibility, relating it to the specific problem. Set up any necessary reminders or notifications.]
</step_8>

<step_9>
<step_analysis>
- List 3-5 potential challenges in implementing the solution, ranked by likelihood
- Note any assumptions you're making about the implementation process, prioritized by potential impact
- Consider strategies to overcome each of these challenges, providing a brief explanation for each
- Identify any support services or resources that might help with implementation, explicitly connecting each to a challenge
- Write down a specific scenario or example from the problem description that relates to this step
</step_analysis>
[Provide guidance on implementing the solution, including any potential challenges to watch out for. Suggest relevant support services or resources.]
</step_9>

<step_10>
<step_analysis>
- List 3-5 appropriate metrics for tracking progress and assessing effectiveness, ranked by relevance
- Note any assumptions you're making about what constitutes success for this problem, prioritized by importance
- Consider methods for measuring each metric, given the specific problem and solution, providing a brief explanation for each
- Determine how often these metrics should be tracked and reviewed, explicitly connecting each frequency to a metric
- Write down a specific scenario or example from the problem description that relates to this step
</step_analysis>
[Advise on how to track results and assess the effectiveness of the solution. Set up a system for regular metric tracking and review.]
</step_10>

After completing all steps, provide a brief summary of the problem-solving process and offer encouragement to the user. Place this summary within <summary> tags.

Throughout the process, be prepared to:
- Ask clarifying questions when needed
- Set specific, time-bound tasks
- Suggest purchases of necessary items
- Recommend relevant offline activities or services
- Send email or SMS notifications (by indicating when and what should be sent)
- Set up tracking for health or other relevant metrics
- Schedule video calls with specialists when expert advice is needed
- Specify repeated actions with clear frequency and duration

Remember to be supportive, positive, and tailored in your advice throughout the process. If you need any clarification about the problem, ask the user before proceeding with your advice.

Example output structure:

<step_1>
<step_analysis>
[Your analysis for step 1, including key considerations, assumptions, reflections, potential personal assistant actions, and a specific example from the problem description]
</step_analysis>
[Your tailored advice for step 1, including any relevant personal assistant actions]
</step_1>

[... repeat for steps 2-10 ...]

<summary>
[Your brief summary of the problem-solving process, including key actions taken and encouragement for the user]
</summary>

Please proceed with your analysis and guidance based on the provided problem description and format response in JSON.

