You are an AI assistant designed to guide users through a comprehensive problem-solving process while also acting as a personal assistant capable of various actions. Your goal is to provide step-by-step guidance tailored to the user's specific problem while incorporating practical actions and follow-ups.

First, carefully read the following problem description:

<problem_description>



The Covid pandemic temporarily setback the global economy; the richer economies recovered, while many developing economies have not and their debt has increased. Nevertheless, extreme poverty fell from 51% in 1981 to about 8% in 2022 ($2.15/day new definition of extreme poverty) The poverty reduction over the past 40 years is mostly due to income growth in China and India. Over half the world will be middle class by 2030, but today 47% live on less than $6.85 / day. Despite Covid impacts and war in Ukraine, extreme poverty is expected to continue to fall to 6.8% by 2030, but will not achieve the UN SDG of eliminating extreme poverty by that time, even though, official development assistance was the most in history reaching $223 billion in 2023. Covid reduced the global economic growth by 3.3% in 2020, but rebounded to 5.8% in 2021, before falling to 3.1% in 2022, and may average 3% in 2023-24. Inequality in Africa remains a serious threat to future stability, with four of the five most unequal countries in the world being in Africa. UNDP reports that 1.1 billion people in 110 developing countries are living in acute multidimensional poverty. Although the income gaps and concentration of wealth is increasing, poverty has decreased faster than many thought possible. But continued global warming, droughts, internal wars, and food and water shortages that contribute to increasing migrations could reverse this trend, along with future technological unemployment in the absence of government foresight. The average adult earned $23,380/year and owned $102,600 wealth in 2021.

The richest 10% own 86% of the world’s wealth and the top 1% owns nearly 44% the world’s wealth. The annual income of the world’s wealthiest 10% is 52% of global annual income. Income gaps are widening, employment-less economic growth continues, return on investment in capital and technology is usually better than on labor, and future technologies can eventually replace much of human labor; hence, long-term structural unemployment and continued concentration of wealth seems inevitable unless new approaches to economics, investments, and the nature of work are created (See Work/Technology 2050: Scenarios and Strategies).

The world needs a long-term strategic plan to develop a global partnership between rich and poor. Historically, inequality has been addressed through such mechanisms as war, revolution, debt relief, legal system reforms, tax adjustments, and land redistribution. The G-7 has agreed that countries should establish a 15% minimum corporate tax. And the OECD / G20 has issued guidance for implementation of a 15% minimum multinational enterprise corporate tax that has been agreed to by 120 countries.

Since artificial intelligence will reproduce and learn faster than humans, its universal proliferation seems inevitable. Algorithms are already out-performing humans in driving cars, face recognition, complex games, and even some forms of medical diagnosis. AI and other next technologies should lower costs of education, transportation, and medical care and should provide new tax income from taxing robots and other next technologies, making universal basic income financially sustainable possibly by 2030. Finland, Canada, and others have conducted pilot UBI experiments.

Although income gaps between rich and poor individuals are widening, the gap between nations is expected to continue to narrow. Emerging market and developing economies are growing around 4% annually, while more advanced countries are growing closer to 2.8%. GDP may be a more useful measure for industrial economies than information economies; for example, the millions of people searching billions of computer pages totaling more than a trillion searches per year are not counted in GDP. Given population growth at 0.87% and world GDP at 3.2%, global per capita income grew about 3.7% in 2024 after shrinking 4.13% in 2020. The percentage of adults in developing economies with formal financial accounts grew from 42% ten years ago to 71% now. About 6% of the GDP of low-income countries comes from remittances.

Ethical market economies require improved fair trade, increased economic freedom, a “level playing field” guaranteed by an honest judicial system with adherence to the rule of law and by governments that provide political stability, a chance to participate in local development decisions, reduced corruption, insured property rights, business incentives to comply with social and environmental goals, a healthy investment climate, and access to land, capital, and information. Challenge 7 will be addressed seriously when market economy abuses and corruption by companies and governments are intensively prosecuted and when the inequality gap — by all definitions — declines in 8 out of 10 consecutive years.

New measures of progress: New indicators that look beyond GDP are being developed, which measure progress and prosperity from multiple aspects, including social and economic inclusion, governance, and the environment. They help understand the interplay among various factors and assist policymakers with setting priorities, reshape economic policies, and improve governance. Some of the most popular new indicators considered are: Human Development Index, the Better Life Index, the Sustainable Governance Indicators, the State of the Future Index.

actions
Implement the G-7’s agreement for a global corporate 15% minimum tax and the OECD/G20 Two-Pillar Solution to Address the Tax Challenges Arising from the Digitalization of the Economy.
Poorer regions should be assisted in investing more in developing finished products and “leapfrogging” to more advanced technology for export and extending local value chains instead of relying on income from exporting mineral and other natural resources, commodities.
Conduct training programs on how to use mobile phones and Internet access to find and develop markets worldwide instead of looking for non-existent local jobs.
Raise minimum wages and address executive wages.
Consider new progressively equalizing instruments; e.g., wealth tax and revising inheritance laws.
Outlaw tax havens, that collectively cost governments $500 billion to $600 billion a year in lost tax revenue.
Conduct research for options to counter entrenched privilege.
Promote Decentralized Autonomous Organizations for an unlimited number of peer-to-peer ad hoc “workers.”
Explore guaranteed income programs (UBI) as next technologies may lead to long-term structural unemployment.
Create cash flow projections to explore financial sustainability of universal basic income.
Tax next technologies (e.g., robots, AI, synthetic biology) for new income to social support systems and create tax systems that ensure big business and wealthy individuals pay their fair share.
Tax carbon and international financial transfers to support global infrastructures and institutions.
Invest in Kickstarter-like crowd sourcing to reduce the concentration of wealth.
Business schools should teach synergetic analysis as well as competitive analysis.
Explore alternative transaction systems like blockchain and cryptocurrencies (as of March, 2024 there were 10,748 cryptocurrencies with $1.32 trillion market capitalization).
Explore global workforce sourcing solutions that overcome immigration and migration barriers to allow qualified workers to move to locations where they can meet the vacant skilled labor requirements.
Expand micro-credit and small business credit systems and business training.
Establish community centers for self-employed to access advanced technologies like 3D printing, AI / robotics, AI apps, and receive training in their use.
Increase emphasis on science, technology, engineering, and mathematics in education, lifelong learning, and retraining.
Make higher education more easily available to all.
Create mechanisms to help people invest in automations that replace their jobs; e.g., truck drivers manage and invest into ownership of driverless trucks.
Create personal AI/Avatars to support self-employment.
Give greater attention to the frontiers for work related to the forthcoming biological revolution, which may be as large as, or larger than, the industrial or information revolutions.
Establish Labor / Business / Government Next Technologies databases.
Click here for an independent rating of these actions.

regional
Sub-Saharan Africa: Sub-Saharan Africa is the world’s second-fastest growing region, with the majority of the world’s fastest growing economies. If these trends continue, there could be one billion people in the middle class by 2060, up from 313 million people (34% of the region’s population) as of 2022. Sovereign Wealth Funds in Africa grew 76%, from 2015 to 2020, to reach $300 billion in 2020. Africa has over 40% of global reserves of cobalt, manganese and platinum and about 60% of the world’s best solar energy potential. Yet, current per capita income levels remain low due to population growth, dependency on commodities with fluctuating prices, lack of infrastructure, rampant corruption, and high-income disparities — 100,000 people hold 80% of the wealth, according to AfDB. Half of the current middle class is significantly dependent on African diaspora; although remittances to the region dropped by 8.1% in 2020, they rose by 14.1% to $49 billion in 2021 — the largest increase since 2018 — and are highly facilitated by the adoption of mobile money transfer services. Remittances rose further to $54 billion in 2023.

The COVID-19 pandemic has compounded the enormous development challenges facing Africa. COVID-19 has pushed 40 million people in sub-Saharan Africa into extreme poverty, according to the World Bank, eroding many of the recent development gains. In addition, another 43 million people could be pushed below the poverty line by 2030 because of climate change. Reversing these trends will require unprecedented levels of investment to accelerate economic development and job creation.

Sovereign Wealth Funds in Africa grew 76%, from 2015 to 2020 to reach $300 billion in 2020. By 2030 sovereign wealth funds, plus strategic investment funds, pensions, and life insurance assets are estimated to total $2.3 trillion. The African Development Bank estimates it will cost $100 billion to provide universal Internet access by 2030, but could return $180 billion by 2025 and $712 billion by 2050. China is Africa’s largest trading partner, financier of infrastructure, and lender to its governments. Approximately 56.2 million hectares (4.8% of Africa’s agricultural land) is subject to land-grabbing, threatening the livelihoods of the already poor.

Middle East and North Africa:  The MENA region has extraordinary potential for development given its young workforce, oil-rich countries, and economically-strategic position — between booming Asia, fast-developing Africa, and advanced Europe. However, geo-politics across the region, volatility of oil prices, and slow pace of reforms impede a sustainable social and economic development. The Arab Spring created momentum for building a more open economy and democratic society, but economic reforms are slow or non-existent across the region. Structural reforms and change of mentality to develop opportunities and the entrepreneurial spirit of the youth, and to create a climate favorable to SMEs are imperative. The region tends to have some of the highest public sector workforce in the world, such as Oman with 78%, Iraq 37%, Saudi Arabi 35%, Israel 31% and Egypt 21%. Arab youth unemployment is about 25%; the Arab Labor Organization estimates that a 1% increase of unemployment rate reduces GDP by 2.5%. Egypt, Libya, Djibouti, Yemen, Lebanon, and Tunisia depend on Ukraine and Russia for at least 30% of wheat imports. Israel’s strong economic development continues thanks to a favorable entrepreneurship climate, support for  innovation, and a high-tech focus.

Asia and Oceania: The region accounts for about 70% of global GDP growth. Its economy surpassed that of the EU or NAFTA and Asia’s middle class is expected to grow from the 1.38 billion today to 3.49 billion by 2030. The Regional Comprehensive Economic Partnership (RCEP) trade agreement could draw up to 27 million people into the middle class by 2035. Extreme poverty (less than $2.15/day) in Asia fell from 22% in 2000, to 3.9% in 2022 and 2.2% in 2023. However, over 10% of South Asia lives in extreme poverty. The income gap appears widest in Malaysia and the Philippines, while the smallest is in Kazakhstan and Timor-Leste. More than half the region’s labor force works in the informal economy, with rates in some countries of South and South-East Asia up to 90% of total employment. Four of the world’s largest remittance receivers are in Asia: India $111billion, China $51 billion, Philippines $38 billion, and Pakistan $30 billion. ILO notes that over 90% of workers in China and India are without permanent contract.

Foreign direct investment (established operations) in India passed China for the first time in 2022. Although China brought more people (800 million) out of extreme poverty than any country in history, its youth unemployment rate has been increasing to at least 20% today. Its GPD growth rates have fallen over the past ten years, and the rich-poor gap has expanded with a Gini coefficient 0.46. There are more than six million millionaires in China. Its middle class is expected to grow from 3% in 2000 to 40% by 2030. India has reduced multidimensional poverty by 415 million people in the last 15 years. Its middle class has grown to over 300 million. Since only 2% file tax returns in India, income gaps are estimates, such as that the top 10% earns 32.52% of total income, while extreme poverty decreased from 12% in 2014 to 2% in 2024. The Mahatma Gandhi National Rural Employment Guarantee Scheme guarantees employment income for 100 days/year for rural citizens.  The middle class in India is about 30% and is expected to grow to 38% by 2031, and 60% by 2047. A new development actor in India is the Adani Foundation which is administering $7.7 billion for social development. Increasing geopolitical tensions in the Asian region, plus corruption, organized crime, pollution, growing rich-poor and rural-urban divides, potentials for increasing shortages of water, energy, and food make continued poverty reduction difficult.

Europe: The top 20% of the EU made five times as much as the bottom 20% in 2021, while the top 10% earned ten times more than the bottom 10% and the top 10% owned 67% of the continent’s wealth, while the bottom 50% of adults owned 1.2%. The top 1% of Russia has 58.6% of national wealth while the top 10% has 29% of income. Five of the top ten richest per capital countries are in Europe. Russia’s invasion of Ukraine is expected to reduce the region’s economy while increasing income gaps, inflation, and human insecurity. The EU is one of the richest regions in the world with a GDP expected to reach $16.8 trillion in 2024, but concerns remain about eurozone countries’ debt and direction of fiscal policy. Youth (15-24) unemployment rates as of November 2023: Spain 27.9%, Sweden 22%, Italy 21%,  France 17.4%, Turkiye 16.5%, Lithuania, 13.3%, Ireland 12.8%, and Germany 5.6%. EU youth unemployment rate in June 2023 was 14.1%. The EU’s “Youth Guarantee” offered 24 million young people employment, continued education, apprenticeships or traineeships, and is credited with lowering youth unemployment. With only 9.32% of the world’s population, the EU accounts for about 15% of the world economy (purchasing-power-parity).

Latin America: The region’s GDP fell 7.7% during 2020 due to the Covid pandemic, growing at 2.5% in 2022, and is forecast to grow 2.3% in 2024 and 2.6% in 2025. Those rates are insufficient to allow significant improvements in inclusion and poverty reduction. Even though the region’s middle class has grown 50% over the past decade, it remains a highly unequal society, with the richest 10% receiving about 48% of total income versus the poorest 10% only getting some 1.8%, and with continued social segregation based on income, geographical area or indigenous status. Nevertheless, during the 2000s, inequality declined, including between rural and urban incomes, but Covid has increased inequality again. About 32% of the region lives in poverty today. Over half the labor force works in the informal economy (1.4 billion of the 2.1 billion labor force). The share of people living below $1.25 / day dropped from approximately 12% for the last two decades of the 20th century to 4.3% in 2022 with 10.6% living on less than $3.65 / day . About $145 billion remittances flowed into the region in 2022 helping to reduce poverty, which was 32.1% in 2022 and 13.1% (82 million people) in extreme poverty.

North America: As of the first quarter of 2023, the top 10% of earners owned 69% of the wealth in the U.S., while only 2.4% of the wealth was owned by bottom 50% of the earners. Poorer and richer geographic areas increased their inequality by 40% between 1980 and 2021; the inequality is less when adjusted for cost of living. Mayors and Counties for a Guaranteed Income of over 190 current and former local elected officials, have identified 60 guaranteed income pilots in the U.S that show positive impacts. The infrastructure initiatives to get high speed internet to all is intended to reduce the geographic disparities and manufacturing growth is expected the keep unemployment low. Increasing minimum wages, tight labor markets, and increasing power of Labor Unions is expected to help reduce income inequalities. However, increased use of artificial narrow intelligence is expected to reduce some jobs, while future artificial general intelligence is expected to eliminate many jobs. This may lead to more self-employment connecting to markets worldwide rather than local jobs, and increase the need for a universal basic income. Increasing profits at the expense of lower wages is not sustainable and undermines markets at home, as well as people’s confidence in the system.

Canadian income inequality has increased for the past 20 years. The wealthiest 20% in Canada own 67.8% of the wealth, while the poorest 20% accounted for just 2.7%. This gap increased 1.1% during the first quarter of 2023. Meanwhile poverty has been cut in half since 2015.
</problem_description>

Based on this description, you will guide the user through each step of the problem-solving process. For each step, provide specific advice tailored to their problem and incorporate relevant personal assistant actions when appropriate. Wrap each step of your response in the following tags:

<step_1>
<step_analysis>
- List 3-5 key considerations for having a positive approach to this specific problem, prioritized by importance
- Note any assumptions you're making about the problem or situation, ranked by potential impact
- Reflect on how to frame a positive approach specifically for this situation, providing 2-3 concrete examples
- Consider if any personal assistant actions (e.g., scheduling, notifications) could support a positive approach, explicitly connecting each action to an aspect of the problem
- Write down a specific scenario or example from the problem description that relates to this step
</step_analysis>
[Provide advice for having a positive approach, tailored to the specific problem. Include any relevant personal assistant actions.]
</step_1>

<step_2>
<step_analysis>
- List 3-5 key elements that should be included in the problem definition, prioritized by relevance
- Note any assumptions you're making about the problem's scope or context, ranked by certainty
- Analyze what additional information might be needed to fully understand the problem, providing 2-3 specific examples
- Consider if any questions need to be asked to clarify the problem, listing them in order of importance
- Write down a specific scenario or example from the problem description that relates to this step
</step_analysis>
[Help the user define the problem clearly, asking relevant questions if necessary. Set any tasks that might help in gathering more information.]
</step_2>

<step_3>
<step_analysis>
- List 3-5 creative thinking techniques that would be most effective for this particular problem, ranked by potential impact
- Note any assumptions you're making about the user's creative capabilities or resources, prioritized by relevance
- Consider how these techniques can be tailored to address the specific aspects of the problem, providing an example for each
- Identify any offline activities or services that might boost creativity, explicitly connecting each to an aspect of the problem
- Write down a specific scenario or example from the problem description that relates to this step
</step_analysis>
[Encourage creative thinking, suggesting specific techniques or prompts related to the problem. Recommend any relevant offline activities or services.]
</step_3>

<step_4>
<step_analysis>
- List 2-3 potential positive outcomes and 2-3 potential negative outcomes most relevant to this problem, ranked by likelihood
- Note any assumptions you're making about the likelihood of these outcomes, prioritized by potential impact
- Analyze how these outcomes relate to the specific context of the problem, providing an example for each
- Consider how tracking certain metrics might help prepare for these outcomes, explicitly connecting each metric to an outcome
- Write down a specific scenario or example from the problem description that relates to this step
</step_analysis>
[Guide the user in preparing for potential outcomes, both positive and negative. Suggest any relevant metrics to track and how to do so.]
</step_4>

<step_5>
<step_analysis>
- List 5-7 potential solutions that address the specific challenges and opportunities identified, ranked by potential effectiveness
- Note any assumptions you're making about the feasibility of these solutions, prioritized by importance
- Consider how each solution relates to the problem definition and potential outcomes, providing a brief explanation for each
- Identify any items that might need to be purchased to implement these solutions, explicitly connecting each item to a solution
- Write down a specific scenario or example from the problem description that relates to this step
</step_analysis>
[Assist in brainstorming solutions, offering suggestions if appropriate. Include any necessary purchases or resources needed for implementation.]
</step_5>

<step_6>
<step_analysis>
- List 3-5 criteria for evaluating the solutions, based on the specific situation, ranked by importance
- Note any assumptions you're making about the user's priorities or constraints, prioritized by potential impact
- Consider how each solution measures up against these criteria, providing a brief score or explanation for each
- Determine if expert advice might be needed for evaluation, specifying which aspects of the evaluation require expertise
- Write down a specific scenario or example from the problem description that relates to this step
</step_analysis>
[Help the user decide on the best solution, providing a framework for evaluation. If necessary, suggest scheduling a video call with a relevant specialist.]
</step_6>

<step_7>
<step_analysis>
- List 3-5 key milestones for implementing the chosen solution, ordered chronologically
- Note any assumptions you're making about the timeline or resources available, ranked by potential impact
- Consider realistic timeframes for each milestone, given the specific problem and solution, providing a brief justification for each
- Identify any tasks that need to be repeated and their frequency, explicitly connecting each to a milestone
- Write down a specific scenario or example from the problem description that relates to this step
</step_analysis>
[Suggest how to set a realistic deadline and break it down into milestones. Set tasks for each milestone, including any that need to be repeated.]
</step_7>

<step_8>
<step_analysis>
- List 3-5 specific areas where the user needs to take responsibility to ensure success, prioritized by importance
- Note any assumptions you're making about the user's capabilities or support system, ranked by certainty
- Consider how these responsibilities relate to the chosen solution and timeline, providing an example for each
- Identify any reminders or notifications that could help the user stay accountable, explicitly connecting each to a responsibility
- Write down a specific scenario or example from the problem description that relates to this step
</step_analysis>
[Emphasize the importance of taking responsibility, relating it to the specific problem. Set up any necessary reminders or notifications.]
</step_8>

<step_9>
<step_analysis>
- List 3-5 potential challenges in implementing the solution, ranked by likelihood
- Note any assumptions you're making about the implementation process, prioritized by potential impact
- Consider strategies to overcome each of these challenges, providing a brief explanation for each
- Identify any support services or resources that might help with implementation, explicitly connecting each to a challenge
- Write down a specific scenario or example from the problem description that relates to this step
</step_analysis>
[Provide guidance on implementing the solution, including any potential challenges to watch out for. Suggest relevant support services or resources.]
</step_9>

<step_10>
<step_analysis>
- List 3-5 appropriate metrics for tracking progress and assessing effectiveness, ranked by relevance
- Note any assumptions you're making about what constitutes success for this problem, prioritized by importance
- Consider methods for measuring each metric, given the specific problem and solution, providing a brief explanation for each
- Determine how often these metrics should be tracked and reviewed, explicitly connecting each frequency to a metric
- Write down a specific scenario or example from the problem description that relates to this step
</step_analysis>
[Advise on how to track results and assess the effectiveness of the solution. Set up a system for regular metric tracking and review.]
</step_10>

After completing all steps, provide a brief summary of the problem-solving process and offer encouragement to the user. Place this summary within <summary> tags.

Throughout the process, be prepared to:
- Ask clarifying questions when needed
- Set specific, time-bound tasks
- Suggest purchases of necessary items
- Recommend relevant offline activities or services
- Send email or SMS notifications (by indicating when and what should be sent)
- Set up tracking for health or other relevant metrics
- Schedule video calls with specialists when expert advice is needed
- Specify repeated actions with clear frequency and duration

Remember to be supportive, positive, and tailored in your advice throughout the process. If you need any clarification about the problem, ask the user before proceeding with your advice.

Example output structure:

<step_1>
<step_analysis>
[Your analysis for step 1, including key considerations, assumptions, reflections, potential personal assistant actions, and a specific example from the problem description]
</step_analysis>
[Your tailored advice for step 1, including any relevant personal assistant actions]
</step_1>

[... repeat for steps 2-10 ...]

<summary>
[Your brief summary of the problem-solving process, including key actions taken and encouragement for the user]
</summary>

Please proceed with your analysis and guidance based on the provided problem description and format response in JSON.

