[
        {
        "id": 1,
        "title": "No Poverty - End Poverty in All Its Forms Everywhere",
        "text": "Strive to eradicate extreme poverty and ensure everyone has access to essential resources, opportunities, and social protection, with a focus on the most vulnerable populations.",
        "fullDescription": "Eradicating poverty in all its forms remains one of the greatest challenges facing humanity. While the number of people living in extreme poverty dropped by more than half between 1990 and 2015, too many are still struggling for the most basic human needs. As of 2015, about 736 million people still lived on less than US$1.90 a day; many lack food, clean drinking water and sanitation. Rapid growth in countries such as China and India has lifted millions out of poverty, but progress has been uneven. Women are more likely to be poor than men because they have less paid work, education, and own less property. Progress has also been limited in other regions, such as South Asia and sub-Saharan Africa, which account for 80 percent of those living in extreme poverty. New threats brought on by climate change, conflict and food insecurity, mean even more work is needed to bring people out of poverty. The SDGs are a bold commitment to finish what we started, and end poverty in all forms and dimensions by 2030. This involves targeting the most vulnerable, increasing basic resources and services, and supporting communities affected by conflict and climate-related disasters.",
        "statistics": [
          {"value": "736 million", "description": "736 million people still live in extreme poverty."},
          {"value": "10 percent", "description": "10 percent of the world's population live in extreme poverty, down from 36 percent in 1990."},
          {"value": "1.3 billion", "description": "Some 1.3 billion people live in multidimensional poverty."},
          {"value": "50 percent", "description": "Half of all people living in poverty are under 18."},
          {"value": "1 in 10", "description": "One person in every 10 is extremely poor."}
        ],
        "targets": [
          "By 2030, reduce at least by half the proportion of men, women and children of all ages living in poverty in all its dimensions according to national definitions",
          "Implement nationally appropriate social protection systems and measures for all, including floors, and by 2030 achieve substantial coverage of the poor and the vulnerable",
          "By 2030, ensure that all men and women, in particular the poor and the vulnerable, have equal rights to economic resources, as well as access to basic services, ownership and control over land and other forms of property, inheritance, natural resources, appropriate new technology and financial services, including microfinance",
          "By 2030, build the resilience of the poor and those in vulnerable situations and reduce their exposure and vulnerability to climate-related extreme events and other economic, social and environmental shocks and disasters",
          "Ensure significant mobilization of resources from a variety of sources, including through enhanced development cooperation, in order to provide adequate and predictable means for developing countries, in particular least developed countries, to implement programmes and policies to end poverty in all its dimensions",
          "Create sound policy frameworks at the national, regional and international levels, based on pro-poor and gender-sensitive development strategies, to support accelerated investment in poverty eradication actions"
        ],
        "relatedContent": [
          {"type": "story", "title": "Despite conflict, resilience remains", "link": "/stories/despite-conflict-resilience-remains"},
          {"type": "story", "title": "Botas Violeta / Purple Boots", "link": "/stories/botas-violeta-purple-boots"},
          {"type": "story", "title": "Crisis in the DR Congo", "link": "/stories/crisis-in-the-dr-congo"},
          {"type": "publication", "title": "UNDP Debt Update: Development Financing", "link": "/publications/undp-debt-update-development-financing"},
          {"type": "story", "title": "Iraq: First chapter of a comeback", "link": "/stories/iraq-first-chapter-of-a-comeback"},
          {"type": "story", "title": "Bending the AI arc towards equity", "link": "/stories/bending-the-ai-arc-towards-equity"}
        ],
        "targetCount": 7,
        "eventCount": 137,
        "publicationCount": 50,
        "actionCount": 1466,
        "backgroundImage": "/themes/custom/porto/assets/goals/images/img-goal-1.jpg",
        "icon": "/sites/default/files/goals/E_SDG_Icons-01.jpg",
        "resources": {
          "pdfWhyItMatters": "/goal_1/1_Why-It-Matters-2020.pdf",
          "gifMakeEveryDayCount": "/goal_1/1_SDG_MakeEveryDayCount_Gifs_GDU.gif",
          "gifIcon": "/goal_1/E_GIF_01.gif",
          "actionCardSquare": "/goal_1/E_SDG_action_card_square_1.jpg",
          "actionCardTwitter": "/goal_1/E_SDG_action_card_twitter_1.jpg",
          "webInverted": "/goal_1/E_WEB_INVERTED_01.png",
          "printFile": "/goal_1/E_PRINT_01.jpg",
          "printInvertedFile": "/goal_1/E_PRINT_INVERTED_01.jpg",
          "webImage": "/goal_1/E_WEB_01.png",
          "infographics": "/goal_1/E_infographics_01.pdf",
          "elyxImage": "/goal_1/E_Elyx_01.png",
          "languagesImage": "/goal_1/Languages_01.png"
        },
        "kpis": [
          {
            "name": "Poverty Headcount Ratio",
            "definition": "Percentage of the population living below the national or international poverty line.",
            "measurementExample": "Survey household incomes and compare them to established poverty thresholds."
          },
          {
            "name": "Coverage of Social Protection Programs",
            "definition": "Proportion of population covered by safety nets (e.g., cash transfers, unemployment benefits).",
            "measurementExample": "Track enrollment in government-led or NGO-led social programs."
          },
          {
            "name": "Income Growth of the Bottom 40%",
            "definition": "Annualized growth rate of household income among the poorest 40% of the population.",
            "measurementExample": "Compare census or panel data on income distribution year-over-year."
          }
        ],
        "usAgencyContributions": {
          "relevantAgencies": [
            "Department of Health and Human Services (HHS)",
            "Department of Housing and Urban Development (HUD)",
            "Department of the Treasury (USDT)",
            "Social Security Administration (SSA)",
            "United States Agency for International Development (USAID)",
            "United States Congress (Legislative Agencies and Budget Appropriations)"
          ],
          "explanation": "These agencies are best positioned to address poverty through complementary approaches. HHS administers critical safety net programs like TANF and Medicaid that provide direct assistance to vulnerable populations. HUD tackles housing insecurity through rental assistance and homelessness programs, addressing a fundamental aspect of poverty. Treasury oversees economic policies and tax credits, such as the EITC, that support low-income families. SSA provides essential income security through retirement, disability, and survivor benefits, particularly for vulnerable populations. USAID focuses on global poverty reduction through development programs that build economic resilience in partner countries. Meanwhile, the U.S. Congress sets legislative frameworks and budget allocations that shape anti-poverty initiatives domestically and abroad. New analyses of U.S. government structures reaffirm Congress's unique constitutional power of the purse, oversight of federal agencies, and the crucial role of legislative support for poverty-focused programs."
        },
        "sampleDeals": [
          {
            "dealId": "G1-Deal1",
            "dealTitle": "Multi-State TANF Enhancement",
            "dealSteps": {
              "step1_defineProblem": "Rural families in multiple states lack reliable income support and face cyclical poverty. Existing TANF benefits are insufficient to cover basic needs.",
              "step2_codifySolution": "Collaborate with state governments and the Treasury to boost TANF funding, including a pilot universal child benefit in selected counties.",
              "step3_setupProgram": {
                "stakeholders": [
                  "HHS (overseeing TANF regulations)",
                  "State governments (administering TANF at local level)",
                  "USDT (allocating additional funding)",
                  "NGOs (providing community-based support)"
                ],
                "financing": "Federal matching grants + state-level budget allocations",
                "milestones": "Sign MOUs with 3 pilot states; expand to 5 more states after evaluating success metrics in Year 1"
              },
              "step4_executeProgram": "States implement the enhanced TANF benefits, local NGOs help with enrollment, HHS monitors compliance.",
              "step5_verifyOutcomeAndDistributeFunds": "Review data on poverty headcount ratio in pilot regions. If improvements meet targets, distribute additional funds to expand statewide."
            }
          }
        ],
        "relevantStandards": [
          {
            "name": "ACORD",
            "organization": "Association for Cooperative Operations Research and Development",
            "description": "Provides global insurance industry data standards and implementation solutions.",
            "url": "https://www.acord.org/",
            "relevance": "Standardized insurance data enables wider access to financial services for vulnerable populations"
          },
          {
            "name": "ISO 20022",
            "organization": "International Organization for Standardization",
            "description": "Universal financial industry message scheme that standardizes messages across financial institutions globally.",
            "url": "https://www.iso20022.org/",
            "relevance": "Facilitates improved access to financial services and remittances for the poor"
          }
        ],
        "agencyServices": [
          {
            "agencyDomain": "hhs.us.gov-ai.co",
            "services": [
              { "name": "Medicare", "desc": "Health insurance for elderly/disabled", "status": 12, "url": "https://medicare.hhs.us.gov-ai.co" },
              { "name": "Medicaid", "desc": "Coverage for low-income individuals", "status": 8, "url": "https://medicaid.hhs.ca.us.gov-ai.co" },
              { "name": "CHIP", "desc": "Children's Health Insurance Program", "status": 5, "url": "https://chip.hhs.us.gov-ai.co" }
            ]
          },
          {
            "agencyDomain": "fhfa.ai",
            "services": [
              { "name": "Housing Finance", "desc": "AI-powered housing finance to prevent a 2008-style housing crisis", "status": 1, "url": "https://fhfa.ai" }
            ]
          },
          {
            "agencyDomain": "usich.ai",
            "services": [
              { "name": "Homelessness", "desc": "AI-powered approach to prevent and end homelessness", "status": 1, "url": "https://usich.ai" }
            ]
          },
          {
            "agencyDomain": "spuhc.ai",
            "services": [
              { "name": "Insurance (SPUHC)", "desc": "AI-powered insurance service to prevent fraud", "status": 1, "url": "https://spuhc.ai" }
            ]
          },
          {
            "agencyDomain": "ssa.us.gov-ai.co",
            "services": [
              { "name": "SSI", "desc": "Supplemental income", "status": 2, "url": "https://ssi.ssa.us.gov-ai.co" }
            ]
          },
          {
            "agencyDomain": "hud.us.gov-ai.co",
            "services": [
              { "name": "Housing Assistance", "desc": "Affordable housing programs", "status": 1, "url": "https://housingassistance.hud.us.gov-ai.co" }
            ]
          }
        ]
      },
      {
        "id": 2,
        "title": "Zero Hunger - Achieve Food Security and Improved Nutrition",
        "text": "Aim to end hunger by ensuring access to sufficient, safe, and nutritious food for all, promoting sustainable agriculture, and eradicating all forms of malnutrition.",
        "fullDescription": "The number of undernourished people has dropped by almost half in the past two decades because of rapid economic growth and increased agricultural productivity. Many developing countries that used to suffer from famine and hunger can now meet their nutritional needs. Central and East Asia, Latin America and the Caribbean have all made huge progress in eradicating extreme hunger. Unfortunately, extreme hunger and malnutrition remain a huge barrier to development in many countries. There are 821 million people estimated to be chronically undernourished as of 2017, often as a direct consequence of environmental degradation, drought and biodiversity loss. Over 90 million children under five are dangerously underweight. Undernourishment and severe food insecurity appear to be increasing in almost all regions of Africa, as well as in South America. The SDGs aim to end all forms of hunger and malnutrition by 2030, making sure all people–especially children–have sufficient and nutritious food all year. This involves promoting sustainable agricultural, supporting small-scale farmers and equal access to land, technology and markets. It also requires international cooperation to ensure investment in infrastructure and technology to improve agricultural productivity.",
        "statistics": [
          {"value": "821 million", "description": "The number of undernourished people reached 821 million in 2017."},
          {"value": "63 percent", "description": "In 2017 Asia accounted for nearly two thirds, 63 percent, of the world's hungry."},
          {"value": "22 percent", "description": "Nearly 151 million children under five, 22 percent, were still stunted in 2017."},
          {"value": "1 in 8", "description": "More than 1 in 8 adults is obese."},
          {"value": "1 in 3", "description": "1 in 3 women of reproductive age is anemic."},
          {"value": "26 percent", "description": "26 percent of workers are employed in agriculture."}
        ],
        "targets": [
          "By 2030, end all forms of malnutrition, including achieving, by 2025, the internationally agreed targets on stunting and wasting in children under 5 years of age, and address the nutritional needs of adolescent girls, pregnant and lactating women and older persons",
          "By 2030, double the agricultural productivity and incomes of small-scale food producers, in particular women, indigenous peoples, family farmers, pastoralists and fishers, including through secure and equal access to land, other productive resources and inputs, knowledge, financial services, markets and opportunities for value addition and non-farm employment",
          "By 2030, ensure sustainable food production systems and implement resilient agricultural practices that increase productivity and production, that help maintain ecosystems, that strengthen capacity for adaptation to climate change, extreme weather, drought, flooding and other disasters and that progressively improve land and soil quality",
          "By 2020, maintain the genetic diversity of seeds, cultivated plants and farmed and domesticated animals and their related wild species, including through soundly managed and diversified seed and plant banks at the national, regional and international levels, and promote access to and fair and equitable sharing of benefits arising from the utilization of genetic resources and associated traditional knowledge, as internationally agreed",
          "Increase investment, including through enhanced international cooperation, in rural infrastructure, agricultural research and extension services, technology development and plant and livestock gene banks in order to enhance agricultural productive capacity in developing countries, in particular least developed countries",
          "Correct and prevent trade restrictions and distortions in world agricultural markets, including through the parallel elimination of all forms of agricultural export subsidies and all export measures with equivalent effect, in accordance with the mandate of the Doha Development Round",
          "Adopt measures to ensure the proper functioning of food commodity markets and their derivatives and facilitate timely access to market information, including on food reserves, in order to help limit extreme food price volatility"
        ],
        "relatedContent": [
          {"type": "story", "title": "Botas Violeta / Purple Boots", "link": "/stories/botas-violeta-purple-boots"},
          {"type": "story", "title": "Sowing community and conservation", "link": "/stories/sowing-community-and-conservation"},
          {"type": "story", "title": "I led a tough life without water", "link": "/stories/i-led-a-tough-life-without-water"},
          {"type": "story", "title": "Women leading the way", "link": "/stories/women-leading-the-way"},
          {"type": "blog", "title": "World Food Day: A call to action", "link": "/blog/world-food-day-a-call-to-action"},
          {"type": "publication", "title": "Supporting Food Systems Transformation", "link": "/publications/supporting-food-systems-transformation"}
        ],
        "targetCount": 8,
        "eventCount": 119,
        "publicationCount": 18,
        "actionCount": 1386,
        "backgroundImage": "/themes/custom/porto/assets/goals/images/img-goal-2.jpg",
        "icon": "/sites/default/files/goals/E_SDG_Icons-02.jpg",
        "resources": {
          "pdfWhyItMatters": "/goal_2/2_Why-It-Matters-2020.pdf",
          "gifMakeEveryDayCount": "/goal_2/2_SDG_MakeEveryDayCount_Gifs_GDU.gif",
          "gifIcon": "/goal_2/E_GIF_02.gif",
          "actionCardSquare": "/goal_2/E_SDG_action_card_square_2.jpg",
          "actionCardTwitter": "/goal_2/E_SDG_action_card_twitter_2.jpg",
          "webInverted": "/goal_2/E_WEB_INVERTED_02.png",
          "printFile": "/goal_2/E_PRINT_02.jpg",
          "printInvertedFile": "/goal_2/E_PRINT_INVERTED_02.jpg",
          "webImage": "/goal_2/E_WEB_02.png",
          "infographics": "/goal_2/E_infographics_02.pdf",
          "elyxImage": "/goal_2/E_Elyx_02.png",
          "languagesImage": "/goal_2/Languages_02.png"
        },
        "kpis": [
          {
            "name": "Prevalence of Undernourishment",
            "definition": "Percentage of population whose dietary intake is insufficient to meet minimum energy requirements.",
            "measurementExample": "Use food balance sheets and household surveys to calculate undernourishment rates."
          },
          {
            "name": "Child Malnutrition Rates",
            "definition": "Prevalence of stunting and wasting in children under five.",
            "measurementExample": "Measure height and weight in clinical settings or community surveys."
          },
          {
            "name": "Sustainable Agriculture Adoption",
            "definition": "Proportion of small-scale farmers using eco-friendly farming methods.",
            "measurementExample": "Survey agricultural practices (e.g., organic inputs, water-efficient irrigation)."
          }
        ],
        "usAgencyContributions": {
          "relevantAgencies": [
            "Department of Agriculture (USDA)",
            "United States Agency for International Development (USAID)",
            "Department of Health and Human Services (HHS)",
            "Department of State (DOS)",
            "Small Business Administration (SBA)",
            "United States Congress (Agriculture Committees and Budget Appropriations)"
          ],
          "explanation": "These agencies collectively address domestic and global hunger challenges. USDA leads through nutrition assistance programs (SNAP, WIC, School Lunch) and agricultural research that improves food production and security. USAID implements Feed the Future and other initiatives that combat global hunger and malnutrition, aligning with international climate and resource management commitments such as those from COP28. HHS contributes through nutrition programs and research on malnutrition's health impacts. DOS coordinates diplomatic efforts on global food security, including negotiating international agreements. The SBA supports small agricultural businesses and food entrepreneurs, helping them access capital and markets. Meanwhile, the U.S. Congress, especially through agriculture and appropriations committees, provides critical legislative and budgetary support shaping federal food and nutrition policies, including farmland conservation and climate resilience funding."
        },
        "sampleDeals": [
          {
            "dealId": "G2-Deal1",
            "dealTitle": "Local Farm-to-School Nutritional Initiative",
            "dealSteps": {
              "step1_defineProblem": "Children in low-income districts lack consistent access to nutritious food, contributing to undernourishment.",
              "step2_codifySolution": "Use USDA grants to incentivize local farmers to supply fresh produce to schools, combined with nutrition education programs led by HHS.",
              "step3_setupProgram": {
                "stakeholders": [
                  "USDA (providing grants + oversight)",
                  "Local farmers (supplying fresh produce)",
                  "School districts (implementing improved meals)",
                  "HHS (research + nutrition guidelines)"
                ],
                "financing": "Grants from USDA + matching funds from local governments; low-interest SBA loans for farmers to scale up",
                "milestones": "Pilot in 10 districts, measure child malnutrition rates after 6 months"
              },
              "step4_executeProgram": "Implement supply chains and training for cafeteria staff; set up local distribution systems.",
              "step5_verifyOutcomeAndDistributeFunds": "Compare baseline child health metrics (BMI, iron levels) with post-initiative results. If improved, expand to more schools."
            }
          }
        ],
        "relevantStandards": [
          {
            "name": "Standard Name",
            "organization": "Sponsoring Organization",
            "description": "Brief description of standard",
            "url": "Link to standard documentation",
            "relevance": "How this standard supports the SDG"
          }
        ],
        "agencyServices": [
          {
            "agencyDomain": "usda.us.gov-ai.co",
            "services": [
              { "name": "Agricultural Programs", "desc": "Farming and food support", "status": 1, "url": "https://agriculturalprograms.usda.us.gov-ai.co" },
              { "name": "Farm Service Agency", "desc": "Support for farmers", "status": 1, "url": "https://fsfa.usda.us.gov-ai.co" }
            ]
          },
          {
            "agencyDomain": "cnpp.ai",
            "services": [
              { "name": "Nutrition Policy and Programs", "desc": "AI-powered nutrition policy and programs to prevent malnutrition", "status": 1, "url": "https://cnpp.ai" }
            ]
          },
          {
            "agencyDomain": "cfsan.ai",
            "services": [
              { "name": "Food Safety and Nutrition", "desc": "AI-driven approach for food safety to reduce recalls and improve nutrition", "status": 1, "url": "https://cfsan.ai" }
            ]
          },
          {
            "agencyDomain": "fda.us.gov-ai.co",
            "services": [
              { "name": "CFSAN", "desc": "Center for Food Safety and Applied Nutrition", "status": 1, "url": "https://cfsan.fda.us.gov-ai.co" }
            ]
          }
        ]
      },
      {
        "id": 3,
        "title": "Good Health and Well-being - Ensure Healthy Lives for All Ages",
        "text": "Focus on improving healthcare access, reducing maternal and infant mortality, combating infectious diseases, and promoting mental health and well-being for everyone.",
        "fullDescription": "The SDGs can only be realized with strong global partnerships and cooperation. Official Development Assistance remained steady but below target, at US$147 billion in 2017. While humanitarian crises brought on by conflict or natural disasters continue to demand more financial resources and aid. Many countries also require Official Development Assistance to encourage growth and trade. The world is more interconnected than ever. Improving access to technology and knowledge is an important way to share ideas and foster innovation. Coordinating policies to help developing countries manage their debt, as well as promoting investment for the least developed, is vital for sustainable growth and development. The goals aim to enhance North-South and South-South cooperation by supporting national plans to achieve all the targets. Promoting international trade, and helping developing countries increase their exports is all part of achieving a universal rules-based and equitable trading system that is fair and open and benefits all.",
        "statistics": [
          {"value": "$5 trillion", "description": "The UN Conference on Trade and Development (UNCTAD) says achieving SDGs will require US$5 trillion to $7 trillion in annual investment."},
          {"value": "$147.2 billion", "description": "Total official development assistance reached US$147.2 billion in 2017."},
          {"value": "$613 billion", "description": "In 2017, international remittances totaled US$613 billion; 76 percent of it went to developing countries."},
          {"value": "6 countries", "description": "In 2016, 6 countries met the international target to keep official development assistance at or above 0.7 percent of gross national income."},
          {"value": "$18.2 trillion", "description": "Sustainable and responsible investments represent high-potential sources of capital for SDGs. As of 2016, US$18.2 trillion was invested in this asset class."},
          {"value": "$155.5 billion", "description": "The bond market for sustainable business is growing. In 2018 global green bonds reached US$155.5billion, up 78 percent from previous year."}
        ],
        "targets": {
          "finance": [
            "Strengthen domestic resource mobilization, including through international support to developing countries, to improve domestic capacity for tax and other revenue collection",
            "Developed countries to implement fully their official development assistance commitments, including the commitment by many developed countries to achieve the target of 0.7 per cent of ODA/GNI to developing countries and 0.15 to 0.20 per cent of ODA/GNI to least developed countries ODA providers are encouraged to consider setting a target to provide at least 0.20 per cent of ODA/GNI to least developed countries",
            "Mobilize additional financial resources for developing countries from multiple sources",
            "Assist developing countries in attaining long-term debt sustainability through coordinated policies aimed at fostering debt financing, debt relief and debt restructuring, as appropriate, and address the external debt of highly indebted poor countries to reduce debt distress",
            "Adopt and implement investment promotion regimes for least developed countries"
          ],
          "technology": [
            "Enhance North-South, South-South and triangular regional and international cooperation on and access to science, technology and innovation and enhance knowledge sharing on mutually agreed terms, including through improved coordination among existing mechanisms, in particular at the United Nations level, and through a global technology facilitation mechanism",
            "Promote the development, transfer, dissemination and diffusion of environmentally sound technologies to developing countries on favourable terms, including on concessional and preferential terms, as mutually agreed",
            "Fully operationalize the technology bank and science, technology and innovation capacity-building mechanism for least developed countries by 2017 and enhance the use of enabling technology, in particular information and communications technology"
          ],
          "capacityBuilding": [
            "Enhance international support for implementing effective and targeted capacity-building in developing countries to support national plans to implement all the sustainable development goals, including through North-South, South-South and triangular cooperation"
          ],
          "trade": [
            "Promote a universal, rules-based, open, non-discriminatory and equitable multilateral trading system under the World Trade Organization, including through the conclusion of negotiations under its Doha Development Agenda",
            "Significantly increase the exports of developing countries, in particular with a view to doubling the least developed countries' share of global exports by 2020",
            "Realize timely implementation of duty-free and quota-free market access on a lasting basis for all least developed countries, consistent with World Trade Organization decisions, including by ensuring that preferential rules of origin applicable to imports from least developed countries are transparent and simple, and contribute to facilitating market access"
          ],
          "systemicIssues": {
            "policyAndInstitutionalCoherence": [
              "Enhance global macroeconomic stability, including through policy coordination and policy coherence",
              "Enhance policy coherence for sustainable development",
              "Respect each country's policy space and leadership to establish and implement policies for poverty eradication and sustainable development"
            ],
            "multiStakeholderPartnerships": [
              "Enhance the global partnership for sustainable development, complemented by multi-stakeholder partnerships that mobilize and share knowledge, expertise, technology and financial resources, to support the achievement of the sustainable development goals in all countries, in particular developing countries",
              "Encourage and promote effective public, public-private and civil society partnerships, building on the experience and resourcing strategies of partnerships"
            ],
            "dataMonitoringAndAccountability": [
              "By 2020, enhance capacity-building support to developing countries, including for least developed countries and small island developing States, to increase significantly the availability of high-quality, timely and reliable data disaggregated by income, gender, age, race, ethnicity, migratory status, disability, geographic location and other characteristics relevant in national contexts",
              "By 2030, build on existing initiatives to develop measurements of progress on sustainable development that complement gross domestic product, and support statistical capacity-building in developing countries"
            ]
          }
        },
        "relatedContent": [
          {"type": "story", "title": "Despite conflict, resilience remains", "link": "/stories/despite-conflict-resilience-remains"},
          {"type": "blog", "title": "Bringing everyone to the table", "link": "/blog/bringing-everyone-to-the-table"},
          {"type": "blog", "title": "UNDP core funding: Powering sustainable development", "link": "/blog/undp-core-funding-powering-sustainable-development"},
          {"type": "blog", "title": "Breaking barriers for all women", "link": "/blog/breaking-barriers-for-all-women"},
          {"type": "blog", "title": "Women leading crisis recovery and prevention", "link": "/blog/women-leading-crisis-recovery-and-prevention"},
          {"type": "story", "title": "Botas Violeta / Purple Boots", "link": "/stories/botas-violeta-purple-boots"}
        ],
        "targetCount": 13,
        "eventCount": 67,
        "publicationCount": 49,
        "actionCount": 1304,
        "backgroundImage": "/themes/custom/porto/assets/goals/images/img-goal-3.jpg",
        "icon": "/sites/default/files/goals/E_SDG_Icons-03.jpg",
        "resources": {
          "pdfWhyItMatters": "/goal_3/3_Why-It-Matters-2020.pdf",
          "gifMakeEveryDayCount": "/goal_3/3_SDG_MakeEveryDayCount_Gifs_GDU.gif",
          "gifIcon": "/goal_3/E_GIF_03.gif",
          "actionCardSquare": "/goal_3/E_SDG_action_card_square_3.jpg",
          "actionCardTwitter": "/goal_3/E_SDG_action_card_twitter_3.jpg",
          "webInverted": "/goal_3/E_WEB_INVERTED_03.png",
          "printFile": "/goal_3/E_PRINT_03.jpg",
          "printInvertedFile": "/goal_3/E_PRINT_INVERTED_03.jpg",
          "webImage": "/goal_3/E_WEB_03.png",
          "infographics": "/goal_3/E_infographics_03.pdf",
          "elyxImage": "/goal_3/E_Elyx_03.png",
          "languagesImage": "/goal_3/Languages_03.png"
        },
        "kpis": [
          {
            "name": "Maternal Mortality Ratio",
            "definition": "Number of maternal deaths per 100,000 live births.",
            "measurementExample": "Compare hospital records and official registries of birth outcomes."
          },
          {
            "name": "Under-5 Mortality Rate",
            "definition": "Number of deaths of children under five per 1,000 live births.",
            "measurementExample": "Assess vital statistics from healthcare systems or demographic surveys."
          },
          {
            "name": "Coverage of Essential Health Services",
            "definition": "Proportion of population with access to core healthcare services.",
            "measurementExample": "Track immunization rates, skilled birth attendance, and treatment coverage."
          }
        ],
        "usAgencyContributions": {
          "relevantAgencies": [
            "Department of Health and Human Services (HHS)",
            "Centers for Disease Control and Prevention (CDC)",
            "National Institutes of Health (NIH)",
            "Food and Drug Administration (FDA)",
            "Department of Veterans Affairs (VA)",
            "Executive Office of the President (Office of Science and Technology Policy, Pandemic Preparedness)",
            "United States Congress (House and Senate Health Committees, Budget Appropriations)"
          ],
          "explanation": "These agencies and offices form the backbone of U.S. health infrastructure. HHS coordinates overall health policy and administers Medicare and Medicaid, ensuring healthcare access for millions. CDC leads disease prevention, pandemic preparedness (including lessons from COVID-19), and public health emergency response—vital in the face of emerging threats of antimicrobial resistance, bioterrorism, and future pandemics. NIH conducts groundbreaking medical research on treatments and vaccines. The FDA regulates the safety and efficacy of medical products, including new classes of antibiotics and breakthrough genomic therapies. The VA provides comprehensive care to millions of veterans, helping to pioneer integrated services for mental health. The Executive Office of the President, especially via the National Security Council and the Office of Science and Technology Policy, coordinates federal pandemic and biodefense strategies. U.S. Congress provides the legislative framework and funding for these agencies—upholding or expanding healthcare programs domestically and authorizing global health assistance."
        },
        "sampleDeals": [
          {
            "dealId": "G3-Deal1",
            "dealTitle": "Mobile Maternal Health Clinics",
            "dealSteps": {
              "step1_defineProblem": "Rural communities lack maternal health services, leading to higher maternal mortality rates.",
              "step2_codifySolution": "Deploy mobile clinics with telehealth capabilities to reach pregnant women in remote areas, in partnership with HHS and local providers.",
              "step3_setupProgram": {
                "stakeholders": [
                  "HHS (funding + guidance)",
                  "CDC (monitoring maternal health data)",
                  "Local hospitals (staff for mobile units)",
                  "Community organizations (outreach + education)"
                ],
                "financing": "Federal grants + state cost-sharing; NIH R&D for improved telehealth technologies",
                "milestones": "Expand coverage from 2 pilot counties to 10 after demonstrating a 25% decrease in maternal mortality"
              },
              "step4_executeProgram": "Launch mobile units, train staff in telemedicine. Conduct regular home visits for high-risk pregnancies.",
              "step5_verifyOutcomeAndDistributeFunds": "Measure improvement in maternal/newborn health indicators. If successful, reimburse local partners and expand the program."
            }
          }
        ],
        "relevantStandards": [
          {
            "name": "HL7 FHIR",
            "organization": "Health Level Seven International",
            "description": "Standard for exchanging healthcare information electronically.",
            "url": "https://www.hl7.org/fhir/",
            "relevance": "Enables seamless healthcare data exchange, improving care coordination and quality"
          },
          {
            "name": "DICOM",
            "organization": "DICOM Standards Committee",
            "description": "Standard for handling, storing, printing, and transmitting information in medical imaging.",
            "url": "https://www.dicomstandard.org/",
            "relevance": "Facilitates diagnostic imaging availability across healthcare settings"
          },
          {
            "name": "ICH",
            "organization": "International Council for Harmonisation",
            "description": "Guidelines for pharmaceuticals for human use.",
            "url": "https://www.ich.org/",
            "relevance": "Ensures safe, effective medicines developed efficiently"
          }
        ],
        "agencyServices": [
          {
            "agencyDomain": "hhs.us.gov-ai.co",
            "services": [
              { "name": "Medicare", "desc": "Health insurance for elderly/disabled", "status": 12, "url": "https://medicare.hhs.us.gov-ai.co" },
              { "name": "Medicaid", "desc": "Coverage for low-income individuals", "status": 8, "url": "https://medicaid.hhs.ca.us.gov-ai.co" },
              { "name": "ACA", "desc": "Affordable Care Act Marketplace", "status": 9, "url": "https://aca.hhs.us.gov-ai.co" },
              { "name": "IHS", "desc": "Indian Health Service", "status": 3, "url": "https://ihs.hhs.us.gov-ai.co" }
            ]
          },
          {
            "agencyDomain": "fda.us.gov-ai.co",
            "services": [
              { "name": "CBER", "desc": "Center for Biologics Evaluation and Research", "status": 2, "url": "https://cber.fda.us.gov-ai.co" },
              { "name": "CDER", "desc": "Center for Drug Evaluation and Research", "status": 1, "url": "https://cder.fda.us.gov-ai.co" },
              { "name": "NCTR", "desc": "National Center for Toxicological Research", "status": 1, "url": "https://nctr.fda.us.gov-ai.co" }
            ]
          },
          {
            "agencyDomain": "ondcp.ai",
            "services": [
              { "name": "Drug Control Policy", "desc": "AI-powered Office of National Drug Control Policy to prevent drug abuse", "status": 1, "url": "https://ondcp.ai" }
            ]
          },
          {
            "agencyDomain": "nccih.ai",
            "services": [
              { "name": "Complementary and Integrative Health", "desc": "AI solutions for integrative health coverage to prevent insurance fraud", "status": 1, "url": "https://nccih.ai" }
            ]
          },
          {
            "agencyDomain": "niddk.ai",
            "services": [
              { "name": "Diabetes & Digestive & Kidney Diseases", "desc": "AI coverage to prevent insurance fraud and improve disease management", "status": 1, "url": "https://niddk.ai" }
            ]
          },
          {
            "agencyDomain": "crohns.ai",
            "services": [
              { "name": "Crohn's Disease Prevention", "desc": "AI solutions to detect, manage, and help prevent Crohn's disease", "status": 1, "url": "https://crohns.ai" }
            ]
          },
          {
            "agencyDomain": "cber.ai",
            "services": [
              { "name": "Biologics Evaluation and Research", "desc": "AI-powered testing and regulation of biologic drugs", "status": 1, "url": "https://cber.ai" }
            ]
          },
          {
            "agencyDomain": "cder.ai",
            "services": [
              { "name": "Drug Evaluation and Research", "desc": "AI-powered testing and regulation of drugs", "status": 1, "url": "https://cder.ai" }
            ]
          },
          {
            "agencyDomain": "vha.us.gov-ai.co",
            "services": [
              { "name": "VA Healthcare", "desc": "Veterans healthcare", "status": 5, "url": "https://vahealthcare.vha.us.gov-ai.co" }
            ]
          },
          {
            "agencyDomain": "dod.us.gov-ai.co",
            "services": [
              { "name": "TRICARE", "desc": "Military healthcare", "status": 3, "url": "https://tricare.dod.us.gov-ai.co" }
            ]
          }
        ]
      },
      {
        "id": 4,
        "title": "Quality Education - Provide Inclusive and Equitable Education",
        "text": "Ensure lifelong learning opportunities for all by improving access to quality education that is inclusive, equitable, and tailored to diverse learning needs.",
        "fullDescription": "The SDGs can only be realized with strong global partnerships and cooperation. Official Development Assistance remained steady but below target, at US$147 billion in 2017. While humanitarian crises brought on by conflict or natural disasters continue to demand more financial resources and aid. Many countries also require Official Development Assistance to encourage growth and trade. The world is more interconnected than ever. Improving access to technology and knowledge is an important way to share ideas and foster innovation. Coordinating policies to help developing countries manage their debt, as well as promoting investment for the least developed, is vital for sustainable growth and development. The goals aim to enhance North-South and South-South cooperation by supporting national plans to achieve all the targets. Promoting international trade, and helping developing countries increase their exports is all part of achieving a universal rules-based and equitable trading system that is fair and open and benefits all.",
        "statistics": [
          {"value": "$5 trillion", "description": "The UN Conference on Trade and Development (UNCTAD) says achieving SDGs will require US$5 trillion to $7 trillion in annual investment."},
          {"value": "$147.2 billion", "description": "Total official development assistance reached US$147.2 billion in 2017."},
          {"value": "$613 billion", "description": "In 2017, international remittances totaled US$613 billion; 76 percent of it went to developing countries."},
          {"value": "6 countries", "description": "In 2016, 6 countries met the international target to keep official development assistance at or above 0.7 percent of gross national income."},
          {"value": "$18.2 trillion", "description": "Sustainable and responsible investments represent high-potential sources of capital for SDGs. As of 2016, US$18.2 trillion was invested in this asset class."},
          {"value": "$155.5 billion", "description": "The bond market for sustainable business is growing. In 2018 global green bonds reached US$155.5billion, up 78 percent from previous year."}
        ],
        "targets": {
          "finance": [
            "Strengthen domestic resource mobilization, including through international support to developing countries, to improve domestic capacity for tax and other revenue collection",
            "Developed countries to implement fully their official development assistance commitments, including the commitment by many developed countries to achieve the target of 0.7 per cent of ODA/GNI to developing countries and 0.15 to 0.20 per cent of ODA/GNI to least developed countries ODA providers are encouraged to consider setting a target to provide at least 0.20 per cent of ODA/GNI to least developed countries",
            "Mobilize additional financial resources for developing countries from multiple sources",
            "Assist developing countries in attaining long-term debt sustainability through coordinated policies aimed at fostering debt financing, debt relief and debt restructuring, as appropriate, and address the external debt of highly indebted poor countries to reduce debt distress",
            "Adopt and implement investment promotion regimes for least developed countries"
          ],
          "technology": [
            "Enhance North-South, South-South and triangular regional and international cooperation on and access to science, technology and innovation and enhance knowledge sharing on mutually agreed terms, including through improved coordination among existing mechanisms, in particular at the United Nations level, and through a global technology facilitation mechanism",
            "Promote the development, transfer, dissemination and diffusion of environmentally sound technologies to developing countries on favourable terms, including on concessional and preferential terms, as mutually agreed",
            "Fully operationalize the technology bank and science, technology and innovation capacity-building mechanism for least developed countries by 2017 and enhance the use of enabling technology, in particular information and communications technology"
          ],
          "capacityBuilding": [
            "Enhance international support for implementing effective and targeted capacity-building in developing countries to support national plans to implement all the sustainable development goals, including through North-South, South-South and triangular cooperation"
          ],
          "trade": [
            "Promote a universal, rules-based, open, non-discriminatory and equitable multilateral trading system under the World Trade Organization, including through the conclusion of negotiations under its Doha Development Agenda",
            "Significantly increase the exports of developing countries, in particular with a view to doubling the least developed countries' share of global exports by 2020",
            "Realize timely implementation of duty-free and quota-free market access on a lasting basis for all least developed countries, consistent with World Trade Organization decisions, including by ensuring that preferential rules of origin applicable to imports from least developed countries are transparent and simple, and contribute to facilitating market access"
          ],
          "systemicIssues": {
            "policyAndInstitutionalCoherence": [
              "Enhance global macroeconomic stability, including through policy coordination and policy coherence",
              "Enhance policy coherence for sustainable development",
              "Respect each country's policy space and leadership to establish and implement policies for poverty eradication and sustainable development"
            ],
            "multiStakeholderPartnerships": [
              "Enhance the global partnership for sustainable development, complemented by multi-stakeholder partnerships that mobilize and share knowledge, expertise, technology and financial resources, to support the achievement of the sustainable development goals in all countries, in particular developing countries",
              "Encourage and promote effective public, public-private and civil society partnerships, building on the experience and resourcing strategies of partnerships"
            ],
            "dataMonitoringAndAccountability": [
              "By 2020, enhance capacity-building support to developing countries, including for least developed countries and small island developing States, to increase significantly the availability of high-quality, timely and reliable data disaggregated by income, gender, age, race, ethnicity, migratory status, disability, geographic location and other characteristics relevant in national contexts",
              "By 2030, build on existing initiatives to develop measurements of progress on sustainable development that complement gross domestic product, and support statistical capacity-building in developing countries"
            ]
          }
        },
        "relatedContent": [
          {"type": "story", "title": "Despite conflict, resilience remains", "link": "/stories/despite-conflict-resilience-remains"},
          {"type": "blog", "title": "Bringing everyone to the table", "link": "/blog/bringing-everyone-to-the-table"},
          {"type": "blog", "title": "UNDP core funding: Powering sustainable development", "link": "/blog/undp-core-funding-powering-sustainable-development"},
          {"type": "blog", "title": "Breaking barriers for all women", "link": "/blog/breaking-barriers-for-all-women"},
          {"type": "blog", "title": "Women leading crisis recovery and prevention", "link": "/blog/women-leading-crisis-recovery-and-prevention"},
          {"type": "story", "title": "Botas Violeta / Purple Boots", "link": "/stories/botas-violeta-purple-boots"}
        ],
        "targetCount": 10,
        "eventCount": 73,
        "publicationCount": 12,
        "actionCount": 1849,
        "backgroundImage": "/themes/custom/porto/assets/goals/images/img-goal-4.jpg",
        "icon": "/sites/default/files/goals/E_SDG_Icons-04.jpg",
        "resources": {
          "pdfWhyItMatters": "/goal_4/4_Why-It-Matters-2020.pdf",
          "gifMakeEveryDayCount": "/goal_4/4_SDG_MakeEveryDayCount_Gifs_GDU.gif",
          "gifIcon": "/goal_4/E_GIF_04.gif",
          "actionCardSquare": "/goal_4/E_SDG_action_card_square_4.jpg",
          "actionCardTwitter": "/goal_4/E_SDG_action_card_twitter_4.jpg",
          "webInverted": "/goal_4/E_WEB_INVERTED_04.png",
          "printFile": "/goal_4/E_PRINT_04.jpg",
          "printInvertedFile": "/goal_4/E_PRINT_INVERTED_04.jpg",
          "webImage": "/goal_4/E_WEB_04.png",
          "infographics": "/goal_4/E_infographics_04.pdf",
          "elyxImage": "/goal_4/E_Elyx_04.png",
          "languagesImage": "/goal_4/Languages_04.png"
        },
        "kpis": [
          {
            "name": "Primary and Secondary Enrollment Rates",
            "definition": "Percentage of eligible children enrolled in formal education levels.",
            "measurementExample": "Use administrative school enrollment records or household surveys."
          },
          {
            "name": "Literacy Rate",
            "definition": "Proportion of youth/adults who can read and write at a functional level.",
            "measurementExample": "Conduct standardized literacy assessments or self-reported surveys."
          },
          {
            "name": "Completion Rate",
            "definition": "Proportion of students who finish primary/secondary education on time.",
            "measurementExample": "Track cohort data to see how many learners complete each level."
          }
        ],
        "usAgencyContributions": {
          "relevantAgencies": [
            "Department of Education (ED)",
            "National Science Foundation (NSF)",
            "Department of Labor (DOL)",
            "Smithsonian Institution",
            "Institute of Education Sciences (IES)",
            "United States Congress (Education Committees, Budget Appropriations)",
            "Executive Office of the President (Office of Management and Budget)"
          ],
          "explanation": "These agencies support educational initiatives across the lifespan. ED manages federal education policy, financial aid programs, and enforces civil rights in schools. The NSF funds STEM research and promotes equitable access to science education. The Department of Labor's workforce development programs align education with employment, especially crucial amid rapid technological change. The Smithsonian provides vast informal learning resources through museums and research collections. IES conducts and funds evidence-based research to improve classroom practices. The U.S. Congress provides the essential legislative and budget frameworks, while the Office of Management and Budget (OMB) coordinates federal performance in education. New legislative definitions for agencies highlight the fluid, often-overlapping boundaries of agencies involved in education, leading to cross-agency collaborations such as the White House's push for universal pre-K or bridging STEM workforce shortages with targeted scholarships and tele-education approaches."
        },
        "sampleDeals": [
          {
            "dealId": "G4-Deal1",
            "dealTitle": "Rural Digital Learning Expansion",
            "dealSteps": {
              "step1_defineProblem": "Rural districts have limited broadband, leading to low digital literacy and reduced job readiness.",
              "step2_codifySolution": "Partner with ED, NSF, and private ISPs to expand high-speed internet and digital classrooms in underserved areas.",
              "step3_setupProgram": {
                "stakeholders": [
                  "ED (grant funding for schools)",
                  "NSF (research on best practices in e-learning)",
                  "ISPs (infrastructure setup)",
                  "Local school boards (implementation + teacher training)"
                ],
                "financing": "Federal e-rate subsidies + state matching funds + private sector investment",
                "milestones": "Increase digital enrollment by 40% in 2 years; measure improvement in standardized digital literacy scores"
              },
              "step4_executeProgram": "Install broadband, provide devices to students, train teachers in digital pedagogy.",
              "step5_verifyOutcomeAndDistributeFunds": "Assess usage rates and test scores. If targets met, expand coverage to additional counties; finalize reimbursement to ISPs."
            }
          }
        ],
        "relevantStandards": [
          {
            "name": "Standard Name",
            "organization": "Sponsoring Organization",
            "description": "Brief description of standard",
            "url": "Link to standard documentation",
            "relevance": "How this standard supports the SDG"
          }
        ],
        "agencyServices": [
          {
            "agencyDomain": "usda.us.gov-ai.co",
            "services": [
              { "name": "Agricultural Programs", "desc": "Farming and food support", "status": 1, "url": "https://agriculturalprograms.usda.us.gov-ai.co" },
              { "name": "Farm Service Agency", "desc": "Support for farmers", "status": 1, "url": "https://fsfa.usda.us.gov-ai.co" }
            ]
          },
          {
            "agencyDomain": "cnpp.ai",
            "services": [
              { "name": "Nutrition Policy and Programs", "desc": "AI-powered nutrition policy and programs to prevent malnutrition", "status": 1, "url": "https://cnpp.ai" }
            ]
          },
          {
            "agencyDomain": "cfsan.ai",
            "services": [
              { "name": "Food Safety and Nutrition", "desc": "AI-driven approach for food safety to reduce recalls and improve nutrition", "status": 1, "url": "https://cfsan.ai" }
            ]
          },
          {
            "agencyDomain": "fda.us.gov-ai.co",
            "services": [
              { "name": "CFSAN", "desc": "Center for Food Safety and Applied Nutrition", "status": 1, "url": "https://cfsan.fda.us.gov-ai.co" }
            ]
          }
        ]
      },
      {
        "id": 5,
        "title": "Gender Equality - Empower All Women and Girls",
        "text": "Eliminate discrimination and violence against women and girls, ensuring equal rights, opportunities, and representation in all areas of life.",
        "fullDescription": "The SDGs can only be realized with strong global partnerships and cooperation. Official Development Assistance remained steady but below target, at US$147 billion in 2017. While humanitarian crises brought on by conflict or natural disasters continue to demand more financial resources and aid. Many countries also require Official Development Assistance to encourage growth and trade. The world is more interconnected than ever. Improving access to technology and knowledge is an important way to share ideas and foster innovation. Coordinating policies to help developing countries manage their debt, as well as promoting investment for the least developed, is vital for sustainable growth and development. The goals aim to enhance North-South and South-South cooperation by supporting national plans to achieve all the targets. Promoting international trade, and helping developing countries increase their exports is all part of achieving a universal rules-based and equitable trading system that is fair and open and benefits all.",
        "statistics": [
          {"value": "$5 trillion", "description": "The UN Conference on Trade and Development (UNCTAD) says achieving SDGs will require US$5 trillion to $7 trillion in annual investment."},
          {"value": "$147.2 billion", "description": "Total official development assistance reached US$147.2 billion in 2017."},
          {"value": "$613 billion", "description": "In 2017, international remittances totaled US$613 billion; 76 percent of it went to developing countries."},
          {"value": "6 countries", "description": "In 2016, 6 countries met the international target to keep official development assistance at or above 0.7 percent of gross national income."},
          {"value": "$18.2 trillion", "description": "Sustainable and responsible investments represent high-potential sources of capital for SDGs. As of 2016, US$18.2 trillion was invested in this asset class."},
          {"value": "$155.5 billion", "description": "The bond market for sustainable business is growing. In 2018 global green bonds reached US$155.5billion, up 78 percent from previous year."}
        ],
        "targets": {
          "finance": [
            "Strengthen domestic resource mobilization, including through international support to developing countries, to improve domestic capacity for tax and other revenue collection",
            "Developed countries to implement fully their official development assistance commitments, including the commitment by many developed countries to achieve the target of 0.7 per cent of ODA/GNI to developing countries and 0.15 to 0.20 per cent of ODA/GNI to least developed countries ODA providers are encouraged to consider setting a target to provide at least 0.20 per cent of ODA/GNI to least developed countries",
            "Mobilize additional financial resources for developing countries from multiple sources",
            "Assist developing countries in attaining long-term debt sustainability through coordinated policies aimed at fostering debt financing, debt relief and debt restructuring, as appropriate, and address the external debt of highly indebted poor countries to reduce debt distress",
            "Adopt and implement investment promotion regimes for least developed countries"
          ],
          "technology": [
            "Enhance North-South, South-South and triangular regional and international cooperation on and access to science, technology and innovation and enhance knowledge sharing on mutually agreed terms, including through improved coordination among existing mechanisms, in particular at the United Nations level, and through a global technology facilitation mechanism",
            "Promote the development, transfer, dissemination and diffusion of environmentally sound technologies to developing countries on favourable terms, including on concessional and preferential terms, as mutually agreed",
            "Fully operationalize the technology bank and science, technology and innovation capacity-building mechanism for least developed countries by 2017 and enhance the use of enabling technology, in particular information and communications technology"
          ],
          "capacityBuilding": [
            "Enhance international support for implementing effective and targeted capacity-building in developing countries to support national plans to implement all the sustainable development goals, including through North-South, South-South and triangular cooperation"
          ],
          "trade": [
            "Promote a universal, rules-based, open, non-discriminatory and equitable multilateral trading system under the World Trade Organization, including through the conclusion of negotiations under its Doha Development Agenda",
            "Significantly increase the exports of developing countries, in particular with a view to doubling the least developed countries' share of global exports by 2020",
            "Realize timely implementation of duty-free and quota-free market access on a lasting basis for all least developed countries, consistent with World Trade Organization decisions, including by ensuring that preferential rules of origin applicable to imports from least developed countries are transparent and simple, and contribute to facilitating market access"
          ],
          "systemicIssues": {
            "policyAndInstitutionalCoherence": [
              "Enhance global macroeconomic stability, including through policy coordination and policy coherence",
              "Enhance policy coherence for sustainable development",
              "Respect each country's policy space and leadership to establish and implement policies for poverty eradication and sustainable development"
            ],
            "multiStakeholderPartnerships": [
              "Enhance the global partnership for sustainable development, complemented by multi-stakeholder partnerships that mobilize and share knowledge, expertise, technology and financial resources, to support the achievement of the sustainable development goals in all countries, in particular developing countries",
              "Encourage and promote effective public, public-private and civil society partnerships, building on the experience and resourcing strategies of partnerships"
            ],
            "dataMonitoringAndAccountability": [
              "By 2020, enhance capacity-building support to developing countries, including for least developed countries and small island developing States, to increase significantly the availability of high-quality, timely and reliable data disaggregated by income, gender, age, race, ethnicity, migratory status, disability, geographic location and other characteristics relevant in national contexts",
              "By 2030, build on existing initiatives to develop measurements of progress on sustainable development that complement gross domestic product, and support statistical capacity-building in developing countries"
            ]
          }
        },
        "relatedContent": [
          {"type": "story", "title": "Despite conflict, resilience remains", "link": "/stories/despite-conflict-resilience-remains"},
          {"type": "blog", "title": "Bringing everyone to the table", "link": "/blog/bringing-everyone-to-the-table"},
          {"type": "blog", "title": "UNDP core funding: Powering sustainable development", "link": "/blog/undp-core-funding-powering-sustainable-development"},
          {"type": "blog", "title": "Breaking barriers for all women", "link": "/blog/breaking-barriers-for-all-women"},
          {"type": "blog", "title": "Women leading crisis recovery and prevention", "link": "/blog/women-leading-crisis-recovery-and-prevention"},
          {"type": "story", "title": "Botas Violeta / Purple Boots", "link": "/stories/botas-violeta-purple-boots"}
        ],
        "targetCount": 9,
        "eventCount": 102,
        "publicationCount": 48,
        "actionCount": 1702,
        "backgroundImage": "/themes/custom/porto/assets/goals/images/img-goal-5.jpg",
        "icon": "/sites/default/files/goals/E_SDG_Icons-05.jpg",
        "resources": {
          "pdfWhyItMatters": "/goal_5/5_Why-It-Matters-2020.pdf",
          "gifMakeEveryDayCount": "/goal_5/5_SDG_MakeEveryDayCount_Gifs_GDU.gif",
          "gifIcon": "/goal_5/E_GIF_05.gif",
          "actionCardSquare": "/goal_5/E_SDG_action_card_square_5.jpg",
          "actionCardTwitter": "/goal_5/E_SDG_action_card_twitter_5.jpg",
          "webInverted": "/goal_5/E_WEB_INVERTED_05.png",
          "printFile": "/goal_5/E_PRINT_05.jpg",
          "printInvertedFile": "/goal_5/E_PRINT_INVERTED_05.jpg",
          "webImage": "/goal_5/E_WEB_05.png",
          "infographics": "/goal_5/E_infographics_05.pdf",
          "elyxImage": "/goal_5/E_Elyx_05.png",
          "languagesImage": "/goal_5/Languages_05.png"
        },
        "kpis": [
          {
            "name": "Gender Pay Gap",
            "definition": "Difference between average earnings of women and men as a share of male earnings.",
            "measurementExample": "Collect wage data by gender and compare mean or median salaries."
          },
          {
            "name": "Representation in Leadership",
            "definition": "Proportion of women in managerial positions or parliamentary seats.",
            "measurementExample": "Count the number of women in executive roles or elected offices vs total."
          },
          {
            "name": "Prevalence of Gender-Based Violence",
            "definition": "Percentage of women and girls who have experienced physical or sexual violence.",
            "measurementExample": "Use surveys or administrative data from healthcare and legal systems."
          }
        ],
        "usAgencyContributions": {
          "relevantAgencies": [
            "Equal Employment Opportunity Commission (EEOC)",
            "Department of Justice (DOJ)",
            "Department of State (DOS)",
            "Office of Personnel Management (OPM)",
            "United States Agency for International Development (USAID)",
            "United States Congress (Committees on Women's Issues, Budget Appropriations)"
          ],
          "explanation": "These agencies tackle gender equality from multiple angles. The EEOC enforces laws against workplace discrimination, including sexual harassment. DOJ prosecutes gender-based violence, aligning with the global push (e.g., Istanbul Convention) to end violence against women. DOS promotes women's rights internationally through diplomacy and development funding, including the Office of Global Women's Issues. OPM develops policies to advance gender equity within federal employment, potentially modeling inclusive practices for other employers. USAID funds programs globally that empower women economically and expand girls' access to education. The U.S. Congress, through committees such as the House Select Committee on Economic Disparity and Fairness in Growth, appropriates funds and reforms laws to strengthen programs that address gender inequality domestically and globally."
        },
        "sampleDeals": [
          {
            "dealId": "G5-Deal1",
            "dealTitle": "Closing the Tech Gender Gap Initiative",
            "dealSteps": {
              "step1_defineProblem": "Women are underrepresented in STEM fields, face pay gaps, and have limited mentorship opportunities.",
              "step2_codifySolution": "Create a public-private partnership offering scholarships, apprenticeships, and EEOC-led compliance reviews to ensure fair pay policies.",
              "step3_setupProgram": {
                "stakeholders": [
                  "EEOC (monitor and enforce pay equity)",
                  "Tech corporations (mentorship + apprenticeship slots)",
                  "USAID or DOS (for international outreach in partner countries)",
                  "Nonprofits (coordinating training and advocacy)"
                ],
                "financing": "Federal grants matched by corporate sponsors, tax incentives for companies with proven pay equity",
                "milestones": "Double the number of women in mid-level tech roles within 3 years in participating companies"
              },
              "step4_executeProgram": "Enroll women in apprenticeships, provide mentors, ensure corporate compliance with pay transparency.",
              "step5_verifyOutcomeAndDistributeFunds": "EEOC reviews pay data; if equity benchmarks are met, finalize corporate tax incentives and expand the program."
            }
          }
        ],
        "relevantStandards": [
          {
            "name": "Standard Name",
            "organization": "Sponsoring Organization",
            "description": "Brief description of standard",
            "url": "Link to standard documentation",
            "relevance": "How this standard supports the SDG"
          }
        ],
        "agencyServices": [
          {
            "agencyDomain": "usda.us.gov-ai.co",
            "services": [
              { "name": "Agricultural Programs", "desc": "Farming and food support", "status": 1, "url": "https://agriculturalprograms.usda.us.gov-ai.co" },
              { "name": "Farm Service Agency", "desc": "Support for farmers", "status": 1, "url": "https://fsfa.usda.us.gov-ai.co" }
            ]
          },
          {
            "agencyDomain": "cnpp.ai",
            "services": [
              { "name": "Nutrition Policy and Programs", "desc": "AI-powered nutrition policy and programs to prevent malnutrition", "status": 1, "url": "https://cnpp.ai" }
            ]
          },
          {
            "agencyDomain": "cfsan.ai",
            "services": [
              { "name": "Food Safety and Nutrition", "desc": "AI-driven approach for food safety to reduce recalls and improve nutrition", "status": 1, "url": "https://cfsan.ai" }
            ]
          },
          {
            "agencyDomain": "fda.us.gov-ai.co",
            "services": [
              { "name": "CFSAN", "desc": "Center for Food Safety and Applied Nutrition", "status": 1, "url": "https://cfsan.fda.us.gov-ai.co" }
            ]
          }
        ]
      },
      {
        "id": 6,
        "title": "Clean Water and Sanitation - Ensure Water and Sanitation for All",
        "text": "Guarantee universal access to safe and affordable drinking water, as well as sustainable management of water resources, sanitation, and hygiene facilities.",
        "fullDescription": "The SDGs can only be realized with strong global partnerships and cooperation. Official Development Assistance remained steady but below target, at US$147 billion in 2017. While humanitarian crises brought on by conflict or natural disasters continue to demand more financial resources and aid. Many countries also require Official Development Assistance to encourage growth and trade. The world is more interconnected than ever. Improving access to technology and knowledge is an important way to share ideas and foster innovation. Coordinating policies to help developing countries manage their debt, as well as promoting investment for the least developed, is vital for sustainable growth and development. The goals aim to enhance North-South and South-South cooperation by supporting national plans to achieve all the targets. Promoting international trade, and helping developing countries increase their exports is all part of achieving a universal rules-based and equitable trading system that is fair and open and benefits all.",
        "statistics": [
          {"value": "$5 trillion", "description": "The UN Conference on Trade and Development (UNCTAD) says achieving SDGs will require US$5 trillion to $7 trillion in annual investment."},
          {"value": "$147.2 billion", "description": "Total official development assistance reached US$147.2 billion in 2017."},
          {"value": "$613 billion", "description": "In 2017, international remittances totaled US$613 billion; 76 percent of it went to developing countries."},
          {"value": "6 countries", "description": "In 2016, 6 countries met the international target to keep official development assistance at or above 0.7 percent of gross national income."},
          {"value": "$18.2 trillion", "description": "Sustainable and responsible investments represent high-potential sources of capital for SDGs. As of 2016, US$18.2 trillion was invested in this asset class."},
          {"value": "$155.5 billion", "description": "The bond market for sustainable business is growing. In 2018 global green bonds reached US$155.5billion, up 78 percent from previous year."}
        ],
        "targets": {
          "finance": [
            "Strengthen domestic resource mobilization, including through international support to developing countries, to improve domestic capacity for tax and other revenue collection",
            "Developed countries to implement fully their official development assistance commitments, including the commitment by many developed countries to achieve the target of 0.7 per cent of ODA/GNI to developing countries and 0.15 to 0.20 per cent of ODA/GNI to least developed countries ODA providers are encouraged to consider setting a target to provide at least 0.20 per cent of ODA/GNI to least developed countries",
            "Mobilize additional financial resources for developing countries from multiple sources",
            "Assist developing countries in attaining long-term debt sustainability through coordinated policies aimed at fostering debt financing, debt relief and debt restructuring, as appropriate, and address the external debt of highly indebted poor countries to reduce debt distress",
            "Adopt and implement investment promotion regimes for least developed countries"
          ],
          "technology": [
            "Enhance North-South, South-South and triangular regional and international cooperation on and access to science, technology and innovation and enhance knowledge sharing on mutually agreed terms, including through improved coordination among existing mechanisms, in particular at the United Nations level, and through a global technology facilitation mechanism",
            "Promote the development, transfer, dissemination and diffusion of environmentally sound technologies to developing countries on favourable terms, including on concessional and preferential terms, as mutually agreed",
            "Fully operationalize the technology bank and science, technology and innovation capacity-building mechanism for least developed countries by 2017 and enhance the use of enabling technology, in particular information and communications technology"
          ],
          "capacityBuilding": [
            "Enhance international support for implementing effective and targeted capacity-building in developing countries to support national plans to implement all the sustainable development goals, including through North-South, South-South and triangular cooperation"
          ],
          "trade": [
            "Promote a universal, rules-based, open, non-discriminatory and equitable multilateral trading system under the World Trade Organization, including through the conclusion of negotiations under its Doha Development Agenda",
            "Significantly increase the exports of developing countries, in particular with a view to doubling the least developed countries' share of global exports by 2020",
            "Realize timely implementation of duty-free and quota-free market access on a lasting basis for all least developed countries, consistent with World Trade Organization decisions, including by ensuring that preferential rules of origin applicable to imports from least developed countries are transparent and simple, and contribute to facilitating market access"
          ],
          "systemicIssues": {
            "policyAndInstitutionalCoherence": [
              "Enhance global macroeconomic stability, including through policy coordination and policy coherence",
              "Enhance policy coherence for sustainable development",
              "Respect each country's policy space and leadership to establish and implement policies for poverty eradication and sustainable development"
            ],
            "multiStakeholderPartnerships": [
              "Enhance the global partnership for sustainable development, complemented by multi-stakeholder partnerships that mobilize and share knowledge, expertise, technology and financial resources, to support the achievement of the sustainable development goals in all countries, in particular developing countries",
              "Encourage and promote effective public, public-private and civil society partnerships, building on the experience and resourcing strategies of partnerships"
            ],
            "dataMonitoringAndAccountability": [
              "By 2020, enhance capacity-building support to developing countries, including for least developed countries and small island developing States, to increase significantly the availability of high-quality, timely and reliable data disaggregated by income, gender, age, race, ethnicity, migratory status, disability, geographic location and other characteristics relevant in national contexts",
              "By 2030, build on existing initiatives to develop measurements of progress on sustainable development that complement gross domestic product, and support statistical capacity-building in developing countries"
            ]
          }
        },
        "relatedContent": [
          {"type": "story", "title": "Despite conflict, resilience remains", "link": "/stories/despite-conflict-resilience-remains"},
          {"type": "blog", "title": "Bringing everyone to the table", "link": "/blog/bringing-everyone-to-the-table"},
          {"type": "blog", "title": "UNDP core funding: Powering sustainable development", "link": "/blog/undp-core-funding-powering-sustainable-development"},
          {"type": "blog", "title": "Breaking barriers for all women", "link": "/blog/breaking-barriers-for-all-women"},
          {"type": "blog", "title": "Women leading crisis recovery and prevention", "link": "/blog/women-leading-crisis-recovery-and-prevention"},
          {"type": "story", "title": "Botas Violeta / Purple Boots", "link": "/stories/botas-violeta-purple-boots"}
        ],
        "targetCount": 8,
        "eventCount": 300,
        "publicationCount": 37,
        "actionCount": 1835,
        "backgroundImage": "/themes/custom/porto/assets/goals/images/img-goal-6.jpg",
        "icon": "/sites/default/files/goals/E_SDG_Icons-06.jpg",
        "resources": {
          "pdfWhyItMatters": "/goal_6/6_Why-It-Matters-2020.pdf",
          "gifMakeEveryDayCount": "/goal_6/6_SDG_MakeEveryDayCount_Gifs_GDU.gif",
          "gifIcon": "/goal_6/E_GIF_06.gif",
          "actionCardSquare": "/goal_6/E_SDG_action_card_square_6.jpg",
          "actionCardTwitter": "/goal_6/E_SDG_action_card_twitter_6.jpg",
          "webInverted": "/goal_6/E_WEB_INVERTED_06.png",
          "printFile": "/goal_6/E_PRINT_06.jpg",
          "printInvertedFile": "/goal_6/E_PRINT_INVERTED_06.jpg",
          "webImage": "/goal_6/E_WEB_06.png",
          "infographics": "/goal_6/E_infographics_06.pdf",
          "elyxImage": "/goal_6/E_Elyx_06.png",
          "languagesImage": "/goal_6/Languages_06.png"
        },
        "kpis": [
          {
            "name": "Access to Safely Managed Drinking Water",
            "definition": "Percentage of population with safely managed water services.",
            "measurementExample": "Track household connections or improved water sources meeting quality standards."
          },
          {
            "name": "Access to Safely Managed Sanitation",
            "definition": "Percentage of population with safely managed sanitation services.",
            "measurementExample": "Monitor coverage of toilets, sewage systems, or latrines conforming to safe practices."
          },
          {
            "name": "Water Quality Index",
            "definition": "Proportion of water bodies with acceptable physical, chemical, and biological parameters.",
            "measurementExample": "Regularly sample rivers, lakes, and groundwater for key pollutants."
          }
        ],
        "usAgencyContributions": {
          "relevantAgencies": [
            "Environmental Protection Agency (EPA)",
            "United States Army Corps of Engineers (USACE)",
            "Department of the Interior (DOI)",
            "United States Agency for International Development (USAID)",
            "Centers for Disease Control and Prevention (CDC)",
            "United States Congress (Water Infrastructure Legislation, Budget Appropriations)"
          ],
          "explanation": "These agencies collaborate on water security and sanitation. EPA sets and enforces national drinking water standards and wastewater regulations, also advancing new rules against PFAS and microplastics. The USACE constructs water infrastructure projects for flood control and dam safety—major in an era of climate extremes. DOI manages water resources (via Bureau of Reclamation and USGS) and invests in watershed restoration. USAID leads WASH programs internationally, aligning with global calls from COP28 for water resilience in developing countries. The CDC provides expertise on waterborne disease and global outbreaks. Meanwhile, the U.S. Congress funds large-scale water projects (e.g., Water Resources Development Act) to support domestic resource management and sanitation initiatives, plus overseas contributions for global public health."
        },
        "sampleDeals": [
          {
            "dealId": "G6-Deal1",
            "dealTitle": "Urban Water Infrastructure Upgrade",
            "dealSteps": {
              "step1_defineProblem": "A major city faces unsafe lead levels in drinking water due to aging pipes.",
              "step2_codifySolution": "Coordinate with EPA and USACE to replace lead service lines, with partial funding from Congress via a water infrastructure bill.",
              "step3_setupProgram": {
                "stakeholders": [
                  "EPA (enforcing standards, providing technical guidance)",
                  "USACE (infrastructure planning)",
                  "City utilities department (implementation)",
                  "CDC (monitor public health outcomes)"
                ],
                "financing": "Federal + city cost-sharing grants; state revolving funds for water improvements",
                "milestones": "Replace 80% of lead lines in 2 years; confirm water quality meets EPA guidelines"
              },
              "step4_executeProgram": "City executes line replacements, USACE provides engineering support, EPA audits compliance.",
              "step5_verifyOutcomeAndDistributeFunds": "Post-replacement tests confirm safe lead levels. If successful, finalize federal reimbursement and expand program to suburban areas."
            }
          }
        ],
        "relevantStandards": [
          {
            "name": "Standard Name",
            "organization": "Sponsoring Organization",
            "description": "Brief description of standard",
            "url": "Link to standard documentation",
            "relevance": "How this standard supports the SDG"
          }
        ],
        "agencyServices": [
          {
            "agencyDomain": "hud.us.gov-ai.co",
            "services": [
              { "name": "Housing Assistance", "desc": "Affordable housing programs", "status": 1, "url": "https://housingassistance.hud.us.gov-ai.co" }
            ]
          },
          {
            "agencyDomain": "dot.us.gov-ai.co",
            "services": [
              { "name": "Transportation Infrastructure", "desc": "Roadways and transit", "status": 1, "url": "https://transportationinfrastructure.dot.us.gov-ai.co" },
              { "name": "FAA", "desc": "Aviation safety and regulation", "status": 1, "url": "https://faa.dot.us.gov-ai.co" }
            ]
          },
          {
            "agencyDomain": "usich.us.gov-ai.co",
            "services": [
              { "name": "Homelessness Programs", "desc": "Ending homelessness", "status": 1, "url": "https://usps.usich.us.gov-ai.co" }
            ]
          }
        ]
      },
      {
        "id": 7,
        "title": "Affordable and Clean Energy - Expand Access to Sustainable Energy",
        "text": "Promote reliable, affordable, and modern energy for all, while increasing the share of renewable sources and improving energy efficiency worldwide.",
        "fullDescription": "The SDGs can only be realized with strong global partnerships and cooperation. Official Development Assistance remained steady but below target, at US$147 billion in 2017. While humanitarian crises brought on by conflict or natural disasters continue to demand more financial resources and aid. Many countries also require Official Development Assistance to encourage growth and trade. The world is more interconnected than ever. Improving access to technology and knowledge is an important way to share ideas and foster innovation. Coordinating policies to help developing countries manage their debt, as well as promoting investment for the least developed, is vital for sustainable growth and development. The goals aim to enhance North-South and South-South cooperation by supporting national plans to achieve all the targets. Promoting international trade, and helping developing countries increase their exports is all part of achieving a universal rules-based and equitable trading system that is fair and open and benefits all.",
        "statistics": [
          {"value": "$5 trillion", "description": "The UN Conference on Trade and Development (UNCTAD) says achieving SDGs will require US$5 trillion to $7 trillion in annual investment."},
          {"value": "$147.2 billion", "description": "Total official development assistance reached US$147.2 billion in 2017."},
          {"value": "$613 billion", "description": "In 2017, international remittances totaled US$613 billion; 76 percent of it went to developing countries."},
          {"value": "6 countries", "description": "In 2016, 6 countries met the international target to keep official development assistance at or above 0.7 percent of gross national income."},
          {"value": "$18.2 trillion", "description": "Sustainable and responsible investments represent high-potential sources of capital for SDGs. As of 2016, US$18.2 trillion was invested in this asset class."},
          {"value": "$155.5 billion", "description": "The bond market for sustainable business is growing. In 2018 global green bonds reached US$155.5billion, up 78 percent from previous year."}
        ],
        "targets": {
          "finance": [
            "Strengthen domestic resource mobilization, including through international support to developing countries, to improve domestic capacity for tax and other revenue collection",
            "Developed countries to implement fully their official development assistance commitments, including the commitment by many developed countries to achieve the target of 0.7 per cent of ODA/GNI to developing countries and 0.15 to 0.20 per cent of ODA/GNI to least developed countries ODA providers are encouraged to consider setting a target to provide at least 0.20 per cent of ODA/GNI to least developed countries",
            "Mobilize additional financial resources for developing countries from multiple sources",
            "Assist developing countries in attaining long-term debt sustainability through coordinated policies aimed at fostering debt financing, debt relief and debt restructuring, as appropriate, and address the external debt of highly indebted poor countries to reduce debt distress",
            "Adopt and implement investment promotion regimes for least developed countries"
          ],
          "technology": [
            "Enhance North-South, South-South and triangular regional and international cooperation on and access to science, technology and innovation and enhance knowledge sharing on mutually agreed terms, including through improved coordination among existing mechanisms, in particular at the United Nations level, and through a global technology facilitation mechanism",
            "Promote the development, transfer, dissemination and diffusion of environmentally sound technologies to developing countries on favourable terms, including on concessional and preferential terms, as mutually agreed",
            "Fully operationalize the technology bank and science, technology and innovation capacity-building mechanism for least developed countries by 2017 and enhance the use of enabling technology, in particular information and communications technology"
          ],
          "capacityBuilding": [
            "Enhance international support for implementing effective and targeted capacity-building in developing countries to support national plans to implement all the sustainable development goals, including through North-South, South-South and triangular cooperation"
          ],
          "trade": [
            "Promote a universal, rules-based, open, non-discriminatory and equitable multilateral trading system under the World Trade Organization, including through the conclusion of negotiations under its Doha Development Agenda",
            "Significantly increase the exports of developing countries, in particular with a view to doubling the least developed countries' share of global exports by 2020",
            "Realize timely implementation of duty-free and quota-free market access on a lasting basis for all least developed countries, consistent with World Trade Organization decisions, including by ensuring that preferential rules of origin applicable to imports from least developed countries are transparent and simple, and contribute to facilitating market access"
          ],
          "systemicIssues": {
            "policyAndInstitutionalCoherence": [
              "Enhance global macroeconomic stability, including through policy coordination and policy coherence",
              "Enhance policy coherence for sustainable development",
              "Respect each country's policy space and leadership to establish and implement policies for poverty eradication and sustainable development"
            ],
            "multiStakeholderPartnerships": [
              "Enhance the global partnership for sustainable development, complemented by multi-stakeholder partnerships that mobilize and share knowledge, expertise, technology and financial resources, to support the achievement of the sustainable development goals in all countries, in particular developing countries",
              "Encourage and promote effective public, public-private and civil society partnerships, building on the experience and resourcing strategies of partnerships"
            ],
            "dataMonitoringAndAccountability": [
              "By 2020, enhance capacity-building support to developing countries, including for least developed countries and small island developing States, to increase significantly the availability of high-quality, timely and reliable data disaggregated by income, gender, age, race, ethnicity, migratory status, disability, geographic location and other characteristics relevant in national contexts",
              "By 2030, build on existing initiatives to develop measurements of progress on sustainable development that complement gross domestic product, and support statistical capacity-building in developing countries"
            ]
          }
        },
        "relatedContent": [
          {"type": "story", "title": "Despite conflict, resilience remains", "link": "/stories/despite-conflict-resilience-remains"},
          {"type": "blog", "title": "Bringing everyone to the table", "link": "/blog/bringing-everyone-to-the-table"},
          {"type": "blog", "title": "UNDP core funding: Powering sustainable development", "link": "/blog/undp-core-funding-powering-sustainable-development"},
          {"type": "blog", "title": "Breaking barriers for all women", "link": "/blog/breaking-barriers-for-all-women"},
          {"type": "blog", "title": "Women leading crisis recovery and prevention", "link": "/blog/women-leading-crisis-recovery-and-prevention"},
          {"type": "story", "title": "Botas Violeta / Purple Boots", "link": "/stories/botas-violeta-purple-boots"}
        ],
        "targetCount": 5,
        "eventCount": 86,
        "publicationCount": 46,
        "actionCount": 1062,
        "backgroundImage": "/themes/custom/porto/assets/goals/images/img-goal-7.jpg",
        "icon": "/sites/default/files/goals/E_SDG_Icons-07.jpg",
        "resources": {
          "pdfWhyItMatters": "/goal_7/7_Why-It-Matters-2020.pdf",
          "gifMakeEveryDayCount": "/goal_7/7_SDG_MakeEveryDayCount_Gifs_GDU.gif",
          "gifIcon": "/goal_7/E_GIF_07.gif",
          "actionCardSquare": "/goal_7/E_SDG_action_card_square_7.jpg",
          "actionCardTwitter": "/goal_7/E_SDG_action_card_twitter_7.jpg",
          "webInverted": "/goal_7/E_WEB_INVERTED_07.png",
          "printFile": "/goal_7/E_PRINT_07.jpg",
          "printInvertedFile": "/goal_7/E_PRINT_INVERTED_07.jpg",
          "webImage": "/goal_7/E_WEB_07.png",
          "infographics": "/goal_7/E_infographics_07.pdf",
          "elyxImage": "/goal_7/E_Elyx_07.png",
          "languagesImage": "/goal_7/Languages_07.png"
        },
        "kpis": [
          {
            "name": "Electricity Access Rate",
            "definition": "Percentage of the population with access to electricity.",
            "measurementExample": "Compare grid connection data to census population figures."
          },
          {
            "name": "Renewable Energy Share",
            "definition": "Proportion of total energy consumption sourced from renewables.",
            "measurementExample": "Track electricity generation by solar, wind, hydro, or biomass relative to total consumption."
          },
          {
            "name": "Energy Efficiency Improvement",
            "definition": "Rate of change in energy intensity (energy used per unit GDP).",
            "measurementExample": "Compute total energy consumption relative to GDP and track year-over-year."
          }
        ],
        "usAgencyContributions": {
          "relevantAgencies": [
            "Department of Energy (DOE)",
            "Environmental Protection Agency (EPA)",
            "Department of the Interior (DOI)",
            "United States Agency for International Development (USAID)",
            "Department of Commerce (DOC)",
            "United States Congress (Energy & Environment Committees, Budget Appropriations)"
          ],
          "explanation": "These agencies drive the U.S. energy transformation. DOE leads research in renewables, advanced batteries, and grid modernization, fulfilling pledges under the Global Methane Pledge and COP28. EPA regulates power plant emissions and energy efficiency programs like ENERGY STAR. DOI manages renewable energy projects on public lands and offshore sites, consistent with the global push to reduce dependence on fossil fuels. USAID's Power Africa expands electricity access in developing nations. DOC helps develop standards for energy technologies, fosters green tech businesses and exports. U.S. Congress passes legislation like the Inflation Reduction Act, invests in new energy infrastructure, and shapes incentives (e.g., tax credits) to achieve net-zero goals aligned with 1.5°C targets from the IPCC."
        },
        "sampleDeals": [
          {
            "dealId": "G7-Deal1",
            "dealTitle": "Rural Solar Microgrids Partnership",
            "dealSteps": {
              "step1_defineProblem": "Remote towns lack reliable electricity, relying on costly diesel generators.",
              "step2_codifySolution": "Develop solar microgrids through DOE research grants, with private sector co-funding for panels and battery storage.",
              "step3_setupProgram": {
                "stakeholders": [
                  "DOE (funding + technical guidance)",
                  "Private solar firms (install + maintain microgrids)",
                  "Local cooperatives (own/operate the microgrids)",
                  "EPA (environmental standards compliance)"
                ],
                "financing": "Federal grants, private investment, potential tax credits from Congress",
                "milestones": "Install 50 microgrids within 18 months; track energy cost reduction vs diesel"
              },
              "step4_executeProgram": "Companies procure panels and batteries, local cooperatives manage distribution, DOE oversees pilot metrics.",
              "step5_verifyOutcomeAndDistributeFunds": "Check reliability metrics and cost savings. If targets are met, finalize cost-share reimbursements and expand regionally."
            }
          }
        ],
        "relevantStandards": [
          {
            "name": "Standard Name",
            "organization": "Sponsoring Organization",
            "description": "Brief description of standard",
            "url": "Link to standard documentation",
            "relevance": "How this standard supports the SDG"
          }
        ],
        "agencyServices": [
          {
            "agencyDomain": "doe.us.gov-ai.co",
            "services": [
              { "name": "EERE", "desc": "Renewable energy", "status": 2, "url": "https://eere.doe.us.gov-ai.co" }
            ]
          },
          {
            "agencyDomain": "ferc.us.gov-ai.co",
            "services": [
              { "name": "FERC", "desc": "Federal Energy Regulatory Commission", "status": 1, "url": "https://ferc.us.gov-ai.co" }
            ]
          }
        ]
      },
      {
        "id": 8,
        "title": "Decent Work and Economic Growth - Foster Inclusive Economic Development",
        "text": "Support sustained, inclusive, and sustainable economic growth by creating decent jobs, ensuring fair labor practices, and promoting entrepreneurial opportunities for all.",
        "fullDescription": "The SDGs can only be realized with strong global partnerships and cooperation. Official Development Assistance remained steady but below target, at US$147 billion in 2017. While humanitarian crises brought on by conflict or natural disasters continue to demand more financial resources and aid. Many countries also require Official Development Assistance to encourage growth and trade. The world is more interconnected than ever. Improving access to technology and knowledge is an important way to share ideas and foster innovation. Coordinating policies to help developing countries manage their debt, as well as promoting investment for the least developed, is vital for sustainable growth and development. The goals aim to enhance North-South and South-South cooperation by supporting national plans to achieve all the targets. Promoting international trade, and helping developing countries increase their exports is all part of achieving a universal rules-based and equitable trading system that is fair and open and benefits all.",
        "statistics": [
          {"value": "$5 trillion", "description": "The UN Conference on Trade and Development (UNCTAD) says achieving SDGs will require US$5 trillion to $7 trillion in annual investment."},
          {"value": "$147.2 billion", "description": "Total official development assistance reached US$147.2 billion in 2017."},
          {"value": "$613 billion", "description": "In 2017, international remittances totaled US$613 billion; 76 percent of it went to developing countries."},
          {"value": "6 countries", "description": "In 2016, 6 countries met the international target to keep official development assistance at or above 0.7 percent of gross national income."},
          {"value": "$18.2 trillion", "description": "Sustainable and responsible investments represent high-potential sources of capital for SDGs. As of 2016, US$18.2 trillion was invested in this asset class."},
          {"value": "$155.5 billion", "description": "The bond market for sustainable business is growing. In 2018 global green bonds reached US$155.5billion, up 78 percent from previous year."}
        ],
        "targets": {
          "finance": [
            "Strengthen domestic resource mobilization, including through international support to developing countries, to improve domestic capacity for tax and other revenue collection",
            "Developed countries to implement fully their official development assistance commitments, including the commitment by many developed countries to achieve the target of 0.7 per cent of ODA/GNI to developing countries and 0.15 to 0.20 per cent of ODA/GNI to least developed countries ODA providers are encouraged to consider setting a target to provide at least 0.20 per cent of ODA/GNI to least developed countries",
            "Mobilize additional financial resources for developing countries from multiple sources",
            "Assist developing countries in attaining long-term debt sustainability through coordinated policies aimed at fostering debt financing, debt relief and debt restructuring, as appropriate, and address the external debt of highly indebted poor countries to reduce debt distress",
            "Adopt and implement investment promotion regimes for least developed countries"
          ],
          "technology": [
            "Enhance North-South, South-South and triangular regional and international cooperation on and access to science, technology and innovation and enhance knowledge sharing on mutually agreed terms, including through improved coordination among existing mechanisms, in particular at the United Nations level, and through a global technology facilitation mechanism",
            "Promote the development, transfer, dissemination and diffusion of environmentally sound technologies to developing countries on favourable terms, including on concessional and preferential terms, as mutually agreed",
            "Fully operationalize the technology bank and science, technology and innovation capacity-building mechanism for least developed countries by 2017 and enhance the use of enabling technology, in particular information and communications technology"
          ],
          "capacityBuilding": [
            "Enhance international support for implementing effective and targeted capacity-building in developing countries to support national plans to implement all the sustainable development goals, including through North-South, South-South and triangular cooperation"
          ],
          "trade": [
            "Promote a universal, rules-based, open, non-discriminatory and equitable multilateral trading system under the World Trade Organization, including through the conclusion of negotiations under its Doha Development Agenda",
            "Significantly increase the exports of developing countries, in particular with a view to doubling the least developed countries' share of global exports by 2020",
            "Realize timely implementation of duty-free and quota-free market access on a lasting basis for all least developed countries, consistent with World Trade Organization decisions, including by ensuring that preferential rules of origin applicable to imports from least developed countries are transparent and simple, and contribute to facilitating market access"
          ],
          "systemicIssues": {
            "policyAndInstitutionalCoherence": [
              "Enhance global macroeconomic stability, including through policy coordination and policy coherence",
              "Enhance policy coherence for sustainable development",
              "Respect each country's policy space and leadership to establish and implement policies for poverty eradication and sustainable development"
            ],
            "multiStakeholderPartnerships": [
              "Enhance the global partnership for sustainable development, complemented by multi-stakeholder partnerships that mobilize and share knowledge, expertise, technology and financial resources, to support the achievement of the sustainable development goals in all countries, in particular developing countries",
              "Encourage and promote effective public, public-private and civil society partnerships, building on the experience and resourcing strategies of partnerships"
            ],
            "dataMonitoringAndAccountability": [
              "By 2020, enhance capacity-building support to developing countries, including for least developed countries and small island developing States, to increase significantly the availability of high-quality, timely and reliable data disaggregated by income, gender, age, race, ethnicity, migratory status, disability, geographic location and other characteristics relevant in national contexts",
              "By 2030, build on existing initiatives to develop measurements of progress on sustainable development that complement gross domestic product, and support statistical capacity-building in developing countries"
            ]
          }
        },
        "relatedContent": [
          {"type": "story", "title": "Despite conflict, resilience remains", "link": "/stories/despite-conflict-resilience-remains"},
          {"type": "blog", "title": "Bringing everyone to the table", "link": "/blog/bringing-everyone-to-the-table"},
          {"type": "blog", "title": "UNDP core funding: Powering sustainable development", "link": "/blog/undp-core-funding-powering-sustainable-development"},
          {"type": "blog", "title": "Breaking barriers for all women", "link": "/blog/breaking-barriers-for-all-women"},
          {"type": "blog", "title": "Women leading crisis recovery and prevention", "link": "/blog/women-leading-crisis-recovery-and-prevention"},
          {"type": "story", "title": "Botas Violeta / Purple Boots", "link": "/stories/botas-violeta-purple-boots"}
        ],
        "targetCount": 12,
        "eventCount": 122,
        "publicationCount": 50,
        "actionCount": 1976,
        "backgroundImage": "/themes/custom/porto/assets/goals/images/img-goal-8.jpg",
        "icon": "/sites/default/files/goals/E_SDG_Icons-08.jpg",
        "resources": {
          "pdfWhyItMatters": "/goal_8/8_Why-It-Matters-2020.pdf",
          "gifMakeEveryDayCount": "/goal_8/8_SDG_MakeEveryDayCount_Gifs_GDU.gif",
          "gifIcon": "/goal_8/E_GIF_08.gif",
          "actionCardSquare": "/goal_8/E_SDG_action_card_square_8.jpg",
          "actionCardTwitter": "/goal_8/E_SDG_action_card_twitter_8.jpg",
          "webInverted": "/goal_8/E_WEB_INVERTED_08.png",
          "printFile": "/goal_8/E_PRINT_08.jpg",
          "printInvertedFile": "/goal_8/E_PRINT_INVERTED_08.jpg",
          "webImage": "/goal_8/E_WEB_08.png",
          "infographics": "/goal_8/E_infographics_08.pdf",
          "elyxImage": "/goal_8/E_Elyx_08.png",
          "languagesImage": "/goal_8/Languages_08.png"
        },
        "kpis": [
          {
            "name": "Unemployment Rate",
            "definition": "Percentage of the labor force without work but seeking employment.",
            "measurementExample": "Compare labor force surveys and census data."
          },
          {
            "name": "Youth NEET Rate",
            "definition": "Proportion of youth aged 15–24 not in education, employment, or training.",
            "measurementExample": "Use national youth surveys to identify those who are neither studying nor working."
          },
          {
            "name": "GDP Growth Rate",
            "definition": "Annual percentage growth in gross domestic product.",
            "measurementExample": "Analyze official national accounts data and compare year-on-year changes."
          }
        ],
        "usAgencyContributions": {
          "relevantAgencies": [
            "Department of Labor (DOL)",
            "Department of Commerce (DOC)",
            "Small Business Administration (SBA)",
            "Department of the Treasury (USDT)",
            "United States Trade and Development Agency (USTDA)",
            "United States Congress (Financial Services, Banking, Labor Committees, Budget Appropriations)"
          ],
          "explanation": "These agencies support robust economic development and employment. DOL enforces labor standards and administers workforce development programs crucial to navigating AI-driven automation. DOC promotes trade, innovation, and growth, helping shape advanced tech policies (e.g., microchip manufacturing). The SBA fuels entrepreneurship and job creation by providing loans and counseling to small businesses. Treasury shapes fiscal policy, promoting stable growth, monitors global financial markets in coordination with international commitments (e.g., G20). USTDA fosters U.S. exports in emerging markets while encouraging sustainable infrastructure abroad, aligning with a just transition from fossil fuels. U.S. Congress oversees the legislative frameworks, from minimum wage to AI workforce readiness—critical for future structural changes in labor markets."
        },
        "sampleDeals": [
          {
            "dealId": "G8-Deal1",
            "dealTitle": "AI-Ready Workforce Training",
            "dealSteps": {
              "step1_defineProblem": "Many displaced workers lack digital skills to transition into AI-driven industries, raising unemployment rates.",
              "step2_codifySolution": "Create a DOL-led retraining program for AI + robotics in collaboration with tech firms and community colleges.",
              "step3_setupProgram": {
                "stakeholders": [
                  "DOL (funding + administration)",
                  "DOC (identifying growth sectors)",
                  "SBA (supporting tech startups that hire trainees)",
                  "Community colleges (curriculum development)"
                ],
                "financing": "DOL workforce grants + private sector matching funds, potential tax benefits from Treasury",
                "milestones": "Train 100,000 workers in AI-related fields over 2 years; measure job placement rates"
              },
              "step4_executeProgram": "Launch specialized courses, partner with local employers for internships, coordinate job fairs.",
              "step5_verifyOutcomeAndDistributeFunds": "If job placement targets hit 75% or higher, disburse final grant payments to training providers."
            }
          }
        ],
        "relevantStandards": [
          {
            "name": "Standard Name",
            "organization": "Sponsoring Organization",
            "description": "Brief description of standard",
            "url": "Link to standard documentation",
            "relevance": "How this standard supports the SDG"
          }
        ],
        "agencyServices": [
          {
            "agencyDomain": "usda.us.gov-ai.co",
            "services": [
              { "name": "Agricultural Programs", "desc": "Farming and food support", "status": 1, "url": "https://agriculturalprograms.usda.us.gov-ai.co" },
              { "name": "Farm Service Agency", "desc": "Support for farmers", "status": 1, "url": "https://fsfa.usda.us.gov-ai.co" }
            ]
          },
          {
            "agencyDomain": "cnpp.ai",
            "services": [
              { "name": "Nutrition Policy and Programs", "desc": "AI-powered nutrition policy and programs to prevent malnutrition", "status": 1, "url": "https://cnpp.ai" }
            ]
          },
          {
            "agencyDomain": "cfsan.ai",
            "services": [
              { "name": "Food Safety and Nutrition", "desc": "AI-driven approach for food safety to reduce recalls and improve nutrition", "status": 1, "url": "https://cfsan.ai" }
            ]
          },
          {
            "agencyDomain": "fda.us.gov-ai.co",
            "services": [
              { "name": "CFSAN", "desc": "Center for Food Safety and Applied Nutrition", "status": 1, "url": "https://cfsan.fda.us.gov-ai.co" }
            ]
          }
        ]
      },
      {
        "id": 9,
        "title": "Industry, Innovation and Infrastructure - Advance Inclusive Industrialization",
        "text": "Build resilient infrastructure, foster innovative solutions, and promote sustainable industrialization to drive economic growth, job creation, and technology access for all.",
        "fullDescription": "The SDGs can only be realized with strong global partnerships and cooperation. Official Development Assistance remained steady but below target, at US$147 billion in 2017. While humanitarian crises brought on by conflict or natural disasters continue to demand more financial resources and aid. Many countries also require Official Development Assistance to encourage growth and trade. The world is more interconnected than ever. Improving access to technology and knowledge is an important way to share ideas and foster innovation. Coordinating policies to help developing countries manage their debt, as well as promoting investment for the least developed, is vital for sustainable growth and development. The goals aim to enhance North-South and South-South cooperation by supporting national plans to achieve all the targets. Promoting international trade, and helping developing countries increase their exports is all part of achieving a universal rules-based and equitable trading system that is fair and open and benefits all.",
        "statistics": [
          {"value": "$5 trillion", "description": "The UN Conference on Trade and Development (UNCTAD) says achieving SDGs will require US$5 trillion to $7 trillion in annual investment."},
          {"value": "$147.2 billion", "description": "Total official development assistance reached US$147.2 billion in 2017."},
          {"value": "$613 billion", "description": "In 2017, international remittances totaled US$613 billion; 76 percent of it went to developing countries."},
          {"value": "6 countries", "description": "In 2016, 6 countries met the international target to keep official development assistance at or above 0.7 percent of gross national income."},
          {"value": "$18.2 trillion", "description": "Sustainable and responsible investments represent high-potential sources of capital for SDGs. As of 2016, US$18.2 trillion was invested in this asset class."},
          {"value": "$155.5 billion", "description": "The bond market for sustainable business is growing. In 2018 global green bonds reached US$155.5billion, up 78 percent from previous year."}
        ],
        "targets": {
          "finance": [
            "Strengthen domestic resource mobilization, including through international support to developing countries, to improve domestic capacity for tax and other revenue collection",
            "Developed countries to implement fully their official development assistance commitments, including the commitment by many developed countries to achieve the target of 0.7 per cent of ODA/GNI to developing countries and 0.15 to 0.20 per cent of ODA/GNI to least developed countries ODA providers are encouraged to consider setting a target to provide at least 0.20 per cent of ODA/GNI to least developed countries",
            "Mobilize additional financial resources for developing countries from multiple sources",
            "Assist developing countries in attaining long-term debt sustainability through coordinated policies aimed at fostering debt financing, debt relief and debt restructuring, as appropriate, and address the external debt of highly indebted poor countries to reduce debt distress",
            "Adopt and implement investment promotion regimes for least developed countries"
          ],
          "technology": [
            "Enhance North-South, South-South and triangular regional and international cooperation on and access to science, technology and innovation and enhance knowledge sharing on mutually agreed terms, including through improved coordination among existing mechanisms, in particular at the United Nations level, and through a global technology facilitation mechanism",
            "Promote the development, transfer, dissemination and diffusion of environmentally sound technologies to developing countries on favourable terms, including on concessional and preferential terms, as mutually agreed",
            "Fully operationalize the technology bank and science, technology and innovation capacity-building mechanism for least developed countries by 2017 and enhance the use of enabling technology, in particular information and communications technology"
          ],
          "capacityBuilding": [
            "Enhance international support for implementing effective and targeted capacity-building in developing countries to support national plans to implement all the sustainable development goals, including through North-South, South-South and triangular cooperation"
          ],
          "trade": [
            "Promote a universal, rules-based, open, non-discriminatory and equitable multilateral trading system under the World Trade Organization, including through the conclusion of negotiations under its Doha Development Agenda",
            "Significantly increase the exports of developing countries, in particular with a view to doubling the least developed countries' share of global exports by 2020",
            "Realize timely implementation of duty-free and quota-free market access on a lasting basis for all least developed countries, consistent with World Trade Organization decisions, including by ensuring that preferential rules of origin applicable to imports from least developed countries are transparent and simple, and contribute to facilitating market access"
          ],
          "systemicIssues": {
            "policyAndInstitutionalCoherence": [
              "Enhance global macroeconomic stability, including through policy coordination and policy coherence",
              "Enhance policy coherence for sustainable development",
              "Respect each country's policy space and leadership to establish and implement policies for poverty eradication and sustainable development"
            ],
            "multiStakeholderPartnerships": [
              "Enhance the global partnership for sustainable development, complemented by multi-stakeholder partnerships that mobilize and share knowledge, expertise, technology and financial resources, to support the achievement of the sustainable development goals in all countries, in particular developing countries",
              "Encourage and promote effective public, public-private and civil society partnerships, building on the experience and resourcing strategies of partnerships"
            ],
            "dataMonitoringAndAccountability": [
              "By 2020, enhance capacity-building support to developing countries, including for least developed countries and small island developing States, to increase significantly the availability of high-quality, timely and reliable data disaggregated by income, gender, age, race, ethnicity, migratory status, disability, geographic location and other characteristics relevant in national contexts",
              "By 2030, build on existing initiatives to develop measurements of progress on sustainable development that complement gross domestic product, and support statistical capacity-building in developing countries"
            ]
          }
        },
        "relatedContent": [
          {"type": "story", "title": "Despite conflict, resilience remains", "link": "/stories/despite-conflict-resilience-remains"},
          {"type": "blog", "title": "Bringing everyone to the table", "link": "/blog/bringing-everyone-to-the-table"},
          {"type": "blog", "title": "UNDP core funding: Powering sustainable development", "link": "/blog/undp-core-funding-powering-sustainable-development"},
          {"type": "blog", "title": "Breaking barriers for all women", "link": "/blog/breaking-barriers-for-all-women"},
          {"type": "blog", "title": "Women leading crisis recovery and prevention", "link": "/blog/women-leading-crisis-recovery-and-prevention"},
          {"type": "story", "title": "Botas Violeta / Purple Boots", "link": "/stories/botas-violeta-purple-boots"}
        ],
        "targetCount": 8,
        "eventCount": 118,
        "publicationCount": 18,
        "actionCount": 1074,
        "backgroundImage": "/themes/custom/porto/assets/goals/images/img-goal-9.jpg",
        "icon": "/sites/default/files/goals/E_SDG_Icons-09.jpg",
        "resources": {
          "pdfWhyItMatters": "/goal_9/9_Why-It-Matters-2020.pdf",
          "gifMakeEveryDayCount": "/goal_9/9_SDG_MakeEveryDayCount_Gifs_GDU.gif",
          "gifIcon": "/goal_9/E_GIF_09.gif",
          "actionCardSquare": "/goal_9/E_SDG_action_card_square_9.jpg",
          "actionCardTwitter": "/goal_9/E_SDG_action_card_twitter_9.jpg",
          "webInverted": "/goal_9/E_WEB_INVERTED_09.png",
          "printFile": "/goal_9/E_PRINT_09.jpg",
          "printInvertedFile": "/goal_9/E_PRINT_INVERTED_09.jpg",
          "webImage": "/goal_9/E_WEB_09.png",
          "infographics": "/goal_9/E_infographics_09.pdf",
          "elyxImage": "/goal_9/E_Elyx_09.png",
          "languagesImage": "/goal_9/Languages_09.png"
        },
        "kpis": [
          {
            "name": "R&D Expenditure as % of GDP",
            "definition": "Spending on research and development divided by total economic output.",
            "measurementExample": "Aggregate R&D budgets from government, academia, and private sector."
          },
          {
            "name": "Access to Mobile/Internet Networks",
            "definition": "Proportion of population covered by at least a 3G network or stable internet connection.",
            "measurementExample": "Compare telecom coverage maps to population distribution data."
          },
          {
            "name": "Manufacturing Value Added (MVA) per Capita",
            "definition": "Contribution of manufacturing to the economy on a per-person basis.",
            "measurementExample": "Use national accounts to calculate MVA and divide by total population."
          }
        ],
        "usAgencyContributions": {
          "relevantAgencies": [
            "Department of Transportation (DOT)",
            "National Science Foundation (NSF)",
            "Department of Commerce (DOC)",
            "Small Business Administration (SBA)",
            "National Aeronautics and Space Administration (NASA)",
            "United States Congress (Infrastructure Committees, Budget Appropriations)"
          ],
          "explanation": "These agencies drive infrastructure development and innovation. DOT oversees transportation systems modernization, crucial as the country invests in EV chargers and advanced rail. NSF funds leading-edge research in AI, quantum computing, and other next technologies to bolster industrial competitiveness. DOC—especially through NIST—supports industrial standards for 5G/6G telecom, advanced manufacturing, and blockchain. The SBA helps innovative small businesses access federal R&D resources, including SBIR/STTR grants. NASA's cutting-edge technologies spill over into civilian sectors, boosting advanced robotics, materials science, and AI. The U.S. Congress provides major infrastructure funding (e.g., bipartisan infrastructure bills), shaping legislation to accelerate green transitions while modernizing roads, ports, broadband, and space infrastructure."
        },
        "sampleDeals": [
          {
            "dealId": "G9-Deal1",
            "dealTitle": "Smart Manufacturing Hub Initiative",
            "dealSteps": {
              "step1_defineProblem": "Regions dependent on old manufacturing plants face closures due to automation and outdated tech, leading to job loss.",
              "step2_codifySolution": "Establish NSF + DOC-funded 'Smart Manufacturing Hubs' to retrain workers and deploy advanced robotics in existing factories.",
              "step3_setupProgram": {
                "stakeholders": [
                  "NSF (research grants)",
                  "DOC / NIST (standards for advanced manufacturing)",
                  "Local manufacturing firms (pilot sites)",
                  "SBA (loans for factory upgrades)"
                ],
                "financing": "Federal R&D grants, low-interest SBA loans, potential state tax incentives",
                "milestones": "Retrofit 5 pilot plants within 1 year; measure productivity + job retention"
              },
              "step4_executeProgram": "Roll out pilot advanced robotics in selected factories, train staff, gather data on productivity.",
              "step5_verifyOutcomeAndDistributeFunds": "If pilot shows a 20% efficiency boost, expand to new sites; finalize SBA loan reimbursements."
            }
          }
        ],
        "relevantStandards": [
          {
            "name": "Standard Name",
            "organization": "Sponsoring Organization",
            "description": "Brief description of standard",
            "url": "Link to standard documentation",
            "relevance": "How this standard supports the SDG"
          }
        ],
        "agencyServices": [
          {
            "agencyDomain": "dot.us.gov-ai.co",
            "services": [
              { "name": "Transportation Infrastructure", "desc": "Roadways and transit", "status": 1, "url": "https://transportationinfrastructure.dot.us.gov-ai.co" }
            ]
          },
          {
            "agencyDomain": "ntsb.ai",
            "services": [
              { "name": "Transportation Safety Board", "desc": "AI-powered oversight to help prevent transportation accidents", "status": 1, "url": "https://ntsb.ai" }
            ]
          },
          {
            "agencyDomain": "doc.us.gov-ai.co",
            "services": [
              { "name": "NIST", "desc": "Standards and technology", "status": 1, "url": "https://nist.doc.us.gov-ai.co" }
            ]
          },
          {
            "agencyDomain": "nasa.us.gov-ai.co",
            "services": [
              { "name": "Aeronautics and Space", "desc": "Space exploration and research", "status": 1, "url": "https://aeronauticsandspace.nasa.us.gov-ai.co" }
            ]
          }
        ]
      },
      {
        "id": 10,
        "title": "Reduced Inequalities - Promote Equality for All",
        "text": "Address social, economic, and political disparities by ensuring inclusive policies and equitable opportunities, regardless of income, gender, race, or ability.",
        "fullDescription": "The SDGs can only be realized with strong global partnerships and cooperation. Official Development Assistance remained steady but below target, at US$147 billion in 2017. While humanitarian crises brought on by conflict or natural disasters continue to demand more financial resources and aid. Many countries also require Official Development Assistance to encourage growth and trade. The world is more interconnected than ever. Improving access to technology and knowledge is an important way to share ideas and foster innovation. Coordinating policies to help developing countries manage their debt, as well as promoting investment for the least developed, is vital for sustainable growth and development. The goals aim to enhance North-South and South-South cooperation by supporting national plans to achieve all the targets. Promoting international trade, and helping developing countries increase their exports is all part of achieving a universal rules-based and equitable trading system that is fair and open and benefits all.",
        "statistics": [
          {"value": "$5 trillion", "description": "The UN Conference on Trade and Development (UNCTAD) says achieving SDGs will require US$5 trillion to $7 trillion in annual investment."},
          {"value": "$147.2 billion", "description": "Total official development assistance reached US$147.2 billion in 2017."},
          {"value": "$613 billion", "description": "In 2017, international remittances totaled US$613 billion; 76 percent of it went to developing countries."},
          {"value": "6 countries", "description": "In 2016, 6 countries met the international target to keep official development assistance at or above 0.7 percent of gross national income."},
          {"value": "$18.2 trillion", "description": "Sustainable and responsible investments represent high-potential sources of capital for SDGs. As of 2016, US$18.2 trillion was invested in this asset class."},
          {"value": "$155.5 billion", "description": "The bond market for sustainable business is growing. In 2018 global green bonds reached US$155.5billion, up 78 percent from previous year."}
        ],
        "targets": {
          "finance": [
            "Strengthen domestic resource mobilization, including through international support to developing countries, to improve domestic capacity for tax and other revenue collection",
            "Developed countries to implement fully their official development assistance commitments, including the commitment by many developed countries to achieve the target of 0.7 per cent of ODA/GNI to developing countries and 0.15 to 0.20 per cent of ODA/GNI to least developed countries ODA providers are encouraged to consider setting a target to provide at least 0.20 per cent of ODA/GNI to least developed countries",
            "Mobilize additional financial resources for developing countries from multiple sources",
            "Assist developing countries in attaining long-term debt sustainability through coordinated policies aimed at fostering debt financing, debt relief and debt restructuring, as appropriate, and address the external debt of highly indebted poor countries to reduce debt distress",
            "Adopt and implement investment promotion regimes for least developed countries"
          ],
          "technology": [
            "Enhance North-South, South-South and triangular regional and international cooperation on and access to science, technology and innovation and enhance knowledge sharing on mutually agreed terms, including through improved coordination among existing mechanisms, in particular at the United Nations level, and through a global technology facilitation mechanism",
            "Promote the development, transfer, dissemination and diffusion of environmentally sound technologies to developing countries on favourable terms, including on concessional and preferential terms, as mutually agreed",
            "Fully operationalize the technology bank and science, technology and innovation capacity-building mechanism for least developed countries by 2017 and enhance the use of enabling technology, in particular information and communications technology"
          ],
          "capacityBuilding": [
            "Enhance international support for implementing effective and targeted capacity-building in developing countries to support national plans to implement all the sustainable development goals, including through North-South, South-South and triangular cooperation"
          ],
          "trade": [
            "Promote a universal, rules-based, open, non-discriminatory and equitable multilateral trading system under the World Trade Organization, including through the conclusion of negotiations under its Doha Development Agenda",
            "Significantly increase the exports of developing countries, in particular with a view to doubling the least developed countries' share of global exports by 2020",
            "Realize timely implementation of duty-free and quota-free market access on a lasting basis for all least developed countries, consistent with World Trade Organization decisions, including by ensuring that preferential rules of origin applicable to imports from least developed countries are transparent and simple, and contribute to facilitating market access"
          ],
          "systemicIssues": {
            "policyAndInstitutionalCoherence": [
              "Enhance global macroeconomic stability, including through policy coordination and policy coherence",
              "Enhance policy coherence for sustainable development",
              "Respect each country's policy space and leadership to establish and implement policies for poverty eradication and sustainable development"
            ],
            "multiStakeholderPartnerships": [
              "Enhance the global partnership for sustainable development, complemented by multi-stakeholder partnerships that mobilize and share knowledge, expertise, technology and financial resources, to support the achievement of the sustainable development goals in all countries, in particular developing countries",
              "Encourage and promote effective public, public-private and civil society partnerships, building on the experience and resourcing strategies of partnerships"
            ],
            "dataMonitoringAndAccountability": [
              "By 2020, enhance capacity-building support to developing countries, including for least developed countries and small island developing States, to increase significantly the availability of high-quality, timely and reliable data disaggregated by income, gender, age, race, ethnicity, migratory status, disability, geographic location and other characteristics relevant in national contexts",
              "By 2030, build on existing initiatives to develop measurements of progress on sustainable development that complement gross domestic product, and support statistical capacity-building in developing countries"
            ]
          }
        },
        "relatedContent": [
          {"type": "story", "title": "Despite conflict, resilience remains", "link": "/stories/despite-conflict-resilience-remains"},
          {"type": "blog", "title": "Bringing everyone to the table", "link": "/blog/bringing-everyone-to-the-table"},
          {"type": "blog", "title": "UNDP core funding: Powering sustainable development", "link": "/blog/undp-core-funding-powering-sustainable-development"},
          {"type": "blog", "title": "Breaking barriers for all women", "link": "/blog/breaking-barriers-for-all-women"},
          {"type": "blog", "title": "Women leading crisis recovery and prevention", "link": "/blog/women-leading-crisis-recovery-and-prevention"},
          {"type": "story", "title": "Botas Violeta / Purple Boots", "link": "/stories/botas-violeta-purple-boots"}
        ],
        "targetCount": 10,
        "eventCount": 97,
        "publicationCount": 15,
        "actionCount": 1014,
        "backgroundImage": "/themes/custom/porto/assets/goals/images/img-goal-10.jpg",
        "icon": "/sites/default/files/goals/E_SDG_Icons-10.jpg",
        "resources": {
          "pdfWhyItMatters": "/goal_10/10_Why-It-Matters-2020.pdf",
          "gifMakeEveryDayCount": "/goal_10/10_SDG_MakeEveryDayCount_Gifs_GDU.gif",
          "gifIcon": "/goal_10/E_GIF_10.gif",
          "actionCardSquare": "/goal_10/E_SDG_action_card_square_10.jpg",
          "actionCardTwitter": "/goal_10/E_SDG_action_card_twitter_10.jpg",
          "webInverted": "/goal_10/E_WEB_INVERTED_10.png",
          "printFile": "/goal_10/E_PRINT_10.jpg",
          "printInvertedFile": "/goal_10/E_PRINT_INVERTED_10.jpg",
          "webImage": "/goal_10/E_WEB_10.png",
          "infographics": "/goal_10/E_infographics_10.pdf",
          "elyxImage": "/goal_10/E_Elyx_10.png",
          "languagesImage": "/goal_10/Languages_10.png"
        },
        "kpis": [
          {
            "name": "Income Share of the Bottom 40%",
            "definition": "Proportion of total national income held by the poorest 40% of households.",
            "measurementExample": "Analyze household surveys or tax data to see how income is distributed."
          },
          {
            "name": "Gini Coefficient",
            "definition": "A measure of income inequality, where 0 = perfect equality and 1 = perfect inequality.",
            "measurementExample": "Calculate the index using population income/consumption distribution data."
          },
          {
            "name": "Inclusion in Public Services",
            "definition": "Extent to which marginalized groups have equitable access to social services.",
            "measurementExample": "Compare usage rates (health, education) by income, ethnicity, or disability status."
          }
        ],
        "usAgencyContributions": {
          "relevantAgencies": [
            "Department of Justice (DOJ)",
            "Equal Employment Opportunity Commission (EEOC)",
            "Department of Housing and Urban Development (HUD)",
            "Department of the Treasury (USDT)",
            "Consumer Financial Protection Bureau (CFPB)",
            "United States Congress (Ways and Means, Housing, Budget Committees)"
          ],
          "explanation": "These agencies tackle inequality along many dimensions. DOJ's Civil Rights Division prosecutes discrimination across employment, housing, and other sectors. EEOC addresses workplace discrimination to ensure more equitable pay and representation. HUD manages fair housing enforcement and inclusive community development. Treasury implements tax policies like Child Tax Credits and invests in Community Development Financial Institutions. The CFPB ensures fair lending and banking practices to avoid predatory treatment of vulnerable populations—especially crucial as national data shows ongoing wealth concentration among the top 1%. The U.S. Congress controls tax reforms, minimum wage legislation, and anti-discrimination funding. All these agencies function within the constitutional frameworks that define what 'federal agency' means—a fluid concept with legislative and judicial clarifications—but together aim to reduce income, wealth, and opportunity gaps."
        },
        "sampleDeals": [
          {
            "dealId": "G10-Deal1",
            "dealTitle": "Inclusive Lending Campaign",
            "dealSteps": {
              "step1_defineProblem": "Low-income communities face denial or high rates on mortgage loans, perpetuating wealth gaps.",
              "step2_codifySolution": "CFPB and Treasury collaborate on new guidelines + tax incentives for banks offering fair lending in disadvantaged zones.",
              "step3_setupProgram": {
                "stakeholders": [
                  "CFPB (regulatory oversight)",
                  "Treasury (tax incentives)",
                  "HUD (identifying target neighborhoods)",
                  "Banks/credit unions (implement inclusive lending policies)"
                ],
                "financing": "Federal tax credits for banks that meet or exceed lending benchmarks",
                "milestones": "Reduce loan denial rates by 30% in targeted neighborhoods over 2 years"
              },
              "step4_executeProgram": "Banks roll out new loan products, HUD shares data on local income levels, CFPB tracks compliance.",
              "step5_verifyOutcomeAndDistributeFunds": "After verifying improved approval rates, apply tax credits to participating banks, revise program for scale-up."
            }
          }
        ],
        "relevantStandards": [
          {
            "name": "Standard Name",
            "organization": "Sponsoring Organization",
            "description": "Brief description of standard",
            "url": "Link to standard documentation",
            "relevance": "How this standard supports the SDG"
          }
        ],
        "agencyServices": [
          {
            "agencyDomain": "usda.us.gov-ai.co",
            "services": [
              { "name": "Agricultural Programs", "desc": "Farming and food support", "status": 1, "url": "https://agriculturalprograms.usda.us.gov-ai.co" },
              { "name": "Farm Service Agency", "desc": "Support for farmers", "status": 1, "url": "https://fsfa.usda.us.gov-ai.co" }
            ]
          },
          {
            "agencyDomain": "cnpp.ai",
            "services": [
              { "name": "Nutrition Policy and Programs", "desc": "AI-powered nutrition policy and programs to prevent malnutrition", "status": 1, "url": "https://cnpp.ai" }
            ]
          },
          {
            "agencyDomain": "cfsan.ai",
            "services": [
              { "name": "Food Safety and Nutrition", "desc": "AI-driven approach for food safety to reduce recalls and improve nutrition", "status": 1, "url": "https://cfsan.ai" }
            ]
          },
          {
            "agencyDomain": "fda.us.gov-ai.co",
            "services": [
              { "name": "CFSAN", "desc": "Center for Food Safety and Applied Nutrition", "status": 1, "url": "https://cfsan.fda.us.gov-ai.co" }
            ]
          }
        ]
      },
      {
        "id": 11,
        "title": "Sustainable Cities and Communities - Build Inclusive, Safe, and Resilient Settlements",
        "text": "Enhance urban planning, provide affordable housing and transport, expand green public spaces, and strengthen resilience to environmental and social challenges.",
        "fullDescription": "The SDGs can only be realized with strong global partnerships and cooperation. Official Development Assistance remained steady but below target, at US$147 billion in 2017. While humanitarian crises brought on by conflict or natural disasters continue to demand more financial resources and aid. Many countries also require Official Development Assistance to encourage growth and trade. The world is more interconnected than ever. Improving access to technology and knowledge is an important way to share ideas and foster innovation. Coordinating policies to help developing countries manage their debt, as well as promoting investment for the least developed, is vital for sustainable growth and development. The goals aim to enhance North-South and South-South cooperation by supporting national plans to achieve all the targets. Promoting international trade, and helping developing countries increase their exports is all part of achieving a universal rules-based and equitable trading system that is fair and open and benefits all.",
        "statistics": [
          {"value": "$5 trillion", "description": "The UN Conference on Trade and Development (UNCTAD) says achieving SDGs will require US$5 trillion to $7 trillion in annual investment."},
          {"value": "$147.2 billion", "description": "Total official development assistance reached US$147.2 billion in 2017."},
          {"value": "$613 billion", "description": "In 2017, international remittances totaled US$613 billion; 76 percent of it went to developing countries."},
          {"value": "6 countries", "description": "In 2016, 6 countries met the international target to keep official development assistance at or above 0.7 percent of gross national income."},
          {"value": "$18.2 trillion", "description": "Sustainable and responsible investments represent high-potential sources of capital for SDGs. As of 2016, US$18.2 trillion was invested in this asset class."},
          {"value": "$155.5 billion", "description": "The bond market for sustainable business is growing. In 2018 global green bonds reached US$155.5billion, up 78 percent from previous year."}
        ],
        "targets": {
          "finance": [
            "Strengthen domestic resource mobilization, including through international support to developing countries, to improve domestic capacity for tax and other revenue collection",
            "Developed countries to implement fully their official development assistance commitments, including the commitment by many developed countries to achieve the target of 0.7 per cent of ODA/GNI to developing countries and 0.15 to 0.20 per cent of ODA/GNI to least developed countries ODA providers are encouraged to consider setting a target to provide at least 0.20 per cent of ODA/GNI to least developed countries",
            "Mobilize additional financial resources for developing countries from multiple sources",
            "Assist developing countries in attaining long-term debt sustainability through coordinated policies aimed at fostering debt financing, debt relief and debt restructuring, as appropriate, and address the external debt of highly indebted poor countries to reduce debt distress",
            "Adopt and implement investment promotion regimes for least developed countries"
          ],
          "technology": [
            "Enhance North-South, South-South and triangular regional and international cooperation on and access to science, technology and innovation and enhance knowledge sharing on mutually agreed terms, including through improved coordination among existing mechanisms, in particular at the United Nations level, and through a global technology facilitation mechanism",
            "Promote the development, transfer, dissemination and diffusion of environmentally sound technologies to developing countries on favourable terms, including on concessional and preferential terms, as mutually agreed",
            "Fully operationalize the technology bank and science, technology and innovation capacity-building mechanism for least developed countries by 2017 and enhance the use of enabling technology, in particular information and communications technology"
          ],
          "capacityBuilding": [
            "Enhance international support for implementing effective and targeted capacity-building in developing countries to support national plans to implement all the sustainable development goals, including through North-South, South-South and triangular cooperation"
          ],
          "trade": [
            "Promote a universal, rules-based, open, non-discriminatory and equitable multilateral trading system under the World Trade Organization, including through the conclusion of negotiations under its Doha Development Agenda",
            "Significantly increase the exports of developing countries, in particular with a view to doubling the least developed countries' share of global exports by 2020",
            "Realize timely implementation of duty-free and quota-free market access on a lasting basis for all least developed countries, consistent with World Trade Organization decisions, including by ensuring that preferential rules of origin applicable to imports from least developed countries are transparent and simple, and contribute to facilitating market access"
          ],
          "systemicIssues": {
            "policyAndInstitutionalCoherence": [
              "Enhance global macroeconomic stability, including through policy coordination and policy coherence",
              "Enhance policy coherence for sustainable development",
              "Respect each country's policy space and leadership to establish and implement policies for poverty eradication and sustainable development"
            ],
            "multiStakeholderPartnerships": [
              "Enhance the global partnership for sustainable development, complemented by multi-stakeholder partnerships that mobilize and share knowledge, expertise, technology and financial resources, to support the achievement of the sustainable development goals in all countries, in particular developing countries",
              "Encourage and promote effective public, public-private and civil society partnerships, building on the experience and resourcing strategies of partnerships"
            ],
            "dataMonitoringAndAccountability": [
              "By 2020, enhance capacity-building support to developing countries, including for least developed countries and small island developing States, to increase significantly the availability of high-quality, timely and reliable data disaggregated by income, gender, age, race, ethnicity, migratory status, disability, geographic location and other characteristics relevant in national contexts",
              "By 2030, build on existing initiatives to develop measurements of progress on sustainable development that complement gross domestic product, and support statistical capacity-building in developing countries"
            ]
          }
        },
        "relatedContent": [
          {"type": "story", "title": "Despite conflict, resilience remains", "link": "/stories/despite-conflict-resilience-remains"},
          {"type": "blog", "title": "Bringing everyone to the table", "link": "/blog/bringing-everyone-to-the-table"},
          {"type": "blog", "title": "UNDP core funding: Powering sustainable development", "link": "/blog/undp-core-funding-powering-sustainable-development"},
          {"type": "blog", "title": "Breaking barriers for all women", "link": "/blog/breaking-barriers-for-all-women"},
          {"type": "blog", "title": "Women leading crisis recovery and prevention", "link": "/blog/women-leading-crisis-recovery-and-prevention"},
          {"type": "story", "title": "Botas Violeta / Purple Boots", "link": "/stories/botas-violeta-purple-boots"}
        ],
        "targetCount": 10,
        "eventCount": 127,
        "publicationCount": 24,
        "actionCount": 1258,
        "backgroundImage": "/themes/custom/porto/assets/goals/images/img-goal-11.jpg",
        "icon": "/sites/default/files/goals/E_SDG_Icons-11.jpg",
        "resources": {
          "pdfWhyItMatters": "/goal_11/11_Why-It-Matters-2020.pdf",
          "gifMakeEveryDayCount": "/goal_11/11_SDG_MakeEveryDayCount_Gifs_GDU.gif",
          "gifIcon": "/goal_11/E_GIF_11.gif",
          "actionCardSquare": "/goal_11/E_SDG_action_card_square_11.jpg",
          "actionCardTwitter": "/goal_11/E_SDG_action_card_twitter_11.jpg",
          "webInverted": "/goal_11/E_WEB_INVERTED_11.png",
          "printFile": "/goal_11/E_PRINT_11.jpg",
          "printInvertedFile": "/goal_11/E_PRINT_INVERTED_11.jpg",
          "webImage": "/goal_11/E_WEB_11.png",
          "infographics": "/goal_11/E_infographics_11.pdf",
          "elyxImage": "/goal_11/E_Elyx_11.png",
          "languagesImage": "/goal_11/Languages_11.png"
        },
        "kpis": [
          {
            "name": "Affordable Housing Availability",
            "definition": "Proportion of population in adequate housing without spending >30% of income on rent/mortgage.",
            "measurementExample": "Analyze housing surveys or census data on rent-to-income ratios."
          },
          {
            "name": "Public Transport Access",
            "definition": "Percentage of population living within convenient distance of quality public transit.",
            "measurementExample": "Map transport routes/stops vs residential density and track usage rates."
          },
          {
            "name": "Air Quality Index (AQI)",
            "definition": "Percentage of days with safe air quality levels in urban areas.",
            "measurementExample": "Use city air quality stations and compare daily AQI readings to thresholds."
          }
        ],
        "usAgencyContributions": {
          "relevantAgencies": [
            "Department of Housing and Urban Development (HUD)",
            "Department of Transportation (DOT)",
            "Environmental Protection Agency (EPA)",
            "Federal Emergency Management Agency (FEMA)",
            "Department of the Interior (DOI)",
            "United States Congress (Infrastructure, Environment, and Budget Committees)"
          ],
          "explanation": "These agencies shape sustainable urban development. HUD leads affordable housing programs and fosters equitable neighborhoods. DOT invests in resilient infrastructure and transit systems as cities face record heat waves and floods accelerated by climate change. EPA addresses urban air quality, brownfield redevelopment, and emission standards aligned with COP28's urgent call to reduce greenhouse gases. FEMA improves community resilience, mitigating disasters from hurricanes to wildfires. DOI's National Park Service supports urban green spaces. Congress allocates funds for climate-resilient projects (e.g., NEPA compliance, National Flood Insurance Program reforms) that help local governments transition to eco-smart cities, retrofit aging infrastructure, and reduce climate vulnerability. Together, they implement strategies to keep pace with rapid urbanization, new AI-based city planning, and the push to keep warming near 1.5°C."
        },
        "sampleDeals": [
          {
            "dealId": "G11-Deal1",
            "dealTitle": "Mixed-Income Transit-Oriented Development",
            "dealSteps": {
              "step1_defineProblem": "High housing costs near transit hubs push out lower-income families, increasing urban sprawl and pollution.",
              "step2_codifySolution": "HUD, DOT, and local developers partner to build mixed-income housing near new transit lines, with EPA guidelines to minimize pollution.",
              "step3_setupProgram": {
                "stakeholders": [
                  "HUD (affordable housing grants)",
                  "DOT (funding for transit expansions)",
                  "Local developers (construction + management)",
                  "EPA (environmental assessments)"
                ],
                "financing": "Federal matching grants + local tax incentives + private capital",
                "milestones": "Complete 1,000 affordable units near new rail stations in 2 years"
              },
              "step4_executeProgram": "Construct housing with mandated affordable set-asides, expand transit routes, ensure environmental compliance.",
              "step5_verifyOutcomeAndDistributeFunds": "After units fill with mixed-income residents, verify average rent levels, commute times, and AQI improvement. Disburse final HUD funds."
            }
          }
        ],
        "relevantStandards": [
          {
            "name": "Standard Name",
            "organization": "Sponsoring Organization",
            "description": "Brief description of standard",
            "url": "Link to standard documentation",
            "relevance": "How this standard supports the SDG"
          }
        ],
        "agencyServices": [
          {
            "agencyDomain": "hud.us.gov-ai.co",
            "services": [
              { "name": "Housing Assistance", "desc": "Affordable housing programs", "status": 1, "url": "https://housingassistance.hud.us.gov-ai.co" }
            ]
          },
          {
            "agencyDomain": "dot.us.gov-ai.co",
            "services": [
              { "name": "Transportation Infrastructure", "desc": "Roadways and transit", "status": 1, "url": "https://transportationinfrastructure.dot.us.gov-ai.co" },
              { "name": "FAA", "desc": "Aviation safety and regulation", "status": 1, "url": "https://faa.dot.us.gov-ai.co" }
            ]
          },
          {
            "agencyDomain": "usich.us.gov-ai.co",
            "services": [
              { "name": "Homelessness Programs", "desc": "Ending homelessness", "status": 1, "url": "https://usps.usich.us.gov-ai.co" }
            ]
          }
        ]
      },
      {
        "id": 12,
        "title": "Responsible Consumption and Production - Ensure Sustainable Resource Use",
        "text": "Encourage efficient use of resources, reduce waste, and adopt eco-friendly production and consumption patterns to protect the environment and human health.",
        "fullDescription": "The SDGs can only be realized with strong global partnerships and cooperation. Official Development Assistance remained steady but below target, at US$147 billion in 2017. While humanitarian crises brought on by conflict or natural disasters continue to demand more financial resources and aid. Many countries also require Official Development Assistance to encourage growth and trade. The world is more interconnected than ever. Improving access to technology and knowledge is an important way to share ideas and foster innovation. Coordinating policies to help developing countries manage their debt, as well as promoting investment for the least developed, is vital for sustainable growth and development. The goals aim to enhance North-South and South-South cooperation by supporting national plans to achieve all the targets. Promoting international trade, and helping developing countries increase their exports is all part of achieving a universal rules-based and equitable trading system that is fair and open and benefits all.",
        "statistics": [
          {"value": "$5 trillion", "description": "The UN Conference on Trade and Development (UNCTAD) says achieving SDGs will require US$5 trillion to $7 trillion in annual investment."},
          {"value": "$147.2 billion", "description": "Total official development assistance reached US$147.2 billion in 2017."},
          {"value": "$613 billion", "description": "In 2017, international remittances totaled US$613 billion; 76 percent of it went to developing countries."},
          {"value": "6 countries", "description": "In 2016, 6 countries met the international target to keep official development assistance at or above 0.7 percent of gross national income."},
          {"value": "$18.2 trillion", "description": "Sustainable and responsible investments represent high-potential sources of capital for SDGs. As of 2016, US$18.2 trillion was invested in this asset class."},
          {"value": "$155.5 billion", "description": "The bond market for sustainable business is growing. In 2018 global green bonds reached US$155.5billion, up 78 percent from previous year."}
        ],
        "targets": {
          "finance": [
            "Strengthen domestic resource mobilization, including through international support to developing countries, to improve domestic capacity for tax and other revenue collection",
            "Developed countries to implement fully their official development assistance commitments, including the commitment by many developed countries to achieve the target of 0.7 per cent of ODA/GNI to developing countries and 0.15 to 0.20 per cent of ODA/GNI to least developed countries ODA providers are encouraged to consider setting a target to provide at least 0.20 per cent of ODA/GNI to least developed countries",
            "Mobilize additional financial resources for developing countries from multiple sources",
            "Assist developing countries in attaining long-term debt sustainability through coordinated policies aimed at fostering debt financing, debt relief and debt restructuring, as appropriate, and address the external debt of highly indebted poor countries to reduce debt distress",
            "Adopt and implement investment promotion regimes for least developed countries"
          ],
          "technology": [
            "Enhance North-South, South-South and triangular regional and international cooperation on and access to science, technology and innovation and enhance knowledge sharing on mutually agreed terms, including through improved coordination among existing mechanisms, in particular at the United Nations level, and through a global technology facilitation mechanism",
            "Promote the development, transfer, dissemination and diffusion of environmentally sound technologies to developing countries on favourable terms, including on concessional and preferential terms, as mutually agreed",
            "Fully operationalize the technology bank and science, technology and innovation capacity-building mechanism for least developed countries by 2017 and enhance the use of enabling technology, in particular information and communications technology"
          ],
          "capacityBuilding": [
            "Enhance international support for implementing effective and targeted capacity-building in developing countries to support national plans to implement all the sustainable development goals, including through North-South, South-South and triangular cooperation"
          ],
          "trade": [
            "Promote a universal, rules-based, open, non-discriminatory and equitable multilateral trading system under the World Trade Organization, including through the conclusion of negotiations under its Doha Development Agenda",
            "Significantly increase the exports of developing countries, in particular with a view to doubling the least developed countries' share of global exports by 2020",
            "Realize timely implementation of duty-free and quota-free market access on a lasting basis for all least developed countries, consistent with World Trade Organization decisions, including by ensuring that preferential rules of origin applicable to imports from least developed countries are transparent and simple, and contribute to facilitating market access"
          ],
          "systemicIssues": {
            "policyAndInstitutionalCoherence": [
              "Enhance global macroeconomic stability, including through policy coordination and policy coherence",
              "Enhance policy coherence for sustainable development",
              "Respect each country's policy space and leadership to establish and implement policies for poverty eradication and sustainable development"
            ],
            "multiStakeholderPartnerships": [
              "Enhance the global partnership for sustainable development, complemented by multi-stakeholder partnerships that mobilize and share knowledge, expertise, technology and financial resources, to support the achievement of the sustainable development goals in all countries, in particular developing countries",
              "Encourage and promote effective public, public-private and civil society partnerships, building on the experience and resourcing strategies of partnerships"
            ],
            "dataMonitoringAndAccountability": [
              "By 2020, enhance capacity-building support to developing countries, including for least developed countries and small island developing States, to increase significantly the availability of high-quality, timely and reliable data disaggregated by income, gender, age, race, ethnicity, migratory status, disability, geographic location and other characteristics relevant in national contexts",
              "By 2030, build on existing initiatives to develop measurements of progress on sustainable development that complement gross domestic product, and support statistical capacity-building in developing countries"
            ]
          }
        },
        "relatedContent": [
          {"type": "story", "title": "Despite conflict, resilience remains", "link": "/stories/despite-conflict-resilience-remains"},
          {"type": "blog", "title": "Bringing everyone to the table", "link": "/blog/bringing-everyone-to-the-table"},
          {"type": "blog", "title": "UNDP core funding: Powering sustainable development", "link": "/blog/undp-core-funding-powering-sustainable-development"},
          {"type": "blog", "title": "Breaking barriers for all women", "link": "/blog/breaking-barriers-for-all-women"},
          {"type": "blog", "title": "Women leading crisis recovery and prevention", "link": "/blog/women-leading-crisis-recovery-and-prevention"},
          {"type": "story", "title": "Botas Violeta / Purple Boots", "link": "/stories/botas-violeta-purple-boots"}
        ],
        "targetCount": 11,
        "eventCount": 57,
        "publicationCount": 19,
        "actionCount": 1672,
        "backgroundImage": "/themes/custom/porto/assets/goals/images/img-goal-12.jpg",
        "icon": "/sites/default/files/goals/E_SDG_Icons-12.jpg",
        "resources": {
          "pdfWhyItMatters": "/goal_12/12_Why-It-Matters-2020.pdf",
          "gifMakeEveryDayCount": "/goal_12/12_SDG_MakeEveryDayCount_Gifs_GDU.gif",
          "gifIcon": "/goal_12/E_GIF_12.gif",
          "actionCardSquare": "/goal_12/E_SDG_action_card_square_12.jpg",
          "actionCardTwitter": "/goal_12/E_SDG_action_card_twitter_12.jpg",
          "webInverted": "/goal_12/E_WEB_INVERTED_12.png",
          "printFile": "/goal_12/E_PRINT_12.jpg",
          "printInvertedFile": "/goal_12/E_PRINT_INVERTED_12.jpg",
          "webImage": "/goal_12/E_WEB_12.png",
          "infographics": "/goal_12/E_infographics_12.pdf",
          "elyxImage": "/goal_12/E_Elyx_12.png",
          "languagesImage": "/goal_12/Languages_12.png"
        },
        "kpis": [
          {
            "name": "Material Footprint per Capita",
            "definition": "Raw material consumption (biomass, fossil fuels, metals, minerals) per person.",
            "measurementExample": "Calculate total materials used and divide by population."
          },
          {
            "name": "Food Waste Index",
            "definition": "Amount of food wasted at retail and consumer levels per capita.",
            "measurementExample": "Conduct waste audits and household surveys to estimate wasted edible food."
          },
          {
            "name": "Recycling Rate",
            "definition": "Percentage of solid waste that is recycled or composted instead of landfilled.",
            "measurementExample": "Track municipal waste collection data to determine diversion from landfills."
          }
        ],
        "usAgencyContributions": {
          "relevantAgencies": [
            "Environmental Protection Agency (EPA)",
            "Department of Energy (DOE)",
            "Department of Agriculture (USDA)",
            "General Services Administration (GSA)",
            "National Institute of Standards and Technology (NIST)",
            "United States Congress (Environment, Agriculture, and Budget Committees)"
          ],
          "explanation": "These agencies influence production and consumption patterns. EPA sets waste management policies, chemical safety regulations, and microplastics monitoring. DOE promotes energy efficiency across industries and better building performance to reduce resource demand. USDA addresses food waste, promotes sustainable agricultural practices, and invests in novel proteins—aligned with IPCC advice to reduce greenhouse gases from livestock. GSA's purchasing policies can drive markets toward more sustainable goods and services, and NIST develops standards/certifications for product lifecycle assessment. The U.S. Congress provides authorizations for initiatives such as the Farm Bill's conservation programs and invests in emerging R&D for carbon capture, alternative proteins, and advanced recycling technologies—vital for mitigating the urgent environmental issues identified by the 2023 UN FCCC and IPCC reports."
        },
        "sampleDeals": [
          {
            "dealId": "G12-Deal1",
            "dealTitle": "Nationwide Food Waste Reduction Program",
            "dealSteps": {
              "step1_defineProblem": "Restaurants and supermarkets discard large amounts of edible food, exacerbating landfill issues.",
              "step2_codifySolution": "EPA + USDA collaborate with local governments to incentivize food donation and composting, with GSA adopting procurement guidelines.",
              "step3_setupProgram": {
                "stakeholders": [
                  "EPA (waste management standards)",
                  "USDA (food donation and nutrition guidelines)",
                  "Local municipalities (composting infrastructure)",
                  "Food businesses (implementation of donation or composting systems)"
                ],
                "financing": "Federal tax credits for businesses donating unsold food, partial infrastructure grants for composting",
                "milestones": "Reduce food waste by 30% across participating retailers within 2 years"
              },
              "step4_executeProgram": "Set up donation logistics with food banks, track compost usage, create GSA guidelines for government cafeterias.",
              "step5_verifyOutcomeAndDistributeFunds": "EPA audits show reduced waste. Distribute tax credits and extend the program to more regions."
            }
          }
        ],
        "relevantStandards": [
          {
            "name": "Standard Name",
            "organization": "Sponsoring Organization",
            "description": "Brief description of standard",
            "url": "Link to standard documentation",
            "relevance": "How this standard supports the SDG"
          }
        ],
        "agencyServices": [
          {
            "agencyDomain": "usda.us.gov-ai.co",
            "services": [
              { "name": "Agricultural Programs", "desc": "Farming and food support", "status": 1, "url": "https://agriculturalprograms.usda.us.gov-ai.co" },
              { "name": "Farm Service Agency", "desc": "Support for farmers", "status": 1, "url": "https://fsfa.usda.us.gov-ai.co" }
            ]
          },
          {
            "agencyDomain": "cnpp.ai",
            "services": [
              { "name": "Nutrition Policy and Programs", "desc": "AI-powered nutrition policy and programs to prevent malnutrition", "status": 1, "url": "https://cnpp.ai" }
            ]
          },
          {
            "agencyDomain": "cfsan.ai",
            "services": [
              { "name": "Food Safety and Nutrition", "desc": "AI-driven approach for food safety to reduce recalls and improve nutrition", "status": 1, "url": "https://cfsan.ai" }
            ]
          },
          {
            "agencyDomain": "fda.us.gov-ai.co",
            "services": [
              { "name": "CFSAN", "desc": "Center for Food Safety and Applied Nutrition", "status": 1, "url": "https://cfsan.fda.us.gov-ai.co" }
            ]
          }
        ]
      },
      {
        "id": 13,
        "title": "Climate Action - Take Urgent Steps to Combat Climate Change",
        "text": "Strengthen resilience and adaptation to climate-related hazards by reducing emissions, enhancing disaster preparedness, and integrating climate measures into policies and strategies.",
        "fullDescription": "The SDGs can only be realized with strong global partnerships and cooperation. Official Development Assistance remained steady but below target, at US$147 billion in 2017. While humanitarian crises brought on by conflict or natural disasters continue to demand more financial resources and aid. Many countries also require Official Development Assistance to encourage growth and trade. The world is more interconnected than ever. Improving access to technology and knowledge is an important way to share ideas and foster innovation. Coordinating policies to help developing countries manage their debt, as well as promoting investment for the least developed, is vital for sustainable growth and development. The goals aim to enhance North-South and South-South cooperation by supporting national plans to achieve all the targets. Promoting international trade, and helping developing countries increase their exports is all part of achieving a universal rules-based and equitable trading system that is fair and open and benefits all.",
        "statistics": [
          {"value": "$5 trillion", "description": "The UN Conference on Trade and Development (UNCTAD) says achieving SDGs will require US$5 trillion to $7 trillion in annual investment."},
          {"value": "$147.2 billion", "description": "Total official development assistance reached US$147.2 billion in 2017."},
          {"value": "$613 billion", "description": "In 2017, international remittances totaled US$613 billion; 76 percent of it went to developing countries."},
          {"value": "6 countries", "description": "In 2016, 6 countries met the international target to keep official development assistance at or above 0.7 percent of gross national income."},
          {"value": "$18.2 trillion", "description": "Sustainable and responsible investments represent high-potential sources of capital for SDGs. As of 2016, US$18.2 trillion was invested in this asset class."},
          {"value": "$155.5 billion", "description": "The bond market for sustainable business is growing. In 2018 global green bonds reached US$155.5billion, up 78 percent from previous year."}
        ],
        "targets": {
          "finance": [
            "Strengthen domestic resource mobilization, including through international support to developing countries, to improve domestic capacity for tax and other revenue collection",
            "Developed countries to implement fully their official development assistance commitments, including the commitment by many developed countries to achieve the target of 0.7 per cent of ODA/GNI to developing countries and 0.15 to 0.20 per cent of ODA/GNI to least developed countries ODA providers are encouraged to consider setting a target to provide at least 0.20 per cent of ODA/GNI to least developed countries",
            "Mobilize additional financial resources for developing countries from multiple sources",
            "Assist developing countries in attaining long-term debt sustainability through coordinated policies aimed at fostering debt financing, debt relief and debt restructuring, as appropriate, and address the external debt of highly indebted poor countries to reduce debt distress",
            "Adopt and implement investment promotion regimes for least developed countries"
          ],
          "technology": [
            "Enhance North-South, South-South and triangular regional and international cooperation on and access to science, technology and innovation and enhance knowledge sharing on mutually agreed terms, including through improved coordination among existing mechanisms, in particular at the United Nations level, and through a global technology facilitation mechanism",
            "Promote the development, transfer, dissemination and diffusion of environmentally sound technologies to developing countries on favourable terms, including on concessional and preferential terms, as mutually agreed",
            "Fully operationalize the technology bank and science, technology and innovation capacity-building mechanism for least developed countries by 2017 and enhance the use of enabling technology, in particular information and communications technology"
          ],
          "capacityBuilding": [
            "Enhance international support for implementing effective and targeted capacity-building in developing countries to support national plans to implement all the sustainable development goals, including through North-South, South-South and triangular cooperation"
          ],
          "trade": [
            "Promote a universal, rules-based, open, non-discriminatory and equitable multilateral trading system under the World Trade Organization, including through the conclusion of negotiations under its Doha Development Agenda",
            "Significantly increase the exports of developing countries, in particular with a view to doubling the least developed countries' share of global exports by 2020",
            "Realize timely implementation of duty-free and quota-free market access on a lasting basis for all least developed countries, consistent with World Trade Organization decisions, including by ensuring that preferential rules of origin applicable to imports from least developed countries are transparent and simple, and contribute to facilitating market access"
          ],
          "systemicIssues": {
            "policyAndInstitutionalCoherence": [
              "Enhance global macroeconomic stability, including through policy coordination and policy coherence",
              "Enhance policy coherence for sustainable development",
              "Respect each country's policy space and leadership to establish and implement policies for poverty eradication and sustainable development"
            ],
            "multiStakeholderPartnerships": [
              "Enhance the global partnership for sustainable development, complemented by multi-stakeholder partnerships that mobilize and share knowledge, expertise, technology and financial resources, to support the achievement of the sustainable development goals in all countries, in particular developing countries",
              "Encourage and promote effective public, public-private and civil society partnerships, building on the experience and resourcing strategies of partnerships"
            ],
            "dataMonitoringAndAccountability": [
              "By 2020, enhance capacity-building support to developing countries, including for least developed countries and small island developing States, to increase significantly the availability of high-quality, timely and reliable data disaggregated by income, gender, age, race, ethnicity, migratory status, disability, geographic location and other characteristics relevant in national contexts",
              "By 2030, build on existing initiatives to develop measurements of progress on sustainable development that complement gross domestic product, and support statistical capacity-building in developing countries"
            ]
          }
        },
        "relatedContent": [
          {"type": "story", "title": "Despite conflict, resilience remains", "link": "/stories/despite-conflict-resilience-remains"},
          {"type": "blog", "title": "Bringing everyone to the table", "link": "/blog/bringing-everyone-to-the-table"},
          {"type": "blog", "title": "UNDP core funding: Powering sustainable development", "link": "/blog/undp-core-funding-powering-sustainable-development"},
          {"type": "blog", "title": "Breaking barriers for all women", "link": "/blog/breaking-barriers-for-all-women"},
          {"type": "blog", "title": "Women leading crisis recovery and prevention", "link": "/blog/women-leading-crisis-recovery-and-prevention"},
          {"type": "story", "title": "Botas Violeta / Purple Boots", "link": "/stories/botas-violeta-purple-boots"}
        ],
        "targetCount": 5,
        "eventCount": 82,
        "publicationCount": 39,
        "actionCount": 2182,
        "backgroundImage": "/themes/custom/porto/assets/goals/images/img-goal-13.jpg",
        "icon": "/sites/default/files/goals/E_SDG_Icons-13.jpg",
        "resources": {
          "pdfWhyItMatters": "/goal_13/13_Why-It-Matters-2020.pdf",
          "gifMakeEveryDayCount": "/goal_13/13_SDG_MakeEveryDayCount_Gifs_GDU.gif",
          "gifIcon": "/goal_13/E_GIF_13.gif",
          "actionCardSquare": "/goal_13/E_SDG_action_card_square_13.jpg",
          "actionCardTwitter": "/goal_13/E_SDG_action_card_twitter_13.jpg",
          "webInverted": "/goal_13/E_WEB_INVERTED_13.png",
          "printFile": "/goal_13/E_PRINT_13.jpg",
          "printInvertedFile": "/goal_13/E_PRINT_INVERTED_13.jpg",
          "webImage": "/goal_13/E_WEB_13.png",
          "infographics": "/goal_13/E_infographics_13.pdf",
          "elyxImage": "/goal_13/E_Elyx_13.png",
          "languagesImage": "/goal_13/Languages_13.png"
        },
        "kpis": [
          {
            "name": "Greenhouse Gas Emissions per Capita",
            "definition": "Tonnes of CO₂ equivalent emitted per person each year.",
            "measurementExample": "Summarize national emissions inventories and divide by population."
          },
          {
            "name": "Climate Adaptation and Mitigation Policies",
            "definition": "Number or proportion of regions implementing integrated climate strategies.",
            "measurementExample": "Review policy documents, local/regional plans, and legislation for climate measures."
          },
          {
            "name": "Disaster Losses",
            "definition": "Economic and human losses from climate-related disasters (e.g., % of GDP).",
            "measurementExample": "Tally disaster damage costs and displacement rates across events."
          }
        ],
        "usAgencyContributions": {
          "relevantAgencies": [
            "Environmental Protection Agency (EPA)",
            "Department of Energy (DOE)",
            "National Oceanic and Atmospheric Administration (NOAA)",
            "Federal Emergency Management Agency (FEMA)",
            "Department of State (DOS)",
            "United States Congress (Energy, Climate, and Budget Committees)"
          ],
          "explanation": "These agencies lead U.S. climate efforts across mitigation, adaptation, and international cooperation. EPA regulates GHG emissions (Clean Air Act) and partners with states to reduce coal dependency. DOE funds clean energy innovation, battery storage breakthroughs, and decarbonization strategies. NOAA provides essential climate science and monitoring, including advanced modeling to predict future extreme weather events. FEMA handles disaster response and climate resilience funding for vulnerable communities (e.g., plans for sea-level rise). DOS negotiates on the global stage (UNFCCC, IPCC, and new pacts like COP28's agreement to 'transition away from fossil fuels' and establish 'loss and damage' funds for vulnerable nations). Congress sets the legislative framework, as exemplified by the Inflation Reduction Act, establishing large-scale investment in decarbonization, carbon removal, and next-generation energy R&D—responding to IPCC calls for cutting annual GHG emissions in half by 2030."
        },
        "sampleDeals": [
          {
            "dealId": "G13-Deal1",
            "dealTitle": "Regional Coastal Resilience Strategy",
            "dealSteps": {
              "step1_defineProblem": "Coastal areas face frequent flooding from sea-level rise and hurricanes, lacking updated protective infrastructure.",
              "step2_codifySolution": "FEMA, EPA, and DOE collaborate to build green barriers, upgrade flood defenses, and relocate critical infrastructure inland.",
              "step3_setupProgram": {
                "stakeholders": [
                  "FEMA (funds + disaster planning)",
                  "EPA (environmental impact + wetlands restoration)",
                  "DOE (clean energy for new infrastructure)",
                  "Local governments (implement zoning changes)"
                ],
                "financing": "Federal climate resilience grants + state matching funds + philanthropic contributions",
                "milestones": "Reduce flood damages by 50% in target communities within 5 years"
              },
              "step4_executeProgram": "Construct sea walls, restore wetlands, update energy grids for storms, coordinate local evacuation plans.",
              "step5_verifyOutcomeAndDistributeFunds": "Assess damage after major storms. If resilience targets are met, finalize additional FEMA grants for further expansions."
            }
          }
        ],
        "relevantStandards": [
          {
            "name": "Standard Name",
            "organization": "Sponsoring Organization",
            "description": "Brief description of standard",
            "url": "Link to standard documentation",
            "relevance": "How this standard supports the SDG"
          }
        ],
        "agencyServices": [
          {
            "agencyDomain": "usda.us.gov-ai.co",
            "services": [
              { "name": "Agricultural Programs", "desc": "Farming and food support", "status": 1, "url": "https://agriculturalprograms.usda.us.gov-ai.co" },
              { "name": "Farm Service Agency", "desc": "Support for farmers", "status": 1, "url": "https://fsfa.usda.us.gov-ai.co" }
            ]
          },
          {
            "agencyDomain": "cnpp.ai",
            "services": [
              { "name": "Nutrition Policy and Programs", "desc": "AI-powered nutrition policy and programs to prevent malnutrition", "status": 1, "url": "https://cnpp.ai" }
            ]
          },
          {
            "agencyDomain": "cfsan.ai",
            "services": [
              { "name": "Food Safety and Nutrition", "desc": "AI-driven approach for food safety to reduce recalls and improve nutrition", "status": 1, "url": "https://cfsan.ai" }
            ]
          },
          {
            "agencyDomain": "fda.us.gov-ai.co",
            "services": [
              { "name": "CFSAN", "desc": "Center for Food Safety and Applied Nutrition", "status": 1, "url": "https://cfsan.fda.us.gov-ai.co" }
            ]
          }
        ]
      },
      {
        "id": 14,
        "title": "Life Below Water - Protect and Sustain Marine Ecosystems",
        "text": "Safeguard oceans, seas, and marine resources by preventing pollution, reducing overfishing, and supporting sustainable coastal and marine management for future generations.",
        "fullDescription": "The SDGs can only be realized with strong global partnerships and cooperation. Official Development Assistance remained steady but below target, at US$147 billion in 2017. While humanitarian crises brought on by conflict or natural disasters continue to demand more financial resources and aid. Many countries also require Official Development Assistance to encourage growth and trade. The world is more interconnected than ever. Improving access to technology and knowledge is an important way to share ideas and foster innovation. Coordinating policies to help developing countries manage their debt, as well as promoting investment for the least developed, is vital for sustainable growth and development. The goals aim to enhance North-South and South-South cooperation by supporting national plans to achieve all the targets. Promoting international trade, and helping developing countries increase their exports is all part of achieving a universal rules-based and equitable trading system that is fair and open and benefits all.",
        "statistics": [
          {"value": "$5 trillion", "description": "The UN Conference on Trade and Development (UNCTAD) says achieving SDGs will require US$5 trillion to $7 trillion in annual investment."},
          {"value": "$147.2 billion", "description": "Total official development assistance reached US$147.2 billion in 2017."},
          {"value": "$613 billion", "description": "In 2017, international remittances totaled US$613 billion; 76 percent of it went to developing countries."},
          {"value": "6 countries", "description": "In 2016, 6 countries met the international target to keep official development assistance at or above 0.7 percent of gross national income."},
          {"value": "$18.2 trillion", "description": "Sustainable and responsible investments represent high-potential sources of capital for SDGs. As of 2016, US$18.2 trillion was invested in this asset class."},
          {"value": "$155.5 billion", "description": "The bond market for sustainable business is growing. In 2018 global green bonds reached US$155.5billion, up 78 percent from previous year."}
        ],
        "targets": {
          "finance": [
            "Strengthen domestic resource mobilization, including through international support to developing countries, to improve domestic capacity for tax and other revenue collection",
            "Developed countries to implement fully their official development assistance commitments, including the commitment by many developed countries to achieve the target of 0.7 per cent of ODA/GNI to developing countries and 0.15 to 0.20 per cent of ODA/GNI to least developed countries ODA providers are encouraged to consider setting a target to provide at least 0.20 per cent of ODA/GNI to least developed countries",
            "Mobilize additional financial resources for developing countries from multiple sources",
            "Assist developing countries in attaining long-term debt sustainability through coordinated policies aimed at fostering debt financing, debt relief and debt restructuring, as appropriate, and address the external debt of highly indebted poor countries to reduce debt distress",
            "Adopt and implement investment promotion regimes for least developed countries"
          ],
          "technology": [
            "Enhance North-South, South-South and triangular regional and international cooperation on and access to science, technology and innovation and enhance knowledge sharing on mutually agreed terms, including through improved coordination among existing mechanisms, in particular at the United Nations level, and through a global technology facilitation mechanism",
            "Promote the development, transfer, dissemination and diffusion of environmentally sound technologies to developing countries on favourable terms, including on concessional and preferential terms, as mutually agreed",
            "Fully operationalize the technology bank and science, technology and innovation capacity-building mechanism for least developed countries by 2017 and enhance the use of enabling technology, in particular information and communications technology"
          ],
          "capacityBuilding": [
            "Enhance international support for implementing effective and targeted capacity-building in developing countries to support national plans to implement all the sustainable development goals, including through North-South, South-South and triangular cooperation"
          ],
          "trade": [
            "Promote a universal, rules-based, open, non-discriminatory and equitable multilateral trading system under the World Trade Organization, including through the conclusion of negotiations under its Doha Development Agenda",
            "Significantly increase the exports of developing countries, in particular with a view to doubling the least developed countries' share of global exports by 2020",
            "Realize timely implementation of duty-free and quota-free market access on a lasting basis for all least developed countries, consistent with World Trade Organization decisions, including by ensuring that preferential rules of origin applicable to imports from least developed countries are transparent and simple, and contribute to facilitating market access"
          ],
          "systemicIssues": {
            "policyAndInstitutionalCoherence": [
              "Enhance global macroeconomic stability, including through policy coordination and policy coherence",
              "Enhance policy coherence for sustainable development",
              "Respect each country's policy space and leadership to establish and implement policies for poverty eradication and sustainable development"
            ],
            "multiStakeholderPartnerships": [
              "Enhance the global partnership for sustainable development, complemented by multi-stakeholder partnerships that mobilize and share knowledge, expertise, technology and financial resources, to support the achievement of the sustainable development goals in all countries, in particular developing countries",
              "Encourage and promote effective public, public-private and civil society partnerships, building on the experience and resourcing strategies of partnerships"
            ],
            "dataMonitoringAndAccountability": [
              "By 2020, enhance capacity-building support to developing countries, including for least developed countries and small island developing States, to increase significantly the availability of high-quality, timely and reliable data disaggregated by income, gender, age, race, ethnicity, migratory status, disability, geographic location and other characteristics relevant in national contexts",
              "By 2030, build on existing initiatives to develop measurements of progress on sustainable development that complement gross domestic product, and support statistical capacity-building in developing countries"
            ]
          }
        },
        "relatedContent": [
          {"type": "story", "title": "Despite conflict, resilience remains", "link": "/stories/despite-conflict-resilience-remains"},
          {"type": "blog", "title": "Bringing everyone to the table", "link": "/blog/bringing-everyone-to-the-table"},
          {"type": "blog", "title": "UNDP core funding: Powering sustainable development", "link": "/blog/undp-core-funding-powering-sustainable-development"},
          {"type": "blog", "title": "Breaking barriers for all women", "link": "/blog/breaking-barriers-for-all-women"},
          {"type": "blog", "title": "Women leading crisis recovery and prevention", "link": "/blog/women-leading-crisis-recovery-and-prevention"},
          {"type": "story", "title": "Botas Violeta / Purple Boots", "link": "/stories/botas-violeta-purple-boots"}
        ],
        "targetCount": 10,
        "eventCount": 138,
        "publicationCount": 44,
        "actionCount": 2872,
        "backgroundImage": "/themes/custom/porto/assets/goals/images/img-goal-14.jpg",
        "icon": "/sites/default/files/goals/E_SDG_Icons-14.jpg",
        "resources": {
          "pdfWhyItMatters": "/goal_14/14_Why-It-Matters-2020.pdf",
          "gifMakeEveryDayCount": "/goal_14/14_SDG_MakeEveryDayCount_Gifs_GDU.gif",
          "gifIcon": "/goal_14/E_GIF_14.gif",
          "actionCardSquare": "/goal_14/E_SDG_action_card_square_14.jpg",
          "actionCardTwitter": "/goal_14/E_SDG_action_card_twitter_14.jpg",
          "webInverted": "/goal_14/E_WEB_INVERTED_14.png",
          "printFile": "/goal_14/E_PRINT_14.jpg",
          "printInvertedFile": "/goal_14/E_PRINT_INVERTED_14.jpg",
          "webImage": "/goal_14/E_WEB_14.png",
          "infographics": "/goal_14/E_infographics_14.pdf",
          "elyxImage": "/goal_14/E_Elyx_14.png",
          "languagesImage": "/goal_14/Languages_14.png"
        },
        "kpis": [
          {
            "name": "Marine Protected Areas Coverage",
            "definition": "Percentage of coastal and marine areas designated as protected within national jurisdiction.",
            "measurementExample": "Map and track official MPA boundaries vs total EEZ area."
          },
          {
            "name": "Sustainable Fish Stocks",
            "definition": "Proportion of fish stocks within biologically sustainable levels.",
            "measurementExample": "Use fishery data and scientific assessments to categorize stocks as sustainable or overfished."
          },
          {
            "name": "Coastal Water Quality (Plastic & Pollution Levels)",
            "definition": "Concentration of plastic and other pollutants in marine environments.",
            "measurementExample": "Conduct regular sampling of water and seabed for microplastics or chemical pollutants."
          }
        ],
        "usAgencyContributions": {
          "relevantAgencies": [
            "National Oceanic and Atmospheric Administration (NOAA)",
            "Environmental Protection Agency (EPA)",
            "U.S. Coast Guard (USCG)",
            "Department of the Interior (DOI)",
            "Marine Mammal Commission (MMC)",
            "United States Congress (Natural Resources, Ocean, and Budget Committees)"
          ],
          "explanation": "These agencies protect and manage marine ecosystems. NOAA leads research, fisheries management, and marine sanctuary oversight. EPA regulates pollution, sets water quality standards for U.S. coasts, and spearheads microplastics reduction. The Coast Guard enforces maritime laws, including responses to illegal, unreported, and unregulated fishing. DOI, through the Bureau of Ocean Energy Management, regulates offshore energy to balance usage with environment. The Marine Mammal Commission ensures science-based protection of species like whales, dolphins, and polar bears threatened by warming seas and acidification. Congress passes ocean conservation legislation (e.g., the Magnuson-Stevens Fishery Conservation Act) and appropriates budgets for marine research, consistent with new data from IPCC and the OECD that shipping emits more CO2 than aviation. All must address rising ocean temperatures affecting biodiversity, shipping routes, and the risk of major ocean current collapse."
        },
        "sampleDeals": [
          {
            "dealId": "G14-Deal1",
            "dealTitle": "Marine Plastics Cleanup and Fisheries Reform",
            "dealSteps": {
              "step1_defineProblem": "Major fishing zones are polluted with plastics, and overfishing threatens sustainability.",
              "step2_codifySolution": "NOAA and EPA partner to fund ocean cleanup technology and impose stricter catch limits, with USCG enforcing new fishing regulations.",
              "step3_setupProgram": {
                "stakeholders": [
                  "NOAA (fisheries management + research)",
                  "EPA (marine pollution standards)",
                  "USCG (enforcement of catch limits + plastic dumping bans)",
                  "Local fishing industry (compliance + data-sharing)"
                ],
                "financing": "Federal grants for cleanup R&D, fishing industry cost-sharing for gear upgrades",
                "milestones": "Reduce plastic concentrations in targeted marine areas by 20% in 3 years; maintain fish stocks at sustainable levels"
              },
              "step4_executeProgram": "Deploy cleanup vessels, update fishing gear to reduce bycatch, patrol for illegal dumping and overfishing.",
              "step5_verifyOutcomeAndDistributeFunds": "Regularly sample water for plastics, review fish stock assessments. If improvement meets thresholds, finalize NOAA/EPA grants for expanded coverage."
            }
          }
        ],
        "relevantStandards": [
          {
            "name": "Standard Name",
            "organization": "Sponsoring Organization",
            "description": "Brief description of standard",
            "url": "Link to standard documentation",
            "relevance": "How this standard supports the SDG"
          }
        ],
        "agencyServices": [
          {
            "agencyDomain": "usda.us.gov-ai.co",
            "services": [
              { "name": "Agricultural Programs", "desc": "Farming and food support", "status": 1, "url": "https://agriculturalprograms.usda.us.gov-ai.co" },
              { "name": "Farm Service Agency", "desc": "Support for farmers", "status": 1, "url": "https://fsfa.usda.us.gov-ai.co" }
            ]
          },
          {
            "agencyDomain": "cnpp.ai",
            "services": [
              { "name": "Nutrition Policy and Programs", "desc": "AI-powered nutrition policy and programs to prevent malnutrition", "status": 1, "url": "https://cnpp.ai" }
            ]
          },
          {
            "agencyDomain": "cfsan.ai",
            "services": [
              { "name": "Food Safety and Nutrition", "desc": "AI-driven approach for food safety to reduce recalls and improve nutrition", "status": 1, "url": "https://cfsan.ai" }
            ]
          },
          {
            "agencyDomain": "fda.us.gov-ai.co",
            "services": [
              { "name": "CFSAN", "desc": "Center for Food Safety and Applied Nutrition", "status": 1, "url": "https://cfsan.fda.us.gov-ai.co" }
            ]
          }
        ]
      },
      {
        "id": 15,
        "title": "Life on Land - Conserve and Restore Terrestrial Ecosystems",
        "text": "Protect forests, combat desertification, and halt biodiversity loss by promoting sustainable land use and restoring habitats critical for ecological balance.",
        "fullDescription": "The SDGs can only be realized with strong global partnerships and cooperation. Official Development Assistance remained steady but below target, at US$147 billion in 2017. While humanitarian crises brought on by conflict or natural disasters continue to demand more financial resources and aid. Many countries also require Official Development Assistance to encourage growth and trade. The world is more interconnected than ever. Improving access to technology and knowledge is an important way to share ideas and foster innovation. Coordinating policies to help developing countries manage their debt, as well as promoting investment for the least developed, is vital for sustainable growth and development. The goals aim to enhance North-South and South-South cooperation by supporting national plans to achieve all the targets. Promoting international trade, and helping developing countries increase their exports is all part of achieving a universal rules-based and equitable trading system that is fair and open and benefits all.",
        "statistics": [
          {"value": "$5 trillion", "description": "The UN Conference on Trade and Development (UNCTAD) says achieving SDGs will require US$5 trillion to $7 trillion in annual investment."},
          {"value": "$147.2 billion", "description": "Total official development assistance reached US$147.2 billion in 2017."},
          {"value": "$613 billion", "description": "In 2017, international remittances totaled US$613 billion; 76 percent of it went to developing countries."},
          {"value": "6 countries", "description": "In 2016, 6 countries met the international target to keep official development assistance at or above 0.7 percent of gross national income."},
          {"value": "$18.2 trillion", "description": "Sustainable and responsible investments represent high-potential sources of capital for SDGs. As of 2016, US$18.2 trillion was invested in this asset class."},
          {"value": "$155.5 billion", "description": "The bond market for sustainable business is growing. In 2018 global green bonds reached US$155.5billion, up 78 percent from previous year."}
        ],
        "targets": {
          "finance": [
            "Strengthen domestic resource mobilization, including through international support to developing countries, to improve domestic capacity for tax and other revenue collection",
            "Developed countries to implement fully their official development assistance commitments, including the commitment by many developed countries to achieve the target of 0.7 per cent of ODA/GNI to developing countries and 0.15 to 0.20 per cent of ODA/GNI to least developed countries ODA providers are encouraged to consider setting a target to provide at least 0.20 per cent of ODA/GNI to least developed countries",
            "Mobilize additional financial resources for developing countries from multiple sources",
            "Assist developing countries in attaining long-term debt sustainability through coordinated policies aimed at fostering debt financing, debt relief and debt restructuring, as appropriate, and address the external debt of highly indebted poor countries to reduce debt distress",
            "Adopt and implement investment promotion regimes for least developed countries"
          ],
          "technology": [
            "Enhance North-South, South-South and triangular regional and international cooperation on and access to science, technology and innovation and enhance knowledge sharing on mutually agreed terms, including through improved coordination among existing mechanisms, in particular at the United Nations level, and through a global technology facilitation mechanism",
            "Promote the development, transfer, dissemination and diffusion of environmentally sound technologies to developing countries on favourable terms, including on concessional and preferential terms, as mutually agreed",
            "Fully operationalize the technology bank and science, technology and innovation capacity-building mechanism for least developed countries by 2017 and enhance the use of enabling technology, in particular information and communications technology"
          ],
          "capacityBuilding": [
            "Enhance international support for implementing effective and targeted capacity-building in developing countries to support national plans to implement all the sustainable development goals, including through North-South, South-South and triangular cooperation"
          ],
          "trade": [
            "Promote a universal, rules-based, open, non-discriminatory and equitable multilateral trading system under the World Trade Organization, including through the conclusion of negotiations under its Doha Development Agenda",
            "Significantly increase the exports of developing countries, in particular with a view to doubling the least developed countries' share of global exports by 2020",
            "Realize timely implementation of duty-free and quota-free market access on a lasting basis for all least developed countries, consistent with World Trade Organization decisions, including by ensuring that preferential rules of origin applicable to imports from least developed countries are transparent and simple, and contribute to facilitating market access"
          ],
          "systemicIssues": {
            "policyAndInstitutionalCoherence": [
              "Enhance global macroeconomic stability, including through policy coordination and policy coherence",
              "Enhance policy coherence for sustainable development",
              "Respect each country's policy space and leadership to establish and implement policies for poverty eradication and sustainable development"
            ],
            "multiStakeholderPartnerships": [
              "Enhance the global partnership for sustainable development, complemented by multi-stakeholder partnerships that mobilize and share knowledge, expertise, technology and financial resources, to support the achievement of the sustainable development goals in all countries, in particular developing countries",
              "Encourage and promote effective public, public-private and civil society partnerships, building on the experience and resourcing strategies of partnerships"
            ],
            "dataMonitoringAndAccountability": [
              "By 2020, enhance capacity-building support to developing countries, including for least developed countries and small island developing States, to increase significantly the availability of high-quality, timely and reliable data disaggregated by income, gender, age, race, ethnicity, migratory status, disability, geographic location and other characteristics relevant in national contexts",
              "By 2030, build on existing initiatives to develop measurements of progress on sustainable development that complement gross domestic product, and support statistical capacity-building in developing countries"
            ]
          }
        },
        "relatedContent": [
          {"type": "story", "title": "Despite conflict, resilience remains", "link": "/stories/despite-conflict-resilience-remains"},
          {"type": "blog", "title": "Bringing everyone to the table", "link": "/blog/bringing-everyone-to-the-table"},
          {"type": "blog", "title": "UNDP core funding: Powering sustainable development", "link": "/blog/undp-core-funding-powering-sustainable-development"},
          {"type": "blog", "title": "Breaking barriers for all women", "link": "/blog/breaking-barriers-for-all-women"},
          {"type": "blog", "title": "Women leading crisis recovery and prevention", "link": "/blog/women-leading-crisis-recovery-and-prevention"},
          {"type": "story", "title": "Botas Violeta / Purple Boots", "link": "/stories/botas-violeta-purple-boots"}
        ],
        "targetCount": 12,
        "eventCount": 56,
        "publicationCount": 35,
        "actionCount": 1336,
        "backgroundImage": "/themes/custom/porto/assets/goals/images/img-goal-15.jpg",
        "icon": "/sites/default/files/goals/E_SDG_Icons-15.jpg",
        "resources": {
          "pdfWhyItMatters": "/goal_15/15_Why-It-Matters-2020.pdf",
          "gifMakeEveryDayCount": "/goal_15/15_SDG_MakeEveryDayCount_Gifs_GDU.gif",
          "gifIcon": "/goal_15/E_GIF_15.gif",
          "actionCardSquare": "/goal_15/E_SDG_action_card_square_15.jpg",
          "actionCardTwitter": "/goal_15/E_SDG_action_card_twitter_15.jpg",
          "webInverted": "/goal_15/E_WEB_INVERTED_15.png",
          "printFile": "/goal_15/E_PRINT_15.jpg",
          "printInvertedFile": "/goal_15/E_PRINT_INVERTED_15.jpg",
          "webImage": "/goal_15/E_WEB_15.png",
          "infographics": "/goal_15/E_infographics_15.pdf",
          "elyxImage": "/goal_15/E_Elyx_15.png",
          "languagesImage": "/goal_15/Languages_15.png"
        },
        "kpis": [
          {
            "name": "Forest Area as % of Total Land",
            "definition": "Proportion of land area covered by forest.",
            "measurementExample": "Use satellite imagery or national forestry inventories to measure forest extent."
          },
          {
            "name": "Red List Index (Biodiversity)",
            "definition": "Measure of species extinction risk based on IUCN data.",
            "measurementExample": "Track changes in the conservation status of species over time."
          },
          {
            "name": "Protected Areas Coverage",
            "definition": "Percentage of important biodiversity sites that are protected.",
            "measurementExample": "Overlay protected area maps with critical biodiversity hotspot data."
          }
        ],
        "usAgencyContributions": {
          "relevantAgencies": [
            "Department of the Interior (DOI)",
            "U.S. Forest Service (USFS)",
            "Fish and Wildlife Service (FWS)",
            "Environmental Protection Agency (EPA)",
            "Natural Resources Conservation Service (NRCS)",
            "United States Congress (Natural Resources and Budget Committees)"
          ],
          "explanation": "These agencies oversee terrestrial ecosystem management. DOI (notably BLM and National Park Service) safeguards 245+ million acres of public lands, balancing sustainable use with conservation. The USFS manages the National Forest System, focusing on reforestation and climate resilience. FWS protects endangered species and oversees refuges key to biodiversity. EPA enforces pesticide regulations and monitors soil/water pollution. NRCS works with private landowners on sustainable agriculture and habitat conservation. The U.S. Congress enacts laws (e.g., the Endangered Species Act, Farm Bill conservation titles) and allocates budgets for reforestation, carbon sequestration, and preventing desertification—vital for meeting global pledges under the 2022 IPCC and other climate-biodiversity compacts."
        },
        "sampleDeals": [
          {
            "dealId": "G15-Deal1",
            "dealTitle": "National Reforestation and Habitat Restoration",
            "dealSteps": {
              "step1_defineProblem": "Large areas of forest lost due to wildfires and deforestation, threatening biodiversity and carbon capture.",
              "step2_codifySolution": "USFS, FWS, and NRCS collaborate with private landowners to plant climate-resilient seedlings and restore habitats.",
              "step3_setupProgram": {
                "stakeholders": [
                  "USFS (seedling supply + oversight)",
                  "FWS (wildlife habitat guidelines)",
                  "Private landowners (land usage + maintenance)",
                  "NRCS (technical + financial assistance)"
                ],
                "financing": "Federal cost-share from Congress + state reforestation grants, carbon offset credits",
                "milestones": "Reforest 1 million acres in priority zones over 3 years"
              },
              "step4_executeProgram": "Coordinate planting schedules, ensure water supply, monitor biodiversity post-restoration.",
              "step5_verifyOutcomeAndDistributeFunds": "Check survival rates, carbon capture data, and species return. If targets met, finalize reimbursements to landowners."
            }
          }
        ],
        "relevantStandards": [
          {
            "name": "Standard Name",
            "organization": "Sponsoring Organization",
            "description": "Brief description of standard",
            "url": "Link to standard documentation",
            "relevance": "How this standard supports the SDG"
          }
        ],
        "agencyServices": [
          {
            "agencyDomain": "usda.us.gov-ai.co",
            "services": [
              { "name": "Agricultural Programs", "desc": "Farming and food support", "status": 1, "url": "https://agriculturalprograms.usda.us.gov-ai.co" },
              { "name": "Farm Service Agency", "desc": "Support for farmers", "status": 1, "url": "https://fsfa.usda.us.gov-ai.co" }
            ]
          },
          {
            "agencyDomain": "cnpp.ai",
            "services": [
              { "name": "Nutrition Policy and Programs", "desc": "AI-powered nutrition policy and programs to prevent malnutrition", "status": 1, "url": "https://cnpp.ai" }
            ]
          },
          {
            "agencyDomain": "cfsan.ai",
            "services": [
              { "name": "Food Safety and Nutrition", "desc": "AI-driven approach for food safety to reduce recalls and improve nutrition", "status": 1, "url": "https://cfsan.ai" }
            ]
          },
          {
            "agencyDomain": "fda.us.gov-ai.co",
            "services": [
              { "name": "CFSAN", "desc": "Center for Food Safety and Applied Nutrition", "status": 1, "url": "https://cfsan.fda.us.gov-ai.co" }
            ]
          }
        ]
      },
      {
        "id": 16,
        "title": "Peace, Justice and Strong Institutions - Build Inclusive and Accountable Societies",
        "text": "Reduce violence, improve access to justice, and foster transparent institutions at all levels to promote peace, uphold human rights, and ensure inclusive governance.",
        "fullDescription": "The SDGs can only be realized with strong global partnerships and cooperation. Official Development Assistance remained steady but below target, at US$147 billion in 2017. While humanitarian crises brought on by conflict or natural disasters continue to demand more financial resources and aid. Many countries also require Official Development Assistance to encourage growth and trade. The world is more interconnected than ever. Improving access to technology and knowledge is an important way to share ideas and foster innovation. Coordinating policies to help developing countries manage their debt, as well as promoting investment for the least developed, is vital for sustainable growth and development. The goals aim to enhance North-South and South-South cooperation by supporting national plans to achieve all the targets. Promoting international trade, and helping developing countries increase their exports is all part of achieving a universal rules-based and equitable trading system that is fair and open and benefits all.",
        "statistics": [
          {"value": "$5 trillion", "description": "The UN Conference on Trade and Development (UNCTAD) says achieving SDGs will require US$5 trillion to $7 trillion in annual investment."},
          {"value": "$147.2 billion", "description": "Total official development assistance reached US$147.2 billion in 2017."},
          {"value": "$613 billion", "description": "In 2017, international remittances totaled US$613 billion; 76 percent of it went to developing countries."},
          {"value": "6 countries", "description": "In 2016, 6 countries met the international target to keep official development assistance at or above 0.7 percent of gross national income."},
          {"value": "$18.2 trillion", "description": "Sustainable and responsible investments represent high-potential sources of capital for SDGs. As of 2016, US$18.2 trillion was invested in this asset class."},
          {"value": "$155.5 billion", "description": "The bond market for sustainable business is growing. In 2018 global green bonds reached US$155.5billion, up 78 percent from previous year."}
        ],
        "targets": {
          "finance": [
            "Strengthen domestic resource mobilization, including through international support to developing countries, to improve domestic capacity for tax and other revenue collection",
            "Developed countries to implement fully their official development assistance commitments, including the commitment by many developed countries to achieve the target of 0.7 per cent of ODA/GNI to developing countries and 0.15 to 0.20 per cent of ODA/GNI to least developed countries ODA providers are encouraged to consider setting a target to provide at least 0.20 per cent of ODA/GNI to least developed countries",
            "Mobilize additional financial resources for developing countries from multiple sources",
            "Assist developing countries in attaining long-term debt sustainability through coordinated policies aimed at fostering debt financing, debt relief and debt restructuring, as appropriate, and address the external debt of highly indebted poor countries to reduce debt distress",
            "Adopt and implement investment promotion regimes for least developed countries"
          ],
          "technology": [
            "Enhance North-South, South-South and triangular regional and international cooperation on and access to science, technology and innovation and enhance knowledge sharing on mutually agreed terms, including through improved coordination among existing mechanisms, in particular at the United Nations level, and through a global technology facilitation mechanism",
            "Promote the development, transfer, dissemination and diffusion of environmentally sound technologies to developing countries on favourable terms, including on concessional and preferential terms, as mutually agreed",
            "Fully operationalize the technology bank and science, technology and innovation capacity-building mechanism for least developed countries by 2017 and enhance the use of enabling technology, in particular information and communications technology"
          ],
          "capacityBuilding": [
            "Enhance international support for implementing effective and targeted capacity-building in developing countries to support national plans to implement all the sustainable development goals, including through North-South, South-South and triangular cooperation"
          ],
          "trade": [
            "Promote a universal, rules-based, open, non-discriminatory and equitable multilateral trading system under the World Trade Organization, including through the conclusion of negotiations under its Doha Development Agenda",
            "Significantly increase the exports of developing countries, in particular with a view to doubling the least developed countries' share of global exports by 2020",
            "Realize timely implementation of duty-free and quota-free market access on a lasting basis for all least developed countries, consistent with World Trade Organization decisions, including by ensuring that preferential rules of origin applicable to imports from least developed countries are transparent and simple, and contribute to facilitating market access"
          ],
          "systemicIssues": {
            "policyAndInstitutionalCoherence": [
              "Enhance global macroeconomic stability, including through policy coordination and policy coherence",
              "Enhance policy coherence for sustainable development",
              "Respect each country's policy space and leadership to establish and implement policies for poverty eradication and sustainable development"
            ],
            "multiStakeholderPartnerships": [
              "Enhance the global partnership for sustainable development, complemented by multi-stakeholder partnerships that mobilize and share knowledge, expertise, technology and financial resources, to support the achievement of the sustainable development goals in all countries, in particular developing countries",
              "Encourage and promote effective public, public-private and civil society partnerships, building on the experience and resourcing strategies of partnerships"
            ],
            "dataMonitoringAndAccountability": [
              "By 2020, enhance capacity-building support to developing countries, including for least developed countries and small island developing States, to increase significantly the availability of high-quality, timely and reliable data disaggregated by income, gender, age, race, ethnicity, migratory status, disability, geographic location and other characteristics relevant in national contexts",
              "By 2030, build on existing initiatives to develop measurements of progress on sustainable development that complement gross domestic product, and support statistical capacity-building in developing countries"
            ]
          }
        },
        "relatedContent": [
          {"type": "story", "title": "Despite conflict, resilience remains", "link": "/stories/despite-conflict-resilience-remains"},
          {"type": "blog", "title": "Bringing everyone to the table", "link": "/blog/bringing-everyone-to-the-table"},
          {"type": "blog", "title": "UNDP core funding: Powering sustainable development", "link": "/blog/undp-core-funding-powering-sustainable-development"},
          {"type": "blog", "title": "Breaking barriers for all women", "link": "/blog/breaking-barriers-for-all-women"},
          {"type": "blog", "title": "Women leading crisis recovery and prevention", "link": "/blog/women-leading-crisis-recovery-and-prevention"},
          {"type": "story", "title": "Botas Violeta / Purple Boots", "link": "/stories/botas-violeta-purple-boots"}
        ],
        "targetCount": 12,
        "eventCount": 75,
        "publicationCount": 15,
        "actionCount": 1053,
        "backgroundImage": "/themes/custom/porto/assets/goals/images/img-goal-16.jpg",
        "icon": "/sites/default/files/goals/E_SDG_Icons-16.jpg",
        "resources": {
          "pdfWhyItMatters": "/goal_16/16_Why-It-Matters-2020.pdf",
          "gifMakeEveryDayCount": "/goal_16/16_SDG_MakeEveryDayCount_Gifs_GDU.gif",
          "gifIcon": "/goal_16/E_GIF_16.gif",
          "actionCardSquare": "/goal_16/E_SDG_action_card_square_16.jpg",
          "actionCardTwitter": "/goal_16/E_SDG_action_card_twitter_16.jpg",
          "webInverted": "/goal_16/E_WEB_INVERTED_16.png",
          "printFile": "/goal_16/E_PRINT_16.jpg",
          "printInvertedFile": "/goal_16/E_PRINT_INVERTED_16.jpg",
          "webImage": "/goal_16/E_WEB_16.png",
          "infographics": "/goal_16/E_infographics_16.pdf",
          "elyxImage": "/goal_16/E_Elyx_16.png",
          "languagesImage": "/goal_16/Languages_16.png"
        },
        "kpis": [
          {
            "name": "Homicide Rate",
            "definition": "Number of intentional homicides per 100,000 people.",
            "measurementExample": "Aggregate official police or health system reports on homicides."
          },
          {
            "name": "Access to Justice",
            "definition": "Proportion of population able to resolve legal problems through fair mechanisms.",
            "measurementExample": "Survey experiences with courts, mediation, or legal aid services."
          },
          {
            "name": "Institutional Transparency",
            "definition": "Rating or perception of government freedom from corruption and accountability.",
            "measurementExample": "Use indices like Transparency International or citizen surveys."
          }
        ],
        "usAgencyContributions": {
          "relevantAgencies": [
            "Department of Justice (DOJ)",
            "Department of State (DOS)",
            "United States Agency for International Development (USAID)",
            "Federal Bureau of Investigation (FBI)",
            "Office of Government Ethics (OGE)",
            "United States Congress (Judiciary, Foreign Relations, and Budget Committees)"
          ],
          "explanation": "These agencies strengthen governance and justice systems. DOJ enforces the rule of law and civil rights domestically. DOS advocates democracy, human rights, and rule of law internationally, aligning with global synergy to minimize conflict drivers (e.g., environmental stress, resource competition). USAID builds judicial capacity and anti-corruption programs abroad. The FBI addresses domestic terrorism, cybercrime, and foreign intelligence threats that endanger peace. OGE sets standards of ethical conduct for federal employees. The U.S. Congress, particularly the Judiciary and Foreign Relations Committees, shapes legislation (e.g., the Global Magnitsky Act) enabling sanctions against human rights violators, and the allocation of resources to support democratic institutions overseas. In an era of advanced AI-driven information warfare, synergy among these agencies is crucial to uphold free elections and stable governance at home and abroad."
        },
        "sampleDeals": [
          {
            "dealId": "G16-Deal1",
            "dealTitle": "Community Policing and Justice Access Program",
            "dealSteps": {
              "step1_defineProblem": "High homicide rates in certain neighborhoods, plus limited trust in law enforcement and courts.",
              "step2_codifySolution": "DOJ + FBI expand community policing grants, create local mediation centers, with oversight from OGE to ensure ethical conduct.",
              "step3_setupProgram": {
                "stakeholders": [
                  "DOJ (grants + policy guidance)",
                  "FBI (support on violent crime investigations)",
                  "Local police departments (community policing implementation)",
                  "Nonprofits (mediation + legal aid services)"
                ],
                "financing": "Congress-appropriated funds for policing grants, training, and community outreach",
                "milestones": "Reduce homicides by 25%, increase positive community satisfaction with police by 30% in pilot areas"
              },
              "step4_executeProgram": "Recruit officers for community policing units, set up mediation centers, track data on neighborhood safety.",
              "step5_verifyOutcomeAndDistributeFunds": "Review homicide stats and citizen surveys. If improvements meet targets, finalize additional funding for expansion."
            }
          }
        ],
        "relevantStandards": [
          {
            "name": "Standard Name",
            "organization": "Sponsoring Organization",
            "description": "Brief description of standard",
            "url": "Link to standard documentation",
            "relevance": "How this standard supports the SDG"
          }
        ],
        "agencyServices": [
          {
            "agencyDomain": "doj.us.gov-ai.co",
            "services": [
              { "name": "FBI", "desc": "Federal investigations", "status": 3, "url": "https://fbi.doj.us.gov-ai.co" },
              { "name": "ATF", "desc": "Alcohol, Tobacco, Firearms & Explosives", "status": 2, "url": "https://atf.doj.us.gov-ai.co" },
              { "name": "DEA", "desc": "Drug enforcement", "status": 1, "url": "https://dea.doj.us.gov-ai.co" },
              { "name": "U.S. Marshals", "desc": "Apprehension and transport of federal fugitives", "status": 2, "url": "https://usms.doj.us.gov-ai.co" }
            ]
          },
          {
            "agencyDomain": "nara.us.gov-ai.co",
            "services": [
              { "name": "ERKS", "desc": "Office of Innovation - Responsible for increasing access to records and serving customers", "status": 3, "url": "https://erks.nara.us.gov-ai.co" },
              { "name": "ERMS", "desc": "Digital Engagement - Coordinates NARA's efforts for Open Government and the National Digital Strategy", "status": 2, "url": "https://erms.nara.us.gov-ai.co" }
            ]
          },
          {
            "agencyDomain": "dhs.us.gov-ai.co",
            "services": [
              { "name": "CISA", "desc": "Cybersecurity and Infrastructure Security", "status": 2, "url": "https://cisa.dhs.us.gov-ai.co" }
            ]
          }
        ]
      },
      {
        "id": 17,
        "title": "Partnerships for the Goals - Strengthen Global Collaboration",
        "text": "Encourage cooperation among governments, the private sector, and civil society to share knowledge, technology, and resources, ensuring the achievement of all Sustainable Development Goals.",
        "fullDescription": "The SDGs can only be realized with strong global partnerships and cooperation. Official Development Assistance remained steady but below target, at US$147 billion in 2017. While humanitarian crises brought on by conflict or natural disasters continue to demand more financial resources and aid. Many countries also require Official Development Assistance to encourage growth and trade. The world is more interconnected than ever. Improving access to technology and knowledge is an important way to share ideas and foster innovation. Coordinating policies to help developing countries manage their debt, as well as promoting investment for the least developed, is vital for sustainable growth and development. The goals aim to enhance North-South and South-South cooperation by supporting national plans to achieve all the targets. Promoting international trade, and helping developing countries increase their exports is all part of achieving a universal rules-based and equitable trading system that is fair and open and benefits all.",
        "statistics": [
          {"value": "$5 trillion", "description": "The UN Conference on Trade and Development (UNCTAD) says achieving SDGs will require US$5 trillion to $7 trillion in annual investment."},
          {"value": "$147.2 billion", "description": "Total official development assistance reached US$147.2 billion in 2017."},
          {"value": "$613 billion", "description": "In 2017, international remittances totaled US$613 billion; 76 percent of it went to developing countries."},
          {"value": "6 countries", "description": "In 2016, 6 countries met the international target to keep official development assistance at or above 0.7 percent of gross national income."},
          {"value": "$18.2 trillion", "description": "Sustainable and responsible investments represent high-potential sources of capital for SDGs. As of 2016, US$18.2 trillion was invested in this asset class."},
          {"value": "$155.5 billion", "description": "The bond market for sustainable business is growing. In 2018 global green bonds reached US$155.5billion, up 78 percent from previous year."}
        ],
        "targets": {
          "finance": [
            "Strengthen domestic resource mobilization, including through international support to developing countries, to improve domestic capacity for tax and other revenue collection",
            "Developed countries to implement fully their official development assistance commitments, including the commitment by many developed countries to achieve the target of 0.7 per cent of ODA/GNI to developing countries and 0.15 to 0.20 per cent of ODA/GNI to least developed countries ODA providers are encouraged to consider setting a target to provide at least 0.20 per cent of ODA/GNI to least developed countries",
            "Mobilize additional financial resources for developing countries from multiple sources",
            "Assist developing countries in attaining long-term debt sustainability through coordinated policies aimed at fostering debt financing, debt relief and debt restructuring, as appropriate, and address the external debt of highly indebted poor countries to reduce debt distress",
            "Adopt and implement investment promotion regimes for least developed countries"
          ],
          "technology": [
            "Enhance North-South, South-South and triangular regional and international cooperation on and access to science, technology and innovation and enhance knowledge sharing on mutually agreed terms, including through improved coordination among existing mechanisms, in particular at the United Nations level, and through a global technology facilitation mechanism",
            "Promote the development, transfer, dissemination and diffusion of environmentally sound technologies to developing countries on favourable terms, including on concessional and preferential terms, as mutually agreed",
            "Fully operationalize the technology bank and science, technology and innovation capacity-building mechanism for least developed countries by 2017 and enhance the use of enabling technology, in particular information and communications technology"
          ],
          "capacityBuilding": [
            "Enhance international support for implementing effective and targeted capacity-building in developing countries to support national plans to implement all the sustainable development goals, including through North-South, South-South and triangular cooperation"
          ],
          "trade": [
            "Promote a universal, rules-based, open, non-discriminatory and equitable multilateral trading system under the World Trade Organization, including through the conclusion of negotiations under its Doha Development Agenda",
            "Significantly increase the exports of developing countries, in particular with a view to doubling the least developed countries' share of global exports by 2020",
            "Realize timely implementation of duty-free and quota-free market access on a lasting basis for all least developed countries, consistent with World Trade Organization decisions, including by ensuring that preferential rules of origin applicable to imports from least developed countries are transparent and simple, and contribute to facilitating market access"
          ],
          "systemicIssues": {
            "policyAndInstitutionalCoherence": [
              "Enhance global macroeconomic stability, including through policy coordination and policy coherence",
              "Enhance policy coherence for sustainable development",
              "Respect each country's policy space and leadership to establish and implement policies for poverty eradication and sustainable development"
            ],
            "multiStakeholderPartnerships": [
              "Enhance the global partnership for sustainable development, complemented by multi-stakeholder partnerships that mobilize and share knowledge, expertise, technology and financial resources, to support the achievement of the sustainable development goals in all countries, in particular developing countries",
              "Encourage and promote effective public, public-private and civil society partnerships, building on the experience and resourcing strategies of partnerships"
            ],
            "dataMonitoringAndAccountability": [
              "By 2020, enhance capacity-building support to developing countries, including for least developed countries and small island developing States, to increase significantly the availability of high-quality, timely and reliable data disaggregated by income, gender, age, race, ethnicity, migratory status, disability, geographic location and other characteristics relevant in national contexts",
              "By 2030, build on existing initiatives to develop measurements of progress on sustainable development that complement gross domestic product, and support statistical capacity-building in developing countries"
            ]
          }
        },
        "relatedContent": [
          {"type": "story", "title": "Despite conflict, resilience remains", "link": "/stories/despite-conflict-resilience-remains"},
          {"type": "blog", "title": "Bringing everyone to the table", "link": "/blog/bringing-everyone-to-the-table"},
          {"type": "blog", "title": "UNDP core funding: Powering sustainable development", "link": "/blog/undp-core-funding-powering-sustainable-development"},
          {"type": "blog", "title": "Breaking barriers for all women", "link": "/blog/breaking-barriers-for-all-women"},
          {"type": "blog", "title": "Women leading crisis recovery and prevention", "link": "/blog/women-leading-crisis-recovery-and-prevention"},
          {"type": "story", "title": "Botas Violeta / Purple Boots", "link": "/stories/botas-violeta-purple-boots"}
        ],
        "targetCount": 19,
        "eventCount": 321,
        "publicationCount": 81,
        "actionCount": 2238,
        "backgroundImage": "/themes/custom/porto/assets/goals/images/img-goal-17.jpg",
        "icon": "/sites/default/files/goals/E_SDG_Icons-17.jpg",
        "resources": {
          "pdfWhyItMatters": "/goal_17/17_Why-It-Matters-2020.pdf",
          "gifMakeEveryDayCount": "/goal_17/17_SDG_MakeEveryDayCount_Gifs_GDU.gif",
          "gifIcon": "/goal_17/E_GIF_17.gif",
          "actionCardSquare": "/goal_17/E_SDG_action_card_square_17.jpg",
          "actionCardTwitter": "/goal_17/E_SDG_action_card_twitter_17.jpg",
          "webInverted": "/goal_17/E_WEB_INVERTED_17.png",
          "printFile": "/goal_17/E_PRINT_17.jpg",
          "printInvertedFile": "/goal_17/E_PRINT_INVERTED_17.jpg",
          "webImage": "/goal_17/E_WEB_17.png",
          "infographics": "/goal_17/E_infographics_17.pdf",
          "elyxImage": "/goal_17/E_Elyx_17.png",
          "languagesImage": "/goal_17/Languages_17.png"
        },
        "kpis": [
          {
            "name": "Official Development Assistance (ODA) as % of GNI",
            "definition": "Ratio of ODA to a donor country's gross national income.",
            "measurementExample": "Collect government reports on foreign aid budgets and compare to total GNI."
          },
          {
            "name": "Multi-Stakeholder Partnerships",
            "definition": "Number of collaborative efforts among government, NGOs, and the private sector.",
            "measurementExample": "Track formal MOUs or active joint projects with multiple stakeholder involvement."
          },
          {
            "name": "Technology Transfer and Capacity Building",
            "definition": "Frequency of knowledge-sharing initiatives and training programs supporting SDG implementation.",
            "measurementExample": "Count or survey technology-sharing programs, measure participant skill uptake."
          }
        ],
        "usAgencyContributions": {
          "relevantAgencies": [
            "Department of State (DOS)",
            "United States Agency for International Development (USAID)",
            "United States Trade and Development Agency (USTDA)",
            "Office of Management and Budget (OMB)",
            "Export-Import Bank of the United States (EXIM)",
            "United States Congress (Foreign Affairs, International Relations, Budget Committees)"
          ],
          "explanation": "These agencies facilitate international cooperation and partnership building to drive the SDGs. DOS manages foreign policy and diplomatic relations essential for forging alliances to combat climate change, global pandemics, and conflict. USAID coordinates development and humanitarian programs worldwide. USTDA fosters trade by connecting U.S. businesses to infrastructure projects in developing countries. OMB oversees federal performance and data-sharing across agencies, crucial for multi-stakeholder transparency. EXIM provides export financing to open markets abroad and fosters private-public partnerships. Congress's committees authorize multi-year funds for sustainable development, technology transfers, and capacity building. The 2023 UN FCCC report calls for global systems transformations to achieve the Paris Agreement goals—these partnerships are instrumental for mobilizing trillions in investment, bridging scientific research with real-world implementation, and mitigating conflict over scarce resources."
        },
        "sampleDeals": [
          {
            "dealId": "G17-Deal1",
            "dealTitle": "Global Public-Private Innovation Accelerator",
            "dealSteps": {
              "step1_defineProblem": "Developing countries lack technical and financial capacity for green infrastructure, hindering SDG progress.",
              "step2_codifySolution": "DOS + USAID + USTDA coordinate with private tech firms to co-invest in clean energy and water solutions abroad.",
              "step3_setupProgram": {
                "stakeholders": [
                  "DOS (diplomatic channels + policy alignment)",
                  "USAID (development grants + local partnership)",
                  "USTDA (project feasibility studies)",
                  "Private corporations (technology + co-financing)",
                  "EXIM (financing for exports)"
                ],
                "financing": "Public + private blended capital, Congress-approved ODA, EXIM export credits",
                "milestones": "Launch 10 joint infrastructure projects in low-income countries over 2 years"
              },
              "step4_executeProgram": "Deploy technology with local governments, provide training and capacity building, ensure local ownership.",
              "step5_verifyOutcomeAndDistributeFunds": "Assess the projects' energy/water outcomes. If successful, expand partnerships and release further grants."
            }
          }
        ],
        "relevantStandards": [
          {
            "name": "Standard Name",
            "organization": "Sponsoring Organization",
            "description": "Brief description of standard",
            "url": "Link to standard documentation",
            "relevance": "How this standard supports the SDG"
          }
        ],
        "agencyServices": [
          {
            "agencyDomain": "ustda.ai",
            "services": [
              { "name": "International Trade", "desc": "Use data from UNDP to find opportunities for American trade deals that benefit the deficit", "status": 1, "url": "https://ustda.ai" }
            ]
          },
          {
            "agencyDomain": "ustda.us.gov-ai.co",
            "services": [
              { "name": "Trade Development", "desc": "International trade support", "status": 1, "url": "https://mgl.ustda.us.gov-ai.co" }
            ]
          },
          {
            "agencyDomain": "dos.us.gov-ai.co",
            "services": [
              { "name": "Diplomatic Services", "desc": "Diplomacy and international relations", "status": 1, "url": "https://diplomatic.dos.us.gov-ai.co" },
              { "name": "Consular Affairs", "desc": "Assistance to American citizens abroad", "status": 1, "url": "https://consular.dos.us.gov-ai.co" }
            ]
          }
        ]
      }
    ]
